{"id":2839,"date":"2016-08-26T11:47:27","date_gmt":"2016-08-26T18:47:27","slug":"andrew-mcgaffey-caliskate","title":"Founders Interview: Andrew McGaffey of Caliskate","content":"<p><em>Andrew McGaffey is the founder of Caliskate. He contacted us a while ago and offered to send us a set of bearings to test them out. We haven’t been disappointed at all and that’s why we were glad to share them with you in our <a href=\"https://krakbox.com/shop/product/447772649\" target=\"_blank\" rel=\"noopener\">Old School KrakBox</a>. We’ve always been true believers in the importance of good bearings so we put together a few questions for him. k.</em></p>\n<p><span style=\"color: #ff0000;\"><strong>Could you explain what a ‘good bearing’ is?<br />\n</strong></span>A good bearing is made with stainless steel and the most precise measurements, the accuracy of the size of the parts is what makes the biggest difference in the long run. The ABEC scale is how the measurements are rated, but it also depends on the production process. One company might make a better &#8220;ABEC 5&#8221; bearing than another companies &#8220;ABEC 9&#8221;. Therefore, the ABEC scale isn&#8217;t very reliable.</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you have some recommendations for keeping the bearings efficient and clean? Make them last longer?<br />\n</strong></span>The best way to extend the life of bearings is to keep them clean and not let them get wet, dirty, etc. To keep them safe and efficient, riders must clean and oil their bearings regularly. It’s important to use high quality oil or creme.</p>\n<p><span style=\"color: #ff0000;\"><strong>What are the do’s and dont’s with the bearings?<br />\n</strong></span>Hmm that’s a good question. I would say do buy good bearings and don&#8217;t buy bad bearings haha! But most importantly, if you ride in water or around sand, clean your bearings afterwards.</p>\n<p><img class=\"aligncenter size-full wp-image-2840\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/caliskate-bearings.jpg\" alt=\"\" width=\"680\" height=\"510\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/caliskate-bearings.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/caliskate-bearings.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Ok, a little bit about yourself: where are you from? Where are you based now? When/how did you start skateboarding?<br />\n</strong></span>I’m from Seattle, Washington. Caliskate is currently based out of Portland, Oregon area. I started skateboarding when I was about 7 years old. We had a neighborhood group of boys and we wanted to be sponsored so badly.</p>\n<p><span style=\"color: #ff0000;\"><strong>Why did you a start a bearing company?<br />\n</strong></span>I started a bearing company because I wanted to be able to provide a bearing that wasn&#8217;t super expensive, but performed at the level of the top brands. What a lot of companies will do is mark them way up when they sell them, but they may not even be produced through a quality production process. I also really like being involved in the skate community all throughout the world, and this company makes that possible for me.</p>\n<p><span style=\"color: #ff0000;\"><strong>When did you launch Caliskate exactly? And where does that name come from?<br />\n</strong></span>I launched Caliskate in January of this year. We’re a new company, but things were fast to take off. I named it Caliskate because California is where I first fell in love with skateboarding. I love the weather, beaches, and skating there. I hope to move there before too long.</p>\n<p><span style=\"color: #ff0000;\"><strong>I know there’s a ‘Mike’ who helps you. How many of you in the team?<br />\n</strong></span>There&#8217;s 3 people that help me. My main guy that’s been working the hardest with me is my brother, Gabe. While I&#8217;m away he holds down the company.</p>\n<p><span style=\"color: #ff0000;\"><strong>Who’s on your skate team?<br />\n</strong></span>Laird Brunson, Billy Meeks and the Century skate guys. They&#8217;re all super chill and rad skaters.</p>\n<div id=\"attachment_2841\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2841\" class=\"size-full wp-image-2841\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/caliskate-Laird-Brunson.jpg\" alt=\"Laird Brunson\" width=\"680\" height=\"555\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/caliskate-Laird-Brunson.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/caliskate-Laird-Brunson.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2841\" class=\"wp-caption-text\">Laird Brunson</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Future plans? What could we wish you?<br />\n</strong></span>The future of Caliskate is actually really exciting. There’s new bearing tech being developed by a Japanese company. I can&#8217;t say much right now. But just imagine a zero friction bearing. Just wish us luck with the new production.</p>\n<p><span style=\"color: #ff0000;\"><strong>Shout outs?<br />\n</strong></span>Shoutout to God foremost, also Gabe, Mike, and thanks to Kevin at Krak!</p>\n<p><span style=\"color: #ff0000;\"><strong>Thanks Andrew!</strong></span></p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 9 that shipped with the Old School <a href=\"https://krakbox.com/shop/product/447772649\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["andrew-mcgaffey","caliskate","interviews","krakbox","krakmag"],"featuredImages":[{"file":"Caliskate.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/Caliskate.jpg"}],"video":""}