{"id":2635,"date":"2017-08-31T17:16:26","date_gmt":"2017-09-01T00:16:26","slug":"behind-the-lens-with-french-fred","title":"Behind the lens with French Fred","content":"<p><em>Fred Mortagne is a self ­taught french director and photographer, with his work focused mostly on skateboarding. His graphical and geometrical photography is almost exclusively shot in b&amp;w, and focuses more on the aesthetics and style of the sport, rather than the performance, without leaving on the side the tasty action&#8230; and playing around a lot with architecture. Spending so much time out in the streets, Fred keeps a curious eye open for other interesting things in life’s happenings, and stands ready to capture those unique moments. His pictures are a feast of lines and angles, and his specific compositions, blending the skateboarders with their environment, make his skateboarding photography accessible to non-­skateboarders. As a result, in 2007, he won the first <a href=\"http://www.redbullillume.com/\" target=\"_blank\" rel=\"noopener\">Red Bull Illume competition</a>. For the last year and a half, Fred has been shooting a lot with the <a href=\"https://us.leica-camera.com/Photography/Leica-M/LEICA-M-MONOCHROM\" target=\"_blank\" rel=\"noopener\">M Monochrome</a> camera, and he is showing some of these pictures only on <a href=\"https://www.leica-fotopark.com/en/discover/photographers/5412dd730cf2c7f2c8aaa32c/profile\" target=\"_blank\" rel=\"noopener\">his Fotopark stream</a>. But as a responsible photographer, he also makes sure to keep shooting with film, to maintain analogue&#8217;s photography and keep it&#8217;s magic alive.</em></p>\n<div id=\"attachment_2638\" style=\"width: 730px\" class=\"wp-caption alignnone\"><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/brophy_720.png\"><img aria-describedby=\"caption-attachment-2638\" class=\"size-full wp-image-2638\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/brophy_720.png\" alt=\"Andrew Brophy. Photo: French Fred\" width=\"720\" height=\"486\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/brophy_720.png 720w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/brophy_720.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a><p id=\"caption-attachment-2638\" class=\"wp-caption-text\">Andrew Brophy, tre flip. Photo: French Fred</p></div>\n<p><span style=\"font-weight: 400;\">&#8220;This is one of my most significant pictures although it was shot when I had just started out as a photographer, back in 2004 during Cliché’s first Gypsy Tour for which I was the filmer. Back then, I seldom unpacked my camera from my bag. On that day in Geneva, I had noticed the graphic facade of this building, with these outside stairs. During a short break in our session, I quickly went up to see how it looked from above. It was cool, but I knew I only had a couple of minutes to try to shoot something. Based on my feeling and experience, I asked Andrew Brophy to try a flatground tre flip&#8230;. While Brophy has huge pop, shooting from above tends to flatten everything. So my focus was to capture his style with this photo, and I knew he was the perfect skater for such a shot. In less than 5 minutes, we got the shot. With this picture, I won the first edition of the Red Bull Illume contest. It was worth taking those few minutes to shoot a flatground trick!&#8221;</span></p>\n<div id=\"attachment_2639\" style=\"width: 730px\" class=\"wp-caption alignnone\"><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/charles_720.png\"><img aria-describedby=\"caption-attachment-2639\" class=\"size-full wp-image-2639\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/charles_720.png\" alt=\"Charles Collet. Photo: French Fred\" width=\"720\" height=\"486\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/charles_720.png 720w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/charles_720.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a><p id=\"caption-attachment-2639\" class=\"wp-caption-text\">Charles Collet. Photo: French Fred</p></div>\n<p><span style=\"font-weight: 400;\">&#8220;This picture of Charles Collet is actually “linked” to the one of Andrew Brophy as Leica (partner at the Red Bull Illume edition back in 2012), had lent me the M Monochrom camera to shoot and participate in this contest, and these very pictures were my entries. I only had a couple of weeks to shoot pictures with enough character and personality for the contest. I had planned a session on that beautiful Sunday in May, but almost everyone ended up bailing on me. Only Charles was still down, but he was alone, which is never ideal when you go skate and shoot photos. We didn’t really know what to do, where to go… I thought again of this spot 35 minutes away from Lyon. We both said to each other “come on, let’s go, we’ll see…” And the sesh turned out to be magical. The light was beautiful, the spot was quiet, and despite it being a bust, we still managed to shoot 3 great pictures that I am really proud of. Two out of these three ended up in the semi-final, and in the top 250 (out of over 50 000 pictures!!!). Here again, sixth sense and experience played a big part in the game!&#8221;</span></p>\n<h3><span style=\"color: #808080;\"><strong>This article was originally featured in the printed KrakMag issue 1 that shipped with our very first <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["box"],"tags":["french-fred","krak-mag","krakbox","photos"],"featuredImages":[{"file":"charles_720.png","width":720,"height":486,"mime_type":"image/png","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/charles_720.png"}],"video":""}