{"id":2372,"date":"2016-01-26T06:11:56","date_gmt":"2016-01-26T14:11:56","slug":"danny-duncan","title":"Happy Shit: Danny Duncan&#8217;s Interview","content":"<h3><span style=\"color: #808080;\"><strong>A resume of the following interview was originally featured in the print Krak Mag issue 5 that shipped with <a href=\"http://box.skatekrak.com/\" target=\"_blank\">KrakBox</a></strong><strong> </strong><strong>#5 in December 2015. Don’t want to miss the next issue of the print Krak Mag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://box.skatekrak.com/\" target=\"_blank\">KrakBox</a></strong><strong> </strong><strong>now!</strong></span></h3>\n<p><i><span style=\"font-weight: 400;\">I firstly discovered Danny through his youtube channel. His enthusiasm and energy instantly caught my attention. Then I was amazed by his personal story and hard dedication. As we launched the KrakBox we quickly decided to send one to him in order to benefit from his feedback. Danny has always been responsive, kind, and was hungry to help. Below is a funny unboxing video he made with the first KrakBox we sent.</span></i><br />\n<iframe src=\"https://www.youtube.com/embed/kNVA8AJ7788\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe><br />\n<i><span style=\"font-weight: 400;\">I’m super happy he took the time to talk with me on the phone (at 2am haha!) and told us a little bit more about his life. And made us laugh obviously. k.</span></i></p>\n<p><b><span style=\"color: #ff0000;\">K: Hey Dan, thanks for doing this. I’ve noticed you’re in LA for a couple of months. Where are you based?</span><br />\n</b><span style=\"font-weight: 400;\">I just couch-surf. I leave my clothes at one of my friend&#8217;s place; leave everything there; so I usually stay there or like I stay with girls. I use Tinder to meet a bunch of girls and stay at girls&#8217; houses; I stay at Chris&#8217; house every once in a while too.</span></p>\n<p><b><span style=\"color: #ff0000;\">Sounds cool. Tinder as a free Airbnb. That’s a smart tactic.</span><br />\n</b><span style=\"font-weight: 400;\">Yeah exactly. I wanna try to do a documentary style video about it. Could be pretty cool.</span></p>\n<p><b><span style=\"color: #ff0000;\">Definitely. Can you tell our readers more about yourself?</span><br />\n</b><span style=\"font-weight: 400;\">I’m Danny Duncan. I like to skate, have fun, make jokes and laugh. I guess that’s pretty about it. In short: I like to fuck around and laugh a lot haha!</span></p>\n<p><a href=\"http://box.skatekrak.com\" target=\"_blank\" rel=\"attachment wp-att-2376\"><img class=\"alignnone wp-image-2376 size-medium\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dan_bike.jpg\" alt=\"Dan_bike\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dan_bike.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/Dan_bike.jpg 150w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Dan_bike.jpg 619w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><b><span style=\"color: #ff0000;\">Where did you grow up?</span><br />\n</b><span style=\"font-weight: 400;\">I grew up in Englewood, FL.</span></p>\n<p><b><span style=\"color: #ff0000;\">How was it?</span><br />\n</b><span style=\"font-weight: 400;\">Fun. It was amazing. I have more like a redneck family so I got to do a lot of cool shit that most kids don&#8217;t get to do. I was always outside fucking around, climbing in trees, grabbing the neighbors titties and playing sports. I got to ride four wheelers, dirt bikes, go karts, go fishing, camping, shoot guns, paintballing, and I had the freedom to do whatever I wanted because my mom trusted me so much it was awesome. I was involved in athletics my whole life, try to be a good athlete.</span></p>\n<p><b><span style=\"color: #ff0000;\">Based on where you come from, how actually did you get into skateboarding?</span><br />\n</b><span style=\"font-weight: 400;\">One of my friend started skating and gave me one of his board. He gave me a free complete when I was like 13. And he was like my best friend at this time so I started skating with him a little bit. And then a kid my age that I knew, I saw him skating and he was like really fucking good. So he inspired me I was like “oh shit man you’re really good” and so then I wanted to get better so that’s what got me started. And then I was hyped by the freedom of it. Like I said I was a big athlete so all my life I was like training in sports, like &#8220;practice practice practice&#8221; all the time since I was young and the instructors were like “let’s do it again” which didn’t bother me but when I started skating I was like “shit no one is yelling and I can do whatever I want” so it was kinda cool you know.</span></p>\n<p><b><span style=\"color: #ff0000;\">I guess you didn’t benefit from a huge support from your parents. How did they react?</span><br />\n</b><span style=\"font-weight: 400;\">My dad didn’t like it at all because for him it was dangerous you know. I was primarily an athlete so he wanted me to focus on that and not getting hurt. But then he always wanted me to be happy so eventually he was kind of &#8220;yeah it’s ok&#8221; you know, supporting me at the end.</span></p>\n<p><b><span style=\"color: #ff0000;\">Were you a bunch of kids skating in town at that time or was it only you and your friends?</span><br />\n</b><span style=\"font-weight: 400;\">Yeah there was a group you know. Like 10 or 20 kids skating. And then we got a skatepark built in my hometown like a year after I started skating. So that helped. Once the park has opened we like gathered there everyday. It’s a nice park I still go there when I’m in my hometown, still feels good.</span></p>\n<p><b><span style=\"color: #ff0000;\">Do you have any favorite spots in your hometown or was it mainly around the park?</span><br />\n</b><span style=\"font-weight: 400;\">Yeah the park was great. There is a manual pad I used to skate a lot: Winn Dixie. It&#8217;s fun as hell to skate and you never get busted. There is one of this grocery store just down the street nearby. I still skate that. It’s pretty fun. I remember when I manual it the first time I was really hyped.</span></p>\n<p><b><span style=\"color: #ff0000;\">Now that you travel much more, do you have any favorite spots outside of your hometown?</span><br />\n</b><span style=\"font-weight: 400;\">Not really I guess. I like manual pads a lot. Actually I like going to different places and trying some new shit because there is always something you know.</span></p>\n<p><b><span style=\"color: #ff0000;\">Is there any place in the world you haven&#8217;t been to yet that you want to skate or to visit?</span><br />\n</b><span style=\"font-weight: 400;\">Yeah. I think probably New Zealand. I heard it’s like one of the oldest places and most natural so that sounds really neat to see. I heard it’s like really natural. So I’d like to check that out. And actually Canada. I don’t know why but I’d say Canada. I guess they have a lot of hot girls. Actually I&#8217;ve talked to a ton of hot girls that live in Canada and I really want to meet some of them.</span></p>\n<p><b><span style=\"color: #ff0000;\">These are good choices. I haven’t been there neither but would love to check them out. Mandatory questions time: favorite tricks? videos? parts? skateboarders?</span><br />\n</b><span style=\"font-weight: 400;\">My favorite trick is the treflip for sure. I like treflip a lot. Oh and half cab is really fun too.</span></p>\n<p><span style=\"font-weight: 400;\">Video part: I used to watch a lot of Justin Eldridge. In the eSpecial mostly. I used to watch it everyday. That was like my favorite video of all time. Watched it all the time. </span><span style=\"font-weight: 400;\">And now I like watching Jason Lee back in the day like his old stuff is pretty fun to watch.</span></p>\n<p><span style=\"font-weight: 400;\">My favorite skateboarders? I’d say Pat Schaefer, Zion Wright &amp; Jason Lee. Zion isn’t pro, actually he’s in Florida. I like them a lot. They’re kind of AMs now; everybody will know them one day.</span></p>\n<blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 658px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-version=\"6\">\n<div style=\"padding: 8px;\">\n<div style=\"background: #F8F8F8; line-height: 0; margin-top: 40px; padding: 50.0% 0; text-align: center; width: 100%;\"></div>\n<p style=\"margin: 8px 0 0 0; padding: 0 4px;\"><a style=\"color: #000; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none; word-wrap: break-word;\" href=\"https://www.instagram.com/p/7wY3D2iHYR/\" target=\"_blank\">Skateboarding is fun ❤️</a></p>\n<p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\">A video posted by Danny Duncan (@dannyduncan69) on <time style=\"font-family: Arial,sans-serif; font-size: 14px; line-height: 17px;\" datetime=\"2015-09-18T03:00:03+00:00\">Sep 17, 2015 at 8:00pm PDT</time></p>\n</div>\n</blockquote>\n<p><script src=\"//platform.instagram.com/en_US/embeds.js\" async=\"\" defer=\"defer\"></script></p>\n<p><b><span style=\"color: #ff0000;\">Tell us more about your Youtube channel. How would you describe it?</span><br />\n</b><span style=\"font-weight: 400;\">I like to post videos that make people laugh. I love making these videos and laughing my ass off. Some of my own vids kill me and I love that shit haha. I&#8217;ve always loved making people laugh so it feels good to be able to make people happy and to know I have so many fans supporting me. I&#8217;ve done pranks, comedy sketches, eating challenges, motorboated some titties, kissed a GILF, and tons of other random shit.</span></p>\n<p><b><span style=\"color: #ff0000;\">How did you get into it? When was it? I mean: how one day you were like &#8220;hey let&#8217;s make some youtube videos and make people laugh&#8221;? It&#8217;s not the usual idea for sure.<br />\n</span></b><span style=\"font-weight: 400;\">I used to stretch skateboarders and I was working with a lot of pros and stuff and then I got referred to Jason Lee so worked with him and was like his personal trainer to try to help him with the muscles. He thought I was funny and he was like “dude you should get into acting, you’re funny”. I just said &#8220;why&#8221; and he said &#8220;because you&#8217;re really funny and I know you would do well, I can help you too. It&#8217;s easy dude&#8221; and I said &#8220;ok&#8221;. I kept it casual haha (even though deep down I was like wtf this is crazy haha) and I just remember leaving his house that day like “fuck ya I know I can do this shit”. It was cool because everything made sense to me at that point. Meeting Jason was meant to be and that was the spark I needed, a badass actor like him to tell me I&#8217;m funny and that I could do well in acting. It was an amazing feeling. I always wanted to do acting or stand-up but I&#8217;m from a small ass town. Never thought I&#8217;d end up in LA. Life&#8217;s crazy. Thanks Jason! Still can&#8217;t believe where I&#8217;m at right now it&#8217;s insane. So happy with everything.</span></p>\n<p><b><span style=\"color: #ff0000;\">So it all started like this?</span><br />\n</b><span style=\"font-weight: 400;\">Ya just started filming random ideas haha. I remember I filmed my first video and sent it to Jason. It&#8217;s this funny video of me boxing and it&#8217;s motivational and then the music cuts out and it pans out and I&#8217;m naked hitting the speed bag it&#8217;s funny as shit. I texted that to Jason and he replied &#8220;THIS IS AMAZING&#8221; in all caps. I was so hyped haha. He&#8217;s like my trigger whether or not something is actually funny or not. The dude is a comedic genius.</span></p>\n<p>I just want to add more on Jason while I&#8217;m on the topic it&#8217;s kind of cool.</p>\n<p>So I remember when I was younger I always wanted to be rich as fuck and have all this fancy shit, like cars, shoes, jewelry etc just dumb shit no one needs. When I met Jason I realized none of that shit mattered. He&#8217;s a very successful guy obviously who could get whatever he wants. He has motorcycles and a bunch of cool shit but we used to drive around LA in a van it was so fuckin funny and awesome. Like this movie star driving around in a van. It was epic. I loved that shit haha. But he just made me realize a lot of things. I pretty much completely figured out my life when I met him. I decided I was gonna pursue acting and all of this full time and it really helped because he was backing me and giving me advice. I realized none of that fancy shit matters and to just be yourself. And he never went out of his way to say these things. This is just random things I noticed and came to realize throughout meeting him. Great guy and one of the funniest people I&#8217;ve ever met.</p>\n<p><a href=\"http://box.skatekrak.com\" target=\"_blank\" rel=\"attachment wp-att-2377\"><img class=\"alignnone wp-image-2377 size-medium\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dan_Jason.jpg\" alt=\"Dan_Jason\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dan_Jason.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/Dan_Jason.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/Dan_Jason.jpg 768w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Dan_Jason.jpg 960w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><b>He definitely sounds like a great guy! How do you get the inspiration for a new video? You just got an idea, you find it funny and you’re like “ok let’s film it”?<br />\n</b></span><span style=\"font-weight: 400;\">Yeah exactly. I’m just like “oh shit that would be fucking funny” and I’m gonna try that you know. Or anything like that. That’s usually how it is. Like I come up with something or a friend comes up with something and we’re like “yeah yeah that could be funny let’s do it” and we end up posting it.</span></p>\n<p><span style=\"font-weight: 400;\">Chris does some youtube also and he’s one of my best friend so we end up making a lot of videos together also.</span></p>\n<p><b><span style=\"color: #ff0000;\">How many subscribers do you have right now?</span><br />\n</b><span style=\"font-weight: 400;\">Hmmm I’m not sure let me check. 53,500.</span></p>\n<p><em>[NB: remember this discussion between Dan and I happened last December. I checked today and he&#8217;s around 103,786 subscribers. Big up dawg. That&#8217;s a great trend!]</em></p>\n<p><b><span style=\"color: #ff0000;\">Do you know what kind of person they are?</span><br />\n</b><span style=\"font-weight: 400;\">I guess I’ve a lot of young fans. I’d say like probably 16 years old kid, probably around 15 or something. A lot of younger kids and girls. Yeah mainly kids follow me.</span></p>\n<p><b><span style=\"color: #ff0000;\">What&#8217;s a typical day like for you?</span><br />\n</b><span style=\"font-weight: 400;\">You want a realistic story?</span></p>\n<p><b><span style=\"color: #ff0000;\">Haha yeah man I want it real.</span><br />\n</b><span style=\"font-weight: 400;\">Like in depth you mean or what?</span></p>\n<p><b><span style=\"color: #ff0000;\">Yeah let&#8217;s do the in depth one.</span><br />\n</b><span style=\"font-weight: 400;\">All right. I wake up, probably like 10 O’clock because I go to sleep late. First thing I do is like I play on my phone, send some texts, phone calls.</span></p>\n<p><span style=\"font-weight: 400;\">Then I go to the bathroom. I take a shower and I usually jerk off in the shower. And then I get ready. And then I eat a bowl of cereals, like some Lucky Charms. Then I usually go out. And try some bunch of shit. </span></p>\n<p><span style=\"font-weight: 400;\">And then I go to college campus like UCLA or USC where I go to a couple of friends, like 2-3 friends and we just fuck around until we get a funny idea to fuck with people. Sometimes we do an interview, or a prank, or a social experiment.</span></p>\n<p><span style=\"font-weight: 400;\">And then once we’re done filming, some days, we’ll go skating to a skatepark like Sheldon or Lake Street and skate and then get a dinner or something.</span></p>\n<p><span style=\"font-weight: 400;\">Then once the work’s done you come home, I usually take a shower again and then go hang out with a girl and do whatever you need to do, like watching a movie and then stay at the girl’s place and wake up again and back to my daily routine.</span></p>\n<p><b><span style=\"color: #ff0000;\">You realize how that day will become a ritual for people right?</span><br />\n</b><span style=\"font-weight: 400;\">Haha! Yeah yeah. That’d be funny. I’m gonna film a day in my life and it’s gonna be with more shit.</span></p>\n<p><b><span style=\"color: #ff0000;\">What else in the works? Do you focus on your channel or do you have further plans for the future? Tell us your secrets?</span><br />\n</b><span style=\"font-weight: 400;\">I plan to get a lot bigger on YouTube, I&#8217;m also gonna start working to get into some movies in the next few years, and I&#8217;m planning to do stand-up comedy in 2016. I am really looking forward to it! That’s sort of the big plan.</span></p>\n<p><b><span style=\"color: #ff0000;\">Is that the main reason you came in LA? To give you a better chance at acting?</span><br />\n</b><span style=\"font-weight: 400;\">It’s kind of like a mixture. I came in LA because of Chris Chann also. It’s fun to be here. But it’s also like when you’re here you just make a bunch of progress. Because everybody here you know want to succeed, expand, make more money, get more followers, have more fun, post more videos. Like everybody here is doing the same shit. So you’re able to work with the people you wanna work with. And you get shit done. </span>I also wanna get into the movie. In this case it’s better to be here you know what I mean.</p>\n<p><a href=\"http://box.skatekrak.com\" target=\"_blank\" rel=\"attachment wp-att-2378\"><img class=\"alignnone wp-image-2378 size-medium\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dan_Chris.jpg\" alt=\"Dan_Chris\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dan_Chris.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/Dan_Chris.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/Dan_Chris.jpg 768w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/Dan_Chris.jpg 1024w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Dan_Chris.jpg 1080w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><b><span style=\"color: #ff0000;\">How do you like the city actually? Do you like it more for business motivation?</span><br />\n</b><span style=\"font-weight: 400;\">Yeah it’s like a love / hate relationship you know. I also hate being in LA you know, I wanna be in Florida. But I love being here for the progress, the opportunity, the people here. There is certain people here that I wanna be with and who help you improve and become better. But there are also a lot of fake people here, probably like everywhere else.</span></p>\n<p><b><span style=\"color: #ff0000;\">Do you like coming back and forth between LA and Florida? Like you could find your own balance between both these lifestyles?</span><br />\n</b><span style=\"font-weight: 400;\">I will be full time in LA at one point. I have to be. Yeah I definitely want to be full time in LA eventually. In the next year I’ll be there. I’m gonna start making some stand up comedy as well and I think I can do very well at that so that could definitely help me to be there, being an entertainer you know. So I could get some acting, youtube, stand up comedy and shit like that. It’s gonna all come together and it’s gonna work out pretty well.</span></p>\n<p><b><span style=\"color: #ff0000;\">What was the funniest thing you had to do in a video? the craziest? scariest?</span><br />\n</b><span style=\"font-weight: 400;\">The craziest I think was climbing the Hollywood sign. Yeah I climbed at the very top and then the LAPD came that was pretty sick.</span></p>\n<p><b><span style=\"color: #ff0000;\">Were they angry at you? Or they were cool?</span><br />\n</b><span style=\"font-weight: 400;\">Yeah they like yell at you but that was pretty fun. You have to watch the video.</span></p>\n<p><iframe src=\"https://www.youtube.com/embed/BvH1cNMcncc\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">And then I did another video, pretty funny, like a crazy video, fucked up. I had to kiss that very old baby and it’s fucking nasty.</span></p>\n<p><b><span style=\"color: #ff0000;\">That was for the craziest and the funniest. What about the scariest?</span><br />\n</b><span style=\"font-weight: 400;\">Yeah. Shit that might also be the scariest. Let me see. Yeah I would say scariest and funniest were kissing the gilf haha.</span></p>\n<p><iframe src=\"https://www.youtube.com/embed/sAOuk_PeWPs\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><b><span style=\"color: #ff0000;\">One thing you haven&#8217;t done yet but are dreaming of?</span><br />\n</b><span style=\"font-weight: 400;\">One thing I haven&#8217;t done yet but dream of would be &#8211; to buy my mom a house and pay it off in full. We lost our house when I was like 15 and it was the house I grew up in and the one she had built, so one day I will buy it for sure. I just hope I&#8217;ll buy it before she passes away. That&#8217;s a big reason why I&#8217;m grinding so hard right now because I know she won&#8217;t be here for ever.</span></p>\n<p><span style=\"font-weight: 400;\">I also want to add to that. One of the biggest fears I have is becoming extremely successful but after my mom has passed away. It&#8217;s always been a huge worry of mine. Because I know 100% I&#8217;ll be rich and I&#8217;ve always known that. I&#8217;m not gonna stop until I achieve everything I&#8217;ve wanted to achieve. I don&#8217;t need a lot of money, I don&#8217;t blow it on anything except food, I don&#8217;t buy fancy clothes, shoes and shit but I want to give a lot back to my mom &amp; family for helping me so much especially for their support with me chasing my dreams.</span></p>\n<p><b><span style=\"color: #ff0000;\">Would you have any advice for people who would want to give it a try on Youtube?</span><br />\n</b><span style=\"font-weight: 400;\">I think it&#8217;s important to be original and to know what you want your channel to be about. For me I just want random videos that make people laugh. So I try to always mix it up because I want to be able to always have fun filming and never get burned out. So for me that&#8217;s important, for others it may be something else but it&#8217;s good to have a goal in mind and then focus on being consistent, posting good content, don&#8217;t ever steal content, don&#8217;t lie to fans, don&#8217;t be a try hard, be yourself and if you do pranks don&#8217;t fuckin post fake prank videos. No one likes them. And you&#8217;re a pussy if you post them haha.</span></p>\n<p><b><span style=\"color: #ff0000;\">Any message or words you want to pass on to our readers?</span><br />\n</b><span style=\"font-weight: 400;\">My mom raised me to never lie to her about anything at all. So me and my mom have this amazing relationship. We never argue or anything it&#8217;s great. She taught me a lot and not lying or stealing were very basic things but so important. I know so many people that just make up bullshit and lie about the most random stuff. Like you don&#8217;t need to fuckin lie hahaha. So as far as my advice I say basically, don&#8217;t lie, don&#8217;t steal, be a good person, do the right thing &amp; smile. Just live life and have fun. Don&#8217;t worry about shit that doesn&#8217;t matter and don&#8217;t worry what people think about you. We are all gonna die so just live your life and have fun. I&#8217;m not gonna sit here with the time I have on earth and be a pussy and worry about people who judge me because of the shoes I wear. None of it fuckin matters. Spend time with the people you love and who you care about and do what makes you happy. And chase your dreams. Don&#8217;t give up.</span></p>\n<p><b><span style=\"color: #ff0000;\">These are like great words Dan! To wrap things up, who do you want to thank?</span><br />\n</b><span style=\"font-weight: 400;\">A big thank you to my Mom, Dad, John Russell, Amanda Russell, Kristy Russell, Chris Chann, Andrew Hales &amp; Jason Lee. Justin Williams &amp; Conrad Thai too.</span></p>\n<p><b><span style=\"color: #ff0000;\">Thanks Dan! All the best for 2016 and keep up the great work.</span></b></p>\n<p><em><span style=\"color: #000000;\">Make yourself a favor and subscribe / follow Danny ==&gt;</span></em><em><span style=\"color: #000000;\"><br />\nYoutube: +DuncanStrength<br />\nInstagram: @dannyduncan69</span></em><br />\n<span style=\"color: #000000;\"><em>Facebook: /dannyduncan69</em></span><br />\n<span style=\"color: #000000;\"><em>Twitter: @dannyduncan69</em></span></p>\n<h3><span style=\"color: #808080;\"><strong>Liked this interview? Check out the print KrakMag in each <a href=\"http://box.skatekrak.com/\" target=\"_blank\">KrakBox</a></strong><strong> for more great content</strong><strong>!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["chris-chann","danny-duncan","hollywood-sign","krak-mag","krakbox","videos","youtube"],"featuredImages":[{"file":"Dan.jpg","width":640,"height":640,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/Dan.jpg"}],"video":""}