{"id":3359,"date":"2018-07-09T16:12:03","date_gmt":"2018-07-09T23:12:03","slug":"emmanuel-camusat-getta-grip","title":"Artist Feature: Emmanuel Camusat for Getta Grip","content":"<p><em>We loved our <a href=\"https://mag.skatekrak.com/damian-hurtado-getta-grip/\" target=\"_blank\" rel=\"noopener\">previous collab</a> with Damian from Getta Grip so much that we knew from that day we had to do it again. Meanwhile, we were extremely lucky that Manu, the art director behind <a href=\"https://diligentskateboards.bigcartel.com/\" target=\"_blank\" rel=\"noopener\">Diligent Skateboards</a> [remember the collab’ wheels we made <a href=\"https://krakbox.com/shop/product/1286422508\" target=\"_blank\" rel=\"noopener\">last Xmas</a>?], was inspired by our logo and he sent us some awesome twisted versions we loved so much. We reached out to him and asked to put one on grip tape, sprayed by Damian himself. We included the grip in our 3 Years box along with this interview in issue #19 of KrakMag.</em></p>\n<p><span style=\"color: #ff0000;\"><strong>Hey Manu, could you introduce yourself?<br />\n</strong></span>Hi, my name is Emmanuel Camusat AKA Imaurf Emmanuel_Paul; Emmanuel_Paul and Emmanuel Polymorph. This is an old thing from my days at Beaux-Arts [French art school] in order to justify why I was doing very different things. I graduated from the Beaux-Arts in Qimper [north west part of France] in 2000, I&#8217;m 46 years old, and I&#8217;m an artist and a teacher at the art school in Chateauroux.</p>\n<p><img class=\"alignleft size-medium wp-image-3370\" src=\"https://res.cloudinary.com/krak/image/upload/w_196/mag/uploads/manu-skate.jpg\" alt=\"\" width=\"196\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_196/mag/uploads/manu-skate.jpg 196w, https://res.cloudinary.com/krak/image/upload/w_670/mag/uploads/manu-skate.jpg 670w, https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-skate.jpg 680w\" sizes=\"(max-width: 196px) 100vw, 196px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>How long have you been skating? How did you start?<br />\n</strong></span>I started skateboarding in 1986 and I skated straight through to 1992. When my father died that year (I was 20 years old) I put skateboarding aside, my mind was somewhere else. I consequently stopped for 20 years. During that time, I was still landing some ollies every month just to tell myself &#8216;you&#8217;re still a skateboarder&#8217;, so I never completely stopped but that was still a proper pause. Then I really went back into it in 2012 when my first son started walking. I put him on a board, then myself, and bang: I missed it too much so I became addicted again.</p>\n<p><span style=\"color: #ff0000;\"><strong>How long have you been drawing/painting?<br />\n</strong></span>I’ve been drawing for as many years as I can remember. I was hungry for comics and I didn&#8217;t get out of my bedroom really often when I was a kid so I drew. Nothing crazy but it was non-stop. Then I started skateboarding and I made some logos on my griptape, then on my clothes, etc&#8230; Then I started working. And then again: my father&#8217;s death, 3 years of being lost, and it clicked. The act of creation was way too important to me. I couldn&#8217;t forget that, so I consequently applied to a prep school in order to enter into the Beaux-Arts later on. I was enrolled in the same prep school in Chateauroux in which I teach right now. Then I moved to Quimper and I&#8217;m fully into creation now.</p>\n<p><span style=\"color: #ff0000;\"><strong>What inspired this Krak graphic?<br />\n</strong></span>That one was part of a huge series of different logos. I had my little eye-based characters in mind and they started to invade my skateboarding pictures, then I got some geometric forms, then some logos, and in the middle of all these things, the Krak logo. It&#8217;s always an evolution for me, I jump from one thing to another, always in motion.</p>\n<p><img class=\"alignright wp-image-3372\" src=\"https://res.cloudinary.com/krak/image/upload/w_233/mag/uploads/3-years-flat-lay.jpg\" alt=\"\" width=\"300\" height=\"386\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_233/mag/uploads/3-years-flat-lay.jpg 233w, https://res.cloudinary.com/krak/image/upload/mag/uploads/3-years-flat-lay.jpg 538w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>You’ve surprised us many times with some twisted/hijacked logos. Do you especially enjoy this type of drawing? Why?<br />\n</strong></span>As I was saying above, I always try to be in motion. I&#8217;m also a bit of a workaholic so once I draw something, I have to test it many times, I have to try a lot of different combinations, I have to literally run through the whole thing. So I make a lot of tests, I twist things, and since the thing is in my mind all the time, I need to take it out. Otherwise it consumes my days. I play with the different versions, I fill out the inside of the logo, then I fill all the negative space. The Krak logo was perfect for this little game and I can tell you: you haven&#8217;t seen most of the drawings, haha!</p>\n<p>I love these drawings because they&#8217;re instinctive to me. It&#8217;s a kind of meditation. I don&#8217;t think&#8230; it&#8217;s like I draw them to warm me up before going into more complex work. Drawing and skateboarding are the same to me. One paper, one picture, it&#8217;s like an obstacle. My pen, my paintbrush, they&#8217;re like my board. I have some tricks in my bag that I know, that I manage perfectly, so I start with them to warm up. Then I try some bigger stuff, harder, until I reach the point where they become warm-up tricks; that&#8217;s what happened with my logo-based drawings.</p>\n<p><img class=\"aligncenter wp-image-3367 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-mags.jpg\" alt=\"\" width=\"680\" height=\"510\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-mags.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/manu-mags.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>We actually see a lot of hijacked logos out there, what do you think about this trend?<br />\n</strong></span>In my opinion, it&#8217;s because we&#8217;re literally surrounded by logos and brands all the time. So quite naturally, the logos are one of the first things that come into mind. That actually proves the strength of those who created them in the first place. I like the idea of &#8216;invading the invaders&#8217;. It&#8217;s not a battle, per se, but rather a way to identify yourself, to highlight where influences lie.</p>\n<p><span style=\"color: #ff0000;\"><strong>Some of the drawings you do remind us of Ed Templeton graphics. Do you draw any inspiration from Toy Machine?<br />\n</strong></span>Hmm yes and no. I really like his work, there is something very strong in it but his characters are typically derivatives of themselves. It starts with a monster which eats some skateboards, then step by step it becomes something more liquid with some extra mouths, then extra eyes, then the extra mouth disappears just to leave the extra eye. I&#8217;m totally aware that there is some similarities, especially around the cyclops family. But to be honest, and without faked humility, I think that while the design is often similar, the content is not. And he&#8217;s doing things way better than me isn&#8217;t he?</p>\n<p><img class=\"aligncenter wp-image-3363 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-art-1.jpg\" alt=\"\" width=\"680\" height=\"494\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-art-1.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/manu-art-1.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>What are the pros and cons of using boards as a medium for art?<br />\n</strong></span>Pros: the form factor. You have to keep in mind where the trucks will be, the used and scratch zones, and the result is a huge and very interesting challenge. It’s always super cool to see your drawing under a rider’s feet. When you think about it, they liked your work enough to buy a deck. The skate shops become sort of art galleries to showcase your art.</p>\n<p>Cons: I can&#8217;t think of any. I could say the fact that you destroy the canvas over time but I actually find that pretty cool. Consequently, it gives another meaning to your design. For instance, I <a href=\"https://crucialskatecompany.com/collections/wood/products/emmanuel-camusat-got-skate-guest-artist-deck\" target=\"_blank\" rel=\"noopener\">drew some cows</a> for an American company named &#8216;Crucial Skate Company&#8217; and at the end, that became a &#8216;roast beef&#8217; series that I really enjoyed.</p>\n<p><img class=\"aligncenter size-full wp-image-3365\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-decks.jpg\" alt=\"\" width=\"680\" height=\"510\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-decks.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/manu-decks.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>What do you like to draw aside from skateboarding?<br />\n</strong></span>Everything. I like drawing everything; all the little daily things. I always have a pen and a notebook with me. I draw in waiting rooms, during conferences, during meetings, I draw everything and everyone I see. I enjoy &#8216;series&#8217; of things, like drawing something so many times that you make it disappear.</p>\n<p><span style=\"color: #ff0000;\"><strong>How did you connect with Diligent?<br />\n</strong></span>I’ve known Florent for a while. Hey, he even told the story in <a href=\"https://mag.skatekrak.com/florent-bavouzet-dilligent/\" target=\"_blank\" rel=\"noopener\">his interview in the KrakMag</a>. I used to ride with my friends in front of his house and then sometimes he rode the mini-ramp that we built ourselves, just next to an abandoned factory near the train rails. Then we sort of lost each other, and recently we bumped into each other. Since I was doing a lot of different things, he asked me if I was down to make something for Diligent and voila, here we are.</p>\n<p><img class=\"alignleft wp-image-3368\" src=\"https://res.cloudinary.com/krak/image/upload/w_240/mag/uploads/manu-portrait-2.jpg\" alt=\"\" width=\"300\" height=\"375\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_240/mag/uploads/manu-portrait-2.jpg 240w, https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-portrait-2.jpg 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Who are your biggest influences in art?<br />\n</strong></span>Wow, there are so many. My biggest influences come from literature: W.S. Burroughs, Georges Perec, Jack Kerouac; then from music: Pierre Henry, Pierre Schaeffer, Steve Reich, John Cage. Then there is: Marcel Duchamp, Picasso, Ed Ruscha, Joseph Kosuth, Max Ernst, Botticelli, Le Caravage, Richard Fauguet, Wim Delvoye, the Chapman brothers, I could go on like this for hours. Bottom line is: I&#8217;m really into experimenting, innovation and the intention being more than the pure beauty of the realisation. Even though there are some wonderful things in the stuff I just mentioned, I also think it&#8217;s deeper than what we see, that&#8217;s what resonates with me.</p>\n<p><span style=\"color: #ff0000;\"><strong>If you could do a board graphic for any skater, who would it be?<br />\n</strong></span>Hmm if I don&#8217;t think too much about it I&#8217;d say: Natas Kaupas, Rodney Mullen, Steve Caballero and Ray Barbee; they&#8217;re my young age idols haha; and Louie Barletta as well. Then I think more about brands, in terms of mindset and the atmosphere: Toy Machine for instance (let&#8217;s go back to Ed Templeton) and Enjoi.</p>\n<p><span style=\"color: #ff0000;\"><strong>What is your biggest piece of advice for readers who want to make a living out of drawing?<br />\n</strong></span>To be honest, I&#8217;d love the readers to give me advice about that, haha, because I can&#8217;t say I live from my drawings. Jokes aside, I think you should work in an authentic way, be genuine and sincere, stay open and don&#8217;t focus on one thing only. Keep experimenting, always; and last but not least, find a real job on the side, haha!</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 19 that shipped with the 3 Years <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["collab","emmanuel-camusat","getta-grip","interview","krakmag"],"featuredImages":[{"file":"manu-portrait.jpg","width":680,"height":510,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/manu-portrait.jpg"}],"video":""}