{"id":3080,"date":"2018-02-25T17:52:49","date_gmt":"2018-02-26T01:52:49","slug":"founders-interview-damien-bernadet-of-close-up","title":"Founders Interview: Damien Bernadet of Close Up","content":"<p><em>Sure, you probably dabbled with a TechDeck during a boring math class at some point in your life, but for some people, fingerboarding is a lifestyle. To satisfy our curiosity about this miniature skateboard world we hit up Damien Bernadet, founder of ‘Close Up’ to answer a few questions. When it comes to the fingerboarding industry, Damien really has his finger on the pulse (sorry, couldn’t resist).</em></p>\n<p><span style=\"color: #ff0000;\"><strong>Give us a brief history of fingerboarding… when did it begin and who started it?<br />\n</strong></span>Fingerboarding appeared for the first time in the middle of the 80s. In the legendary Powell Peralta video, &#8220;<a href=\"https://youtu.be/oqRjBh86Lvw?t=1m45s\" target=\"_blank\" rel=\"noopener\">Future Primitive</a>&#8220;, you can see Lance Mountain riding a bathroom sink and showing coping tricks to Tony Hawk, Steve Caballero &amp; Steve Saiz. Since that video, fingerboarding started to be developed by hidden &#8220;geek skateboarders&#8221; from all parts of the globe, but maybe little more in the rainy parts 😉</p>\n<p><iframe src=\"https://www.youtube.com/embed/Qo3MgSubAeo?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><strong><span style=\"color: #ff0000;\">When did it blow up and become popular? And was it due to something in particular, like media coverage, a big event, or…?<br />\n</span></strong>The whole skateboarding Industry had to wait until 1998/99 to discover that famous 411VM production from L.A., &#8220;<a href=\"https://www.youtube.com/watch?v=eSra1H3SU9E\" target=\"_blank\" rel=\"noopener\">Fingers of Fury</a>&#8220;. It was very different from usual videos because it showed similarities between real fingerboarding and real skateboarding! This video included the French fingerboarding &amp; skateboarding section, which definitively launched fingerboarding as a real discipline.</p>\n<p><span style=\"color: #ff0000;\"><strong>How did the TechDeck craze influence fingerboarding?</strong></span><br />\nThis video was unfortunately also sponsored by Teck Deck (plastic toy businessmen), which also contributed to promote fingerboarding for some larger public.</p>\n<p><strong><span style=\"color: #ff0000;\">How did you first get into fingerboarding?</span></strong><br />\nI started fingerboarding with my friend Tony from Dijon, who is also a pioneer. Some weeks it was raining everyday and at that time skateboarding video games did not exist yet! Fingerboarding was already a reality and much more personal and stylish 😉 We created our first small brand &#8220;FSB&#8221; (Finger Skate Boarding) in 1996, but were too young to develop a company without Internet or digital cameras.</p>\n<p><img class=\"aligncenter wp-image-3087 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-5.jpg\" alt=\"Close Up Fingerboards\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-5.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/close-up-5.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>When did you start Close Up?</strong></span><br />\n10 years passed after the first phenomena wave, but without any real miniature realistic skateboard adapted to the fingers!? The real skateboarding industry had so much to do—developing decks, shoes, tricks, skate parks, medias, skate shops etc—so fingerboarding was still not really recognized. I decided to create <a href=\"https://closeup-fingerskate.fr/\" target=\"_blank\" rel=\"noopener\">Close Up Fingerboards</a> in Paris 2005. By 2006 I had set up the company and factory molds and we started distributing in 2007.</p>\n<p><span style=\"color: #ff0000;\"><strong>Were there many other fingerboard companies around at that time?</strong></span><br />\nAt that time, only some German skateboarders (from rainy part of germany!) were about to create their brand. They’re actually quite famous but really expensive—kind of &#8220;the rolex&#8221; of fingerboarding! Aside from them, no one could suggest any wooden concave fingerboard with real metal trucks, urethane wheels, silicon bushings and real bearings!</p>\n<p><span style=\"color: #ff0000;\"><strong>What&#8217;s the demographic of the “core” fingerboarders? I feel like lots of people used to play with fingerboards in high school; but what happens next? Who are the people who stick to it? Do they tend to skate too?</strong></span><br />\nThere are more and more users now but most of them are essentially kids from 7 to 16 years old and then from 30 to 77. Because of the realistic miniature skateboard people see it as an object for collection. A good friend, who teaches skateboarding to kids, told me he was using my fingerboards as a complement, to show what&#8217;s going on with the deck under the fingers, as under the feet!</p>\n<p>Talented fingerboarders are usually good skateboarders, because they naturally study tricks with much precision! A lot of young skateboarders play video games at home, but more more are enjoying fingerboarding!</p>\n<p><img class=\"aligncenter size-full wp-image-3085\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-3.jpg\" alt=\"Close Up Fingerboards\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-3.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/close-up-3.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Do you feel any kind of judgement from skateboarders towards fingerboarding?<br />\n</strong></span>Of course some “core” skateboarders are critical towards any new fashion or movement and judge fingerboarding, but those are usually between 18 and 25 and often close minded. In a way fingerboarding is becoming more more popular, and more and more respected because it’s democratized!</p>\n<p><span style=\"color: #ff0000;\"><strong>What’s involved in the design process? Do you customise and test board shapes?<br />\n</strong></span>Close Up co. have modified its deck shape 5 times since 2006, trying to satisfy the real riders expectations. But of course we all have different finger sizes and top finger feelings so it is difficult and expensive to produce all types of decks. After 11 years of experience, we know which &#8220;standards&#8221; satisfy beginners and which satisfy more experienced riders. Unlike other fingerboard brands which suggest really large decks (over 33mm wide) and are concentrated on geeks, tricks and performance, our decks keep a realistic size, not too large.</p>\n<p><img class=\"aligncenter size-full wp-image-3089\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-7.jpg\" alt=\"Close Up Fingerboards\" width=\"680\" height=\"452\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-7.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/close-up-7.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>What kind of research and development goes into creating the obstacles?<br />\n</strong></span>To be honest, the <a href=\"https://closeup-fingerskate.fr/closeup/shop-produits/customise-set-accessoires/\" target=\"_blank\" rel=\"noopener\">obstacle</a> ideas come from real skateboarding ideas, but also from production costs or logistic. Close Up co. don&#8217;t make classic wooden ramps, as we think it is easier and more fun to build your own, especially if you are passionate and creative.</p>\n<p><span style=\"color: #ff0000;\"><strong>Without giving away your secrets to success, how are the boards made? Is it the same sort of production as a skateboard but in a miniature version?<br />\n</strong></span>The finger decks production process is the same as real skateboard decks: made of 5 plys of maple, glued and compressed. There is no problem in detailing that famous process as it’s now used by many teenagers who also create their own molds!</p>\n<p><span style=\"color: #ff0000;\"><strong>The Close Up stop motion videos are pretty cool! Who makes those?<br />\n</strong></span>The two stop-motion animations (2007 &amp; 2010) are a collaborative work between Close Up co. and an old friend and stop-motion pro animator who also used to skateboard &amp; fingerboard for fun. You should also check out the video we made featuring the turntable fingerboard park we invented.</p>\n<p><iframe src=\"https://www.youtube.com/embed/rV-o25ZJWPw?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><strong><span style=\"color: #ff0000;\">What are your thoughts on the finger boarding mockumentary ‘Fingers Crossed’ that was shared on Jenkem Mag?</span></strong><br />\nI think it’s an original and funny way to present pro fingerboarding to skateboarders, even if Close Up co. spirit is not to to push fingerboarders to turn &#8220;pro&#8221; or become famous for few months. New talents are emerging from everywhere every 6 months, like in skateboarding, but fingerboarding has so much less risks and more tries in a minute than real Skateboarding hammers!</p>\n<p><iframe src=\"https://player.vimeo.com/video/236429010?title=0&amp;byline=0&amp;portrait=0\" width=\"680\" height=\"383\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><a href=\"https://vimeo.com/236429010\">Fingers Crossed: The Chad Montie Story</a> from <a href=\"https://vimeo.com/aidanjohnston\">Aidan Johnston</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n<p><span style=\"color: #ff0000;\"><strong>If someone wants to try their hand (last pun, I promise) at fingerboarding, which media should they follow?<br />\n</strong></span>Of course, if someone needs to know more about fingerboarding, they should come to Close Up —<a href=\"https://closeup-fingerskate.fr/\" target=\"_blank\" rel=\"noopener\">closeup-fingerskate.fr</a>—to discover our complete set ups, skateboard brand graphics and original videos. But we have to say, the German brand is definitely the best and most invested in fingerboard contests, high quality materials and sponsoring riders.</p>\n<p><span style=\"color: #ff0000;\"><strong>In your opinion, who is the best fingerboarder?</strong></span><br />\nI think <a href=\"https://www.youtube.com/watch?v=b9W4nFMGiPI\" target=\"_blank\" rel=\"noopener\">Dimitri Schlotthauer</a> &amp; <a href=\"https://www.youtube.com/watch?v=Q6NRwpvNFf0\" target=\"_blank\" rel=\"noopener\">Elias Assmuth</a> are the best fingerboarders of the 21st century! Even if there are now young riders bringing technique and combos—like what Shane O&#8217;Neill brought to skateboarding—I think those 2 German skateboarders, have done the most technical tricks or movements ever done, with style and perfect pop-outs.</p>\n<p><span style=\"color: #ff0000;\"><strong>Thanks for putting up with the bad puns Damien!<br />\n</strong></span>Thanks for this interview and the original collab!</p>\n<p><img class=\"aligncenter size-full wp-image-3088\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-6.jpg\" alt=\"Close Up Fingerboards\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-6.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/close-up-6.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<h3><span style=\"color: #808080;\"><strong>A short version of this interview was originally featured in the printed KrakMag issue 16 that shipped with the Halloween <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["close-up","damien-bernadet","interviews","krakmag"],"featuredImages":[{"file":"close-up-4.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/close-up-4.jpg"}],"video":""}