{"id":2933,"date":"2017-12-12T23:52:05","date_gmt":"2017-12-13T07:52:05","slug":"founders-interview-bertrand-soubrier-of-haze-wheels","title":"Founders Interview: Bertrand Soubrier of Haze Wheels","content":"<p><span style=\"color: #ff0000;\"><strong>If my math is correct, you’re turning 40 this summer right? Any big party plans?<br />\n</strong></span><span style=\"font-weight: 400;\">Exactly! Nope, no party’s planned but something closer to depression! Haha, I’m kidding of course. My birthday date is on August 25th which means plenty of time to get something like a secret party managed by my girlfriend &amp; friends, who knows!</span></p>\n<p><span style=\"color: #ff0000;\"><strong>By the way, tell me: is there really something like a midlife crisis?<br />\n</strong></span><span style=\"font-weight: 400;\">Yes I think. But then it also depends on your past. Like if you succeed to do everything you wanted while you were young, I believe such a crisis should be less intense and probably occur later as well. On my side I feel it coming but in a very light way. So I don’t think it’ll be a big thing in my case and by the way I still feel like a teenager thanks to skateboarding 🙂</span></p>\n<p><img class=\"size-full wp-image-2939 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-wheels-skate-logo.jpg\" alt=\"Haze Wheels logo\" width=\"310\" height=\"388\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-wheels-skate-logo.jpg 310w, https://res.cloudinary.com/krak/image/upload/w_240/mag/uploads/haze-wheels-skate-logo.jpg 240w\" sizes=\"(max-width: 310px) 100vw, 310px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>I read somewhere that you first skateboarded in the year 1987, I was born that year haha! What do you keep in mind about skateboarding in the 90’s? And in Paris?<br />\n</strong></span><span style=\"font-weight: 400;\">Ah funny! The 90s was one of my favorite times, since I was just starting. It was very essential and memorable. The good side of it is, like today, I get a true revival feeling because the trend nowadays is really 90s/2000s based. At the end of the day this is just some cycles and I’m happy because I’m still riding and kind of made a whole round.</span></p>\n<p><strong><span style=\"color: #ff0000;\">Are you nostalgic sometimes or not at all? You enjoy skateboarding right here right now as much as back in the days?<br />\n</span></strong><span style=\"font-weight: 400;\">Hell yeah I love skateboarding as much as at the beginning. Even though physically speaking it’s not the same story unfortunately. Yes there is always a part of nostalgia but you know, I believe nostalgia is a luxury… so I’m happy to be nostalgic 🙂 and the great thing in skateboarding is that there are so many different tricks that you’re always learning, no matter how old you are.</span></p>\n<p><span style=\"color: #ff0000;\"><strong>I’m curious: what exactly made you fall in love with skateboarding?<br />\n</strong></span><span style=\"font-weight: 400;\">It’s this kind of activity where you’re single but in groups; the self-taught spirit as well and the total freedom that comes with it. Oh and also the artistic side of it; the fact that the playground is literally unlimited and not everything is based on performance.</span></p>\n<p><span style=\"color: #ff0000;\"><strong>Well, I dug too fast so you know what, let’s start again: can you introduce yourself?<br />\n</strong></span><span style=\"font-weight: 400;\">My name’s Bertrand Soubrier, I’m born and raised in Paris, I&#8217;ve lived here my entire life. I think I got my first pro-model in early 2000, some wheels from Tikal. Then I skated for some brands, like Cliche (I was in their flow team for a while), DC Shoes for 7 or 8 years, Converse in early 2000, Mekanism Skateboards, Tikal Wheels co, Square Wheels, V7 Distribution, Eastpak, Creme Skateboards (I got some pro-model with them), Follow Skateboards where I got last year a veteran pro-model etc. Now I skate for the Parisian skate shop <a href=\"http://www.nozbone.com/\" target=\"_blank\" rel=\"noopener\">Nozbone</a> and the french distributor of Lakai gives me some shoes.</span></p>\n<p><span style=\"color: #ff0000;\"><strong>Apparently you were already announcing that you’ll launch your own brand at some point while you were still a pro, is it true? Why? Was it the logical path to take for you?<br />\n</strong></span><span style=\"font-weight: 400;\">Yep, indeed. I even said this long before turning pro. I remember a discussion with my aunts when I was 17 or 18 years old and they asked me what I wanted to do as a grown-up. I told them that after skateboarding I’ll launch my own skate brand. That was definitely the path in my head yes, I was sure about that. And the reason was simple: I’m way too much in love with skateboarding, period. Maybe one day I’d want to make something else but until then, skateboarding is all my life.</span></p>\n<div id=\"attachment_2937\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2937\" class=\"size-full wp-image-2937\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-jp.jpg\" alt=\"JP Villa in the Blaze Supply movie ‘Ceremony’\" width=\"680\" height=\"383\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-jp.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/haze-jp.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2937\" class=\"wp-caption-text\">JP Villa in the Blaze Supply movie ‘Ceremony’</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Ok, so at what time exactly did you start your own brand?<br />\n</strong></span><span style=\"font-weight: 400;\">I decided to launch my first wheels brand with a friend right after the 2 biggest French wheels brands—Lordz/Square and Tikal—shut down. Since I’d skated for Square and then Tikal, that seemed logical for me back then to start with wheels; and the investment was lower too.</span></p>\n<p><span style=\"color: #ff0000;\"><strong>You started with the wheels but then launched some hardware (Screwheads), some bearings (Pulsar), some griptape (Creep Grip)… tell us: when will you launch the complete Basementhill haha?<br />\n</strong></span><span style=\"font-weight: 400;\">🙂 You know I already make boards sometimes (<a href=\"https://www.facebook.com/creepncrawlskts/\" target=\"_blank\" rel=\"noopener\">Creepn Crawl</a>) with my friend Steph (art director &amp; graphic designer for <a href=\"https://www.facebook.com/BasementhillDistribution/\" target=\"_blank\" rel=\"noopener\">Basementhill</a>) so yeah we just lack the trucks… Graphics wise, Steph (alias <a href=\"https://www.instagram.com/koolfunc88/?hl=en\" target=\"_blank\" rel=\"noopener\">Koolfunc&#8217;88</a> alias Turs.) does everything.</span></p>\n<p><strong><span style=\"color: #ff0000;\">Can you talk about your team? Do you pick the riders yourself?<br />\n</span></strong><span style=\"font-weight: 400;\">Yep, and I love the fact that they all have a different style. I mean they all have this very special board control but if you think about Michael (Mackrodt) or Oscar (Candon) or JP (Villa) they all have their own way of skateboarding.</span></p>\n<div id=\"attachment_2938\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2938\" class=\"size-full wp-image-2938\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Haze-SamPartaix_CeilingWallBash_Germany.jpg\" alt=\"Sam Partaix, ceiling wall bash\" width=\"680\" height=\"1022\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Haze-SamPartaix_CeilingWallBash_Germany.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_200/mag/uploads/Haze-SamPartaix_CeilingWallBash_Germany.jpg 200w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2938\" class=\"wp-caption-text\">Sam Partaix, ceiling wall bash. Photo: Savate</p></div>\n<p><span style=\"color: #ff0000;\"><strong>One thing I noticed about your team—apart from the fact it’s a big one—it mixes a lot of different generations. I mean, did you mix someone like Jeremie (Daclin) and Victor (Campillo) on purpose?<br />\n</strong></span><span style=\"font-weight: 400;\">Yes I think we have to get a team with different generations in order to ‘resonate’ with every skateboarder out there. While you mention <a href=\"https://mag.skatekrak.com/daclin/\" target=\"_blank\" rel=\"noopener\">Jeremie</a>, did you know he was the very first person to sponsor me back in the days? Like the very first time I earned some money from skateboarding! Hence my desire to get him on the team, especially since I’m really fan of his work and he inspires me a lot.</span></p>\n<p><span style=\"color: #ff0000;\"><strong>Some shout outs?<br />\n</strong></span><span style=\"font-weight: 400;\">Thanks to you first for this opportunity. KrakBox is a very cool concept, and thanks to you: skateboarders in the US will discover for the first time Haze and Screwheads. </span><span style=\"font-weight: 400;\">And thanks to my entire family, my friends, the people who helped me along the way, the skaters/shops/distributors/media who support Haze, Screwheads, Pulsar, Creeep Grip, Creepn Crawl, and above all: a big up to skateboarding!</span></p>\n<p><span style=\"color: #ff0000;\"><strong>Well, a big up to you Bertrand, we wish you all the best for what’s next, and I look forward to our next session together in Paris. Peace.<br />\n</strong></span><span style=\"font-weight: 400;\">I look forward to it too.</span></p>\n<p><img class=\"aligncenter size-full wp-image-2935\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-graphics.jpg\" alt=\"Haze Wheels graphics\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-graphics.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/haze-graphics.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/haze-graphics.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p>Cover image: Hugo Maillard in the Sugar x Pulsar video</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 12 that shipped with the Winter <a href=\"http://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["france","haze-wheels","interviews","krakbox","krakmag"],"featuredImages":[{"file":"haze-hugo.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/haze-hugo.jpg"}],"video":""}