{"id":2985,"date":"2018-01-02T18:07:56","date_gmt":"2018-01-03T02:07:56","slug":"interview-remy-taveira","title":"Interview with Remy Taveira with intro by Julian Dykmans","content":"<p><em>I&#8217;ve known Remy for a couple years now. Interesting how I have no idea how many unless I’d scrutinise my head and start counting back. </em><em>The way I do that used to be thinking about my school years, now it’s with the age of my son. He is now 9 years old and when I met Remy was on the 3rd and last Antiz Hobo tour we did. </em><em>Those were every year and I remember the 1st one because it was my first skate tour as a dad. Every year we did one, so yeah, I&#8217;ve known Remy for 6 years now. </em><em>I thought it was more like 10 since now he is pretty much the best guy out there in Europe.</em></p>\n<p><em>Back then this was his first tour and we were in Belgium, my home country. I remember it rained everyday and I also noticed that Remy never complained. He got a lot of shit from Steve Forstner mostly because Steve could not skate and was there anyway so just gave a lot of shit to the new guy. I think Remy might have fought back one night by emptying a whole bag of sugar into Steve’s hair and sleeping bag. Not the helpless kind, ah! One night there was a fight with some Russians in the streets, the police car came and since the cops did not even bother to come out of the car, Remy showed his little pocket knife to them and said if it was not a problem he could just go ahead and stab them. The police officer just told him he was not gonna do that and went on with his routine drunken check. I could not believe it. </em></p>\n<p><em>Now whenever I see Remy’s footage, I am longing for more. I never know what he is going to do next and I enjoy that. I would really like to see him focus on one sole project for like 3 years or whatever time is needed to get a really good part. What would come out of it would be probably one of the best parts ever. This kid’s got magic in his feet and the bonus is that he’s got his head on his shoulders, and yeah, he is pretty much cool as fuck.</em></p>\n<p><em>So hey everyone, let Remy do his thing for a while so we can enjoy.</em></p>\n<p><em>Skate fast.</em></p>\n<p><em>– Julian Dykmans</em></p>\n<div id=\"attachment_2987\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2987\" class=\"size-full wp-image-2987\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/remy-furogirlmakeup.jpg\" alt=\"Furo Girl Make Up. Photo: Remy Taveira\" width=\"680\" height=\"451\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/remy-furogirlmakeup.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/remy-furogirlmakeup.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2987\" class=\"wp-caption-text\">Furo Girl Make Up. Photo: Remy Taveira</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Do you remember your first Antiz tour? This took place in Belgium apparently.<br />\n</strong></span>Hell yeah I remember, that was my first tour with the <a href=\"http://www.antizskateboards.com/02.php\" target=\"_blank\" rel=\"noopener\">Antiz team</a>, in Belgium indeed. If I remember well it rained like everyday… even though we were there in the middle of the summer. We spent a lot of time to just try to avoid the rain and I think we drove like 10 times the whole Belgium to find some dry spots! We spent a lot of time inside the van too, drinking some warm CaraPils. I was the youngest among the team by far.</p>\n<p><span style=\"color: #ff0000;\"><strong>Well this didn’t kill your desire and will to go on tour because since then you travelled quite a lot. Where have you been this winter? And what’s next?<br />\n</strong></span>Yes indeed, I love travelling. This winter I’ve been to Indonesia, Reunion Island, Mauritius, Spain, London, Brussels… next trip will be in Italy. Look forward to it.</p>\n<p><strong><span style=\"color: #ff0000;\">What do you love so much about travelling?<br />\n</span></strong>I believe that travel shapes the young. You discover some cultures, new ways of living and thinking and this is something that inspires you in your daily life then. I know that not everyone is able to travel so I’m very lucky. That being said I didn’t travel that much when I was younger so today I’m very grateful and I wanna make the most out of it.</p>\n<p><span style=\"color: #ff0000;\"><strong>Let’s start: who are you Remy Taveira? When did you start skateboarding? Who are your sponsors?<br />\n</strong></span>I started when I was 12 years old… wow I’m 25 now so I skate for 13 years already! I ride for Antiz Skateboards, Converse, RVCA, Nozbone Skateshop, Spitfire, Öctagon, Savate Skate Socks!</p>\n<p><strong><span style=\"color: #ff0000;\">I remember an interview you made for Free Skatemag and you told that sometimes you kind of wish to get a part-time job. Is it still the case?<br />\n</span></strong>Yeah this is true that it could be good to get a part-time job or something where you have some specific working hours. That would allow me to keep my feet on the ground and to get a feeling that I belong to this society!</p>\n<p><span style=\"color: #ff0000;\"><strong>In this issue we interviewed people who were keen to build their own brand. Do you think about it?<br />\n</strong></span>First thing for me is: if you want to build a brand you have to first be quite popular in the community. Nope I never really thought about it. The most important thing for me if you wanna launch your brand is to have a creative mind while you also know how to manage the business part of it. This is not something for everyone and I don’t know if I wanna make this at some point.</p>\n<p><span style=\"color: #ff0000;\"><strong>What about photography?<br />\n</strong></span>I started doing photos 8 years ago, something like this. I got my first film camera for my birthday and I never left it ever since. I find the process always enjoyable and I really enjoy taking pics with my film camera.</p>\n<p><span style=\"color: #ff0000;\"><strong>Any last words?<br />\n</strong></span>Thanks to you for the interview, and thanks to everyone I met briefly on tour and who wanted to help. Thanks to the kind Indonesian people.</p>\n<p><span style=\"color: #ff0000;\"><strong>Thanks a lot man, we hope your 2017 is full of travels and meeting with new people. Keep on pushin’</strong></span></p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 12 that shipped with the Winter <a href=\"https://krakbox.com/shop/product/999384657\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["antiz-skateboards","interviews","julian-dykmans","krakbox","krakmag","remy-taveira"],"featuredImages":[{"file":"remy-jew_nyc.jpg","width":680,"height":450,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/remy-jew_nyc.jpg"}],"video":""}