{"id":3115,"date":"2018-03-13T19:04:55","date_gmt":"2018-03-14T02:04:55","slug":"mark-schmid-sk8ology","title":"Founders Interview: Mark Schmid of Sk8ology","content":"<p><span style=\"color: #ff0000;\"><strong>First things first: who are you and what’s your history in skateboarding that led you to creating skate products?<br />\n</strong></span>My name is Mark Schmid, aka Schmiddy, and I’ve been in the sk8 game since the 1970’s. My love for skateboarding started on clay wheels and only got stronger as wheels turned to urethane, and then precision bearings replaced the old loose style bearings so even the crappy surfaces we were used to riding instantly felt like we were riding on clouds. Our only connectivity was through <a href=\"https://skateboarding.transworld.net/skateboarder-magazine-archives/\" target=\"_blank\" rel=\"noopener\">SkateBoarder Magazine</a>… VHS tapes were still 10 years away so the only way we learned new tricks was by seeing pro’s at demo’s or contests or trying to figure out how a trick was done by deciphering a 3-picture photo sequence in the magazine. My first sponsor was <a href=\"https://gordonandsmith.com/pages/history\" target=\"_blank\" rel=\"noopener\">G&amp;S</a> (Gordon &amp; Smith). I was 13 years old and in the team van with some of the best skaters in the world doing demo’s, contests, autograph signings, etc… once a month I’d get to go to the factory and load up on product. I felt like that kid in the movie “Almost Famous”… except it was just the positive parts! Anyway, after my skate career ended (I simply didn’t have the timing, patience, or pain tolerance to learn the latest tricks… Thanks a lot “<a href=\"https://www.youtube.com/watch?v=ICm4vHwpUiQ\" target=\"_blank\" rel=\"noopener\">H-Street: Shackle me Not</a>”) I started designing and manufacturing skateboard products. We now work with every major deck brand in the industry in making sure their HQ’s are museums of modern art celebrating the art of skateboards.</p>\n<div id=\"attachment_3119\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3119\" class=\"wp-image-3119 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-gs.jpg\" alt=\"G&amp;S skate team\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-gs.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/sk8ology-gs.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3119\" class=\"wp-caption-text\">Mark Schmid (small kid on the roof) with the G&amp;S team</p></div>\n<p><strong><span style=\"color: #ff0000;\">What was the graphic on the first board you skated?<br />\n</span></strong>Back in the days before specific art or an artist really became attached to a brand or pro, we just had our sponsors stickers on our boards. My first art graphic deck was a <a href=\"https://www.flickr.com/photos/dsirkin/22789666717/\" target=\"_blank\" rel=\"noopener\">G&amp;S Billy Ruff Chalice deck</a> in 1983… the artist was Miq Willmot.</p>\n<p><span style=\"color: #ff0000;\"><strong>You created the Sk8ology deck display to honor the history, creativity and lifestyle of skateboarding and so that people can exhibit skateboards in style. How big a role do you think art plays in skateboarding?<br />\n</strong></span>It’s strange because who would have ever thought that a skateboard deck would become an art medium? Check out <a href=\"https://theskateroom.com/\" target=\"_blank\" rel=\"noopener\">TheSkateRoom.com</a> and you know that the world’s biggest artists want to be front and center on the walls of folks that love skate culture. Any person that calls themselves a skater will realize at some point in the future that the period of their lives spent skateboarding was a really great part of their life. Your favorite brand or pro most likely has an association with an artist or artists that represents a time and attitude of what you were into… as the years stack up, so do your responsibilities. When I stare at one of my favorite company’s decks on the wall that brings me back to that time when my only responsibility was to go sk8 with my friends…</p>\n<div id=\"attachment_3118\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3118\" class=\"wp-image-3118 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-fantasy-factory-rob-dyredek.jpg\" alt=\"Sk8ology deck display\" width=\"680\" height=\"510\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-fantasy-factory-rob-dyredek.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/sk8ology-fantasy-factory-rob-dyredek.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3118\" class=\"wp-caption-text\">Rob Dyrdek with his Sk8ology deck display at the Fantasy Factory</p></div>\n<p><span style=\"color: #ff0000;\"><strong>What was the process like for creating this product? What are the important things to consider to make a board hang just right?<br />\n</strong></span>It started with a shitty shoe lace, moved to fishing string, and a couple of screws… it looked crappy and didn’t respect how much I loved my skateboard deck collection. I started experimenting with acrylic sheets and bolt’s so my deck collection could “float” off the wall without seeing any visible hardware. My original racks were HUGE! They weighed a pound and a half each, were super bulky, and shipping them was as expensive as making them. Once we figured out that the “float” was the coolest aesthetic, we then needed to figure out how to make it affordable – that meant making it as small as possible, but still functional. As far as hanging decks just right, the most important factors are making sure a deck or group of decks is centered, equally spaced apart, and lit well. If you’re hanging a bunch of weird shaped decks then you’re gonna want to make sure all the noses of the decks are in a straight line.  One of my favorite things to do is go to the thrift store and buy a 2’x3’ frame which will hold 2 standard decks perfectly and should cost around $4 bucks… the more ornate the better – you can always paint it to match or contrast with the decks/matboard.</p>\n<div id=\"attachment_3121\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3121\" class=\"size-full wp-image-3121\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-transworld-paul-kobriger.jpg\" alt=\"Sk8ology deck display\" width=\"680\" height=\"510\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-transworld-paul-kobriger.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/sk8ology-transworld-paul-kobriger.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3121\" class=\"wp-caption-text\">Paul Kobriger with the Sk8ology deck display at Transworld</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Who is your favorite skate artist and why?<br />\n</strong></span>There are soooooo many! In the 80s it was Jim Phillips, in the 90s, Marc McKee. These days my favorites are Shepard Fairey, Don Pendleton, NeckFace, and Ed Templeton.</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you have an all time favorite board graphic?<br />\n</strong></span>Nope. There are just too many.</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 17 that shipped with the Xmas <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["art","interviews","krakbox","krakmag","mark-schmid","sk8ology"],"featuredImages":[{"file":"sk8ology-stereo.jpg","width":680,"height":510,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/sk8ology-stereo.jpg"}],"video":""}