{"id":2255,"date":"2015-10-23T11:00:08","date_gmt":"2015-10-23T18:00:08","slug":"oliver-percovich","title":"Founder&#8217;s Interview &#8211; Skateistan&#8217;s Oliver Percovich","content":"<h3><span style=\"color: #999999;\"><strong>The following interview was originally featured in the print Krak Mag issue 3 that shipped with </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>#3 in August 2015. Don&#8217;t want to miss the next issue of the print Krak Mag? Want to receive epic skateboarding product every two months? Check out the </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>now!<em><br />\n</em></strong></span></h3>\n<p><span style=\"color: #000000;\"><em>Founded in 2007 as a skateboarding school in Kabul, Afghanistan, <a href=\"https://www.skateistan.org/\" target=\"_blank\">Skateistan</a> has grown phenomenally in the past 8 years into a full-fledged non-governmental organization that works with youth in several locations around the world. Spreading change through our troubled world by bringing the simple joy of skateboarding and the associated life skills of determination, resilience and self-learning that skateboarding fosters, Skateistan is changing the lives of youth in challenging circumstances one board at a time. We got to interview Skateistan’s founder, Oliver (Ollie) Percovich about Skateistan and listen to him share about its history, challenges and plans for the future. Be inspired. &#8211; HK</em></span></p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg\"><img class=\" size-medium wp-image-2257 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg\" alt=\"jamie and ollie rooftop_photoby_ChadForeman\" width=\"300\" height=\"213\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg 1968w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Ollie Percovich and Jamie Thomas. Photo: <a href=\"http://www.foremanphotos.com/\" target=\"_blank\">Chad Foreman</a>.</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>HK: Hi Ollie, we&#8217;re really excited to be working with Skateistan for this KrakBox. You guys are doing something pretty unique, and it&#8217;s definitely awesome to see skateboarding used as a positive force for change in the world. For the benefit of our readers, can you tell us a little more about Skateistan?</b></span></p>\n<p>Established in Kabul in May 2007, ‘Skateistan’ is an independent, neutral non-governmental organization (NGO) that works with youth from a range of ethnicities and socioeconomic backgrounds to build trust and provide empowerment through a unique combination of skateboarding and educational activities. We work in Afghanistan, Cambodia, and South Africa.</p>\n<p>Our mission is to use skateboarding as a tool for empowering youth and changing lives – to create new opportunities and the potential for change.</p>\n<p>Our aim is to grow a sustainable organization that is 100% administrated by local staff and recognized for changing the lives of youth through skateboarding and quality programs.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Why did you choose to use skateboarding to effect change via Skateistan?</b></span></p>\n<p>Because once kids latch onto skateboarding, much more is possible; education, community, leadership. Sport, especially skateboarding, transcends deep seeded social and cultural barriers. In Afghanistan it is considered inappropriate for girls to ride bikes, but skateboarding is so new that there&#8217;s no stigma attached to it. Children from different backgrounds and tribes are also able to form strong friendships inside the skatepark.</p>\n<p>Skateboarding is non-competitive, requires minimal supervision and resources, and can be practiced anywhere there is a smooth surface. Achievements in skateboarding occur on an individual level and depend on balance, creativity and personal expression. Admiration and team building occurs between skateboarders as they see each other progress and overcome personal hurdles. Skateistan’s programing provides a supportive environment that encourages these relationships and uses them to build understanding between children of diverse backgrounds, develop confidence and grow leadership skills. The relative novelty of skateboarding compared to more mainstream sports has been especially beneficial in countries or areas where skateboarding does not yet exist or is inaccessible.</p>\n<p>Skateistan is able to help tackle social issues, focusing on the promotion of gender equality, empowerment, social inclusion, self-esteem, health and education.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>That’s well put. Where are Skateistan’s main locations? I understand you’ve expanded beyond Afghanistan itself.</b></span></p>\n<p>Firstly, we began in Kabul, Afghanistan. Skateistan began as a grassroots &#8216;Sport for Development&#8217; project on the streets of Kabul in 2007. On October 29, 2009, Skateistan completed construction of an all-inclusive skatepark and educational facility on 5428 square meters of land donated by the Afghan National Olympic Committee in Kabul. Skateistan Kabul is Afghanistan’s first skateboarding school, and is dedicated to teaching both male and female students in separate classes.</p>\n<p>We also have our Skateistan school in Mazar-e-Sharif, Afghanistan that was built in 2013. This facility is truly unique in Afghanistan, where safe spaces for children are exceptionally rare&#8230; And a place – just for kids – with skateparks, indoor and outdoor, classrooms and a climbing wall? Unthinkable. Until now!</p>\n<p>More recently we’ve expanded into Phnom Penh, Cambodia. Skateistan Cambodia works in partnership with local NGOs such as Friends International and the Cambodian Women’s Development Agency to bring skateboarding, arts and leadership opportunities to girls and boys of all backgrounds and abilities in the nation’s capital. After a year and a half of street outreach activities and sessions at the PSE skate park, taught by Khmer and foreign volunteers, Skateistan Cambodia opened its own facility in September 2012, and now works with 150 – 200 youths each week.</p>\n<p>Johannesburg, South Africa is the newest project location. Begun in 2014, it is a flagship skateboard-based educational and cultural project for at-risk youth in Johannesburg’s Central Business District. The South Africa project builds on the lessons learned and working manual from Skateistan’s existing programs to develop similar skateboard-based educational programming for the South African and regional context. Currently over 100 youths participate weekly through street outreach programming, and we expect that weekly participation will reach 200-300 youths weekly once the new facility is completed.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>I know you went out to Kabul in 2007, what prompted your trip to Afghanistan? Was it your first trip? It probably wasn&#8217;t at the top of everyone&#8217;s list as a skate destination back then.</b></span></p>\n<p>I went to Afghanistan because my ex-girlfriend had a job there and I wanted to check the place out. It was my first time to Afghanistan but not my first trip overseas. I had travelled to 42 countries before going to Afghanistan.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>What made you decide to start a skateboarding school out there in Kabul and eventually push it for NGO status?</b></span></p>\n<p>It was the fact that there are so many young people in Afghanistan with so little opportunities. 70 percent of the population is under 25 and Afghan has the most school-aged children out of any country in the world per capita. When girls started skating in the streets in Kabul, I was so excited. Hardly any girls skate anywhere and here were girls skating in Kabul. I saw skateboarding as something that could make their lives a little better. After the skate sessions developed and I got to know the kids better, I helped some of them get back to regular school. At that point it was clear that this was an idea that needed to be expanded and we applied for NGO status.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>What do you think of Patrik Wallner&#8217;s &#8220;Meet the Stans&#8221; installment in his Visual Traveling series?</b></span></p>\n<p>It’s rad to see the Stans on the skate map. Patrik is an awesome guy and I’m a big fan of the whole Visual traveling crew.</p>\n<p><iframe src=\"https://player.vimeo.com/video/46337060\" width=\"1080\" height=\"608\" frameborder=\"0\" title=\"Afghanistan&#039;s Girl Skaters &ndash; Kabul 2012\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></p>\n<p><span style=\"color: #ff0000;\"><b>Why do you think girls have taken to skateboarding as much as they&#8217;ve done in Kabul?</b></span></p>\n<p>Skateboarding is the biggest organized sport for girls in Afghanistan and Skateistan has always prioritized girls in our programs. We put 80% of our resources into getting 50% girls participation. We provide transport for girls and not boys and we do a lot of follow up with the families to help them understand what skateboarding is and what the kids are learning in the classrooms.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>That’s rad! How many youths have been through Skateistan&#8217;s programs since it&#8217;s inception?</b></span></p>\n<p>Globally, we have 1500 registered students right now and we run classes every day of the week. In Afghanistan, Friday and Saturday is off and in Cambodia Sunday is off. Well over 5000 kids have taken part in Skateistan’s programs since we started. Children can start with us when they are 5 years old and stay with us for up to 12 years. All classes are free. We are much more interested in having less kids stick with us for 10 years, than just doing one session with 100,000 different kids. The value is in the relationship that is built over time and the community that can form from skateboarding and arts based classes.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>That’s totally true, so much of what makes skateboarding amazing is the communities it builds through skateboarding. I know Jamie Thomas and Chad Foreman went out to Kabul in 2014 to visit the Skateistan schools. What was your favorite memory from their visit?</b></span></p>\n<p>We had a really amazing time the whole trip, but the hill bomb from Paghman down to lake Qargah was super fun. Some of our staff members, Rachmat, Sulaiman and Hamdullah, who are cousins, invited us to their family’s house for dinner and that was a very interesting cultural exchange between the Afghans and their American guests, Chad and Jamie. Jamie filming me skateboarding was pretty nerve wracking, but I landed some stuff that I had never done before so that was cool.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>What has been your biggest challenge with running Skateistan?</b></span></p>\n<p>The biggest challenge was losing 4 students in a suicide bombing in Kabul in 2012. They were outside of an army base when a young boy with a suicide vest on detonated right next to them. Parwana, Khoshid, Nawab and Easa were very unlucky to be in the wrong place at the wrong time and we’ll never forget them.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Oh man, I remember hearing about that. We live in a troubled world.</b></span></p>\n<p>Beside that, staffing is really hard to get right. It can take some time and experience to get the right people for all the different positions we have. Also, learning to work across many different cultures is tricky but important to master.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>I think it’s genius that you&#8217;re using skateboarding which used to have a huge counter culture element in the public’s perception to do good in very challenging circumstances for these youths. What has the public perception and reception of Skateistan been like on the ground in Kabul?</b></span></p>\n<p>Overall it has been very positive. Skateboarding is fun and because the children love it so much, that makes everyone happy. Everyone likes to see their kid happy.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>If someone would like to get involved in helping Skateistan, how could they do so?</b></span></p>\n<p>You can make a monthly donation, buy a t-shirt or other merchandise that we have on our online shop, buy co-branded <a href=\"https://www.skateistan.org/\" target=\"_blank\">Skateistan</a> products like the Impossible film for Polaroids that we just released, hold a fundraiser for Skateistan or look out for jobs that come up from time to time on our website. Following Skateistan on <a href=\"https://instagram.com/skateistan/\" target=\"_blank\">Instagram</a>, <a href=\"https://twitter.com/skateistan\" target=\"_blank\">Twitter</a> and <a href=\"https://www.facebook.com/skateistan?_rdr=p\" target=\"_blank\">Facebook</a> and sharing our content is also a great way to let your friends know that you support Skateistan.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>I know you have offices in Berlin. Why did you choose to be located there?</b></span></p>\n<p>It is in a similar time zone as all our project sites and we really needed a solid base after starting in Kabul. In Kabul we didn’t have consistent power, water, heat, internet or a postal system. The electricity and internet would drop out for hours every day and it was impossible to receive donations to our bank account there. Since opening up our headquarters in Berlin, our students quadrupled and our locations have doubled. It was a good move.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>That makes sense. So coming back to the skate questions, when did you start skateboarding?</b></span></p>\n<p>I started skateboarding in 1980 in Melbourne Australia when I was almost 6. My cousin Alex gave me his old skateboard which he had ridden in the 70s. As soon as I first fell off it I was hooked for life. I brought it along when we moved as a family to Papua New Guinea (PNG) and got skateboarding banned at both the primary schools that I went to there. Due to not having many smooth surfaces in PNG besides at school I didn’t get past learning to tic tac and doing 180 kick turns. Then we moved back to Australia and the first film I saw at a cinema ever was Back to the Future in 1985. That made me take skateboarding seriously again.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>That’s quite a skateboarding backstory. I’m pretty sure Back to the Future influenced a whole generation to start skateboarding! Who were your favorite skateboarders and video parts growing up?</b></span></p>\n<p>My favorite skateboarders are my friends that I grew up skating with &#8211; my brother Chris and my friend Tim Bartold. In terms of famous skaters, in 1986 it was Cab, Gator and Hosoi. Locally it was Lee Ralph.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>There’s a Lee Ralph documentary being made right now actually (Barefoot – The Lee Ralph Story), he’s definitely a legend. I still remember his Vision graphic. What about favorite skaters right now?</b></span></p>\n<p>My skating peaked in about 1996 and my favorite video part is Jamie Thomas’s in Welcome to Hell. Right now it’s those giving the most back in terms of building the culture. Tony Hawk and Jim Thiebaud are very inspiring in all they do for skateboarding. I’m stoked on seeing the girls skate scene develop. Lizzie Armanto is especially cool.</p>\n<p>&nbsp;</p>\n<p><b><span style=\"color: #ff0000;\">Yeah Lizzie rips! I know Skateistan has now expanded to Cambodia and South Africa. Can you elaborate on why Skateistan chose to expand to these two places first?</span> </b></p>\n<p>We wanted to be on different continents and to understand how to spread Skateistan all over the world. It is very hard to run the project in Afghanistan and consequently we were learning slowly. We have built our organizational knowledge and the complexity of our programs and staff by expanding to Cambodia and South Africa.</p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/New-story-telling-from-back-in-the-day_photoby_ChadForeman.jpg\"><img class=\" size-medium wp-image-2263 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/New-story-telling-from-back-in-the-day_photoby_ChadForeman.jpg\" alt=\"New story telling from back in the day_photoby_ChadForeman\" width=\"225\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/New-story-telling-from-back-in-the-day_photoby_ChadForeman.jpg 225w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/New-story-telling-from-back-in-the-day_photoby_ChadForeman.jpg 768w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/New-story-telling-from-back-in-the-day_photoby_ChadForeman.jpg 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/New-story-telling-from-back-in-the-day_photoby_ChadForeman.jpg 1800w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Story telling from back in the day. Photo: <a href=\"http://www.foremanphotos.com/\" target=\"_blank\">Chad Foreman</a>.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Any new places we can expect to see Skateistan expanding to in the next year?</b></span></p>\n<p>We would like to use our existing projects as a hub and do some smaller satellite projects near Phnom Penh and Johannesburg.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>If you could give the youth today a message, what would it be?</b></span></p>\n<p>Believe in your own ideas and don’t worry too much about what others think of them. With persistence you can knock down any door.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Thanks Ollie! All the best with Skateistan’s work in the future!</b></span></p>\n<p><span style=\"color: #999999;\"><em>Liked this interview? Check out the print <span style=\"color: #ff0000;\">Krak Mag</span> in each <span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a></span>  for more great content!</em></span></p>\n<p>&nbsp;</p>\n","author":"kev","categories":["interviews"],"tags":["afghanistan","berlin","chad-foreman","jamie-thomas","kabul","oliver-percovich","skateistan"],"featuredImages":[{"file":"jamie-and-ollie-rooftop_photoby_ChadForeman.jpg","width":1968,"height":1400,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/jamie-and-ollie-rooftop_photoby_ChadForeman.jpg"}],"video":""}