{"id":3561,"date":"2018-11-28T02:00:03","date_gmt":"2018-11-28T10:00:03","slug":"pauliana-laffabrier-badass-skateboards","title":"Founders Interview: Pauliana Laffabrier of BAD ASS Skateboards","content":"<p><span style=\"color: #ff0000;\"><strong>FIRST OFF, CAN YOU PLEASE INTRODUCE YOURSELF?</strong></span><br />\nI started skating when I was 17, about 10 years ago now! First it was in the streets of a small town near Bordeaux, as we didn’t have any skateparks. I started with a bunch of friends on a plaza. I wasn’t lucky with my ankles so I stopped for more than a year. Then in 2010, I discovered bowls, transitions and ramps when I moved to Bordeaux. I fell in love! I managed to win the French championship twice, in the bowl and in the vert category. I got on the French Team for the next Olympic Games, which means I get to travel with the girls. It’s pretty awesome!</p>\n<p><span style=\"color: #ff0000;\"><strong>HOW DID THE IDEA FOR BAD ASS COME ABOUT?</strong></span><br />\nIt’s been years since I became interested in developing women’s skateboarding. It started with skate lessons for girls for a few years, then skate camps in the summer. After a few years, I noticed there was no brand 100% for females, except Meow. So yeah, that’s how it started! I wanted a catchy name, that everyone could understand, with a reference to an emoji, because we’re so familiar with those nowadays&#8230; And so came the logo—the peach!</p>\n<p><span style=\"color: #ff0000;\"><strong>WHAT ARE YOU DOING WHEN YOU’RE NOT WORKING ON BAD ASS?</strong></span><br />\nMost of the time, skateboarding or wake-skate. We’re trying to build a crew with the girls in Bordeaux to make a video in the city. I travel a bit but because of my ankles I’m mostly focusing on the big upcoming competitions like the Volcom Invitational in Bilbao at the end of June or the Vans Park Series in Malmö in September. I also work for a society named <a href=\"https://www.boardo.fr\">Board-O</a>; I teach skateboarding all year long.</p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-Boneless-Drop-In.jpg\"><img class=\"size-full wp-image-3571 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-Boneless-Drop-In.jpg\" alt=\"\" width=\"1000\" height=\"667\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-Boneless-Drop-In.jpg 1000w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Pauliana-LAFFABRIER-Boneless-Drop-In.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/Pauliana-LAFFABRIER-Boneless-Drop-In.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>DID YOU HAVE ANY EXPERIENCE WORKING FOR A SKATE BRAND BEFORE THIS?</strong></span><br />\nI never officially worked for a skate brand. I would have loved it because I love the culture and I would have been fully committed for sure! I have some experience in communication and marketing and I enjoy filming and taking pictures. Bad Ass was a new challenge and I’m happy with it for now!</p>\n<p><span style=\"color: #ff0000;\"><strong>CAN YOU GIVE US A QUICK INTRO TO THE SKATERS ON THE BAD ASS TEAM?</strong></span><br />\n<a href=\"https://www.instagram.com/louise.crp/?hl=fr\" target=\"_blank\" rel=\"noopener\">Louise Crespin</a>, only 16 years old and just a few years of skating but already really good! Less technical than the rest of the team but she has a really nice style! She’s also pretty good in surfing&#8230; Watch out for this girl!<br />\n<a href=\"https://www.instagram.com/jeromine_louvet/?hl=fr\" target=\"_blank\" rel=\"noopener\">Jéromine Louvet</a>, young girl from Toulouse who started skating at a really young age and you can see it in her skating! Technical and all terrain, she was French champion in bowl this year and nothing can stop her!<br />\n<a href=\"https://www.instagram.com/jeannneduval/?hl=fr\" target=\"_blank\" rel=\"noopener\">Jeanne Duval</a>, the eldest, from Nantes. She likes street skating and has the greatest style! She also likes cats, just like me haha!<br />\nLast but not least, <a href=\"https://www.instagram.com/shanibru/?hl=fr\" target=\"_blank\" rel=\"noopener\">Shani Bru</a>! My homie from Bordeaux! She’s hard working and skates almost everyday. She gets better every time I see her! She’s not really on the team because she’s on Sector 9 but I still hook her up with clothes and she supports us with pictures too!</p>\n<p><em>Update on Nov. 2018</em>: Jeanne &amp; Shani are not in the team anymore.</p>\n<p>Welcome <a href=\"https://www.instagram.com/alice_atta/\">Alice Atta</a>, a young girl from Marseille who&#8217;s ripping all the bowls within the region and who&#8217;s been to the Red Bull Bowl Rippers final. <a href=\"https://www.instagram.com/juliebetrix/\">Julie Betrix</a>, a very skillful young girl skateboarding in the Alps. <a href=\"https://www.instagram.com/aloha_bornend/\">Aloha Bornend</a> who loves transition and spends a fair amount of time in the ramp. And the next one will be <a href=\"https://www.instagram.com/juju.mdc/\">Juliette Meudec</a>, coming from Brittany and the youngest among us who already has a huge potential.</p>\n<p><span style=\"color: #ff0000;\"><strong>HOW DID YOU GET TO KNOW THESE GIRLS?</strong></span><br />\nI basically know them all from Instagram, then we met at contests and most of us have been or are still part of the French team.</p>\n<p><span style=\"color: #ff0000;\"><strong>DO YOU HAVE ANY PLANS TO EXPAND THE TEAM OUTSIDE OF FRANCE?</strong></span><br />\nI think I want to push the brand to get recognition in France first. I communicate in French on social media and we are growing a French community right now but of course I won’t be against expanding over Europe and worldwide one day!</p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-FS-grind.jpg\"><img class=\"size-full wp-image-3572 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-FS-grind.jpg\" alt=\"\" width=\"1000\" height=\"667\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-FS-grind.jpg 1000w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Pauliana-LAFFABRIER-FS-grind.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/Pauliana-LAFFABRIER-FS-grind.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>SHANI BRU IS ALSO TRAINING FOR THE OLYMPICS WITH THE FRENCH SKATEBOARD TEAM, RIGHT? WHAT DO YOU THINK SKATEBOARDING BEING IN THE OLYMPICS MEANS FOR FEMALE SKATEBOARDERS?</strong></span><br />\nYeah Shani is the one with the biggest potential for the Olympics in 2020! I think skateboarding in the Olympics will help to get recognition from PAULIANA LAFFABRIER, cities and from people in general! Also, girls will see girls killing it on tv and a whole new wave of skater girls may come out of it, even if social media is already creating this!</p>\n<p><span style=\"color: #ff0000;\"><strong>DO YOU HAVE ANY PLANS FOR A BAD ASS FULL LENGTH CLIP?</strong></span><br />\nWe are working on something. It’s too much park footy at the moment and I would really like to take it in the streets but it’s not easy. I’m also wondering if long length still attracts people nowadays. I’d like to do something different than just another skate video.</p>\n<p><span style=\"color: #ff0000;\"><strong>YOU’VE SHOT SOME AWESOME PHOTOS OF THE BAD ASS TEAM. ARE YOU A SELF-TAUGHT PHOTOGRAPHER?</strong></span><br />\nThanks! I learned everything by myself, checking advice on Internet, reading books, asking tips to professional photographers and practicing a lot, because that’s the only way!</p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-Wallride.jpg\"><img class=\"size-full wp-image-3573 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-Wallride.jpg\" alt=\"\" width=\"667\" height=\"1000\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Pauliana-LAFFABRIER-Wallride.jpg 667w, https://res.cloudinary.com/krak/image/upload/w_200/mag/uploads/Pauliana-LAFFABRIER-Wallride.jpg 200w\" sizes=\"(max-width: 667px) 100vw, 667px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>DO YOU HAVE ANY PLANS TO START SELLING IN OTHER COUNTRIES OR WORK WITH A DISTRIBUTOR LIKE RIOT? WHY DO YOU ONLY DISTRIBUTE WITHIN FRANCE?</strong></span><br />\nWe still produce small quantities and cannot afford to go bigger yet. I hope it will change in the future! You can order from anywhere in Europe on the website though.</p>\n<p><span style=\"color: #ff0000;\"><strong>DO YOU CONSIDER BAD ASS TO BE A SKATE BRAND FOR FEMALES OR A SKATE BRAND FOR EVERYONE?</strong></span><br />\nWell it’s a brand created by a girl who tries to push the skate girl community but we aren’t so close-minded and I think guys like the peach so they can find a way to enjoy what we are doing!</p>\n<p><span style=\"color: #ff0000;\"><strong>WHO WORKS ON THE DESIGN OF YOUR APPAREL?</strong></span><br />\nThe peach on wheels was created by <a href=\"https://www.instagram.com/ya.ld/\" target=\"_blank\" rel=\"noopener\">YA.LD</a> but I’m now working with a French skater girl, <a href=\"https://www.instagram.com/boulgom_cat/\" target=\"_blank\" rel=\"noopener\">Clemence</a>, on some new boards. It’s gonna be awesome!</p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skateboard1.jpg\"><img class=\"size-full wp-image-3574 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skateboard1.jpg\" alt=\"\" width=\"2048\" height=\"1536\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skateboard1.jpg 2048w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/skateboard1.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/skateboard1.jpg 768w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/skateboard1.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/skateboard1.jpg 1080w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>WHAT’S IT LIKE SKATING IN BORDEAUX? THEY’RE REALLY STRICT WITH PEOPLE STREET SKATING IN THE CITY, RIGHT? DOES IT CHANGE THE VIBE?</strong></span><br />\nA few years ago, they were very strict, people got tickets all the time. It’s been about a year since skaters met the representatives and thanks to guys like Léo Valls, skateboarding is taken a little more seriously now. There are even some hours they let us skate some plazas in the city! But on the flip side, the only bowl in town is left behind and getting more and more dangerous!</p>\n<p><span style=\"color: #ff0000;\"><strong>WHAT’S YOUR FAVORITE PLACE TO SKATE THERE?</strong></span><br />\nI have to drive for an hour to find my favourite bowls like in Libourne or Gujan Mestras for example.</p>\n<p><span style=\"color: #ff0000;\"><strong>WHAT ARE YOUR PLANS FOR THIS SUMMER?</strong></span><br />\nA few days in Bilbao in June for the Volcom contest at La Kantera bowl. Then beginning of July we are supporting a 100% female surf and skate event in Brittany where we will give skate lessons and demos. We will stay for a week round Lorient to skate and surf a bit. Then we plan a skate trip to the Basque coast with some girls from Bordeaux, camping in bowls and eating tapas! The last 2 weeks of August I will be on a skate camp mission as a teacher and photographer for Board’O Association! Then finally comes the Vans Park Series in Malmö followed by a holiday to Copenhagen and I will start an architecture and design traineeship in October until next summer!</p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Sticker_BadAss.png\"><img class=\"size-full wp-image-3576 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Sticker_BadAss.png\" alt=\"\" width=\"1737\" height=\"735\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Sticker_BadAss.png 1737w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Sticker_BadAss.png 300w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/Sticker_BadAss.png 768w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/Sticker_BadAss.png 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/Sticker_BadAss.png 1080w\" sizes=\"(max-width: 1737px) 100vw, 1737px\" /></a></p>\n<p>&nbsp;</p>\n<p><em>Pictures by Clement Le Gall</em></p>\n","author":"simon","categories":["interviews"],"tags":["badass-skateboards","interview","womens-skateboarding"],"featuredImages":[{"file":"portrait1.jpg","width":1024,"height":683,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/portrait1.jpg"}],"video":""}