{"id":3049,"date":"2018-05-08T10:43:57","date_gmt":"2018-05-08T17:43:57","slug":"rob-brink-the-hundredth-acre","title":"Founders Interview: Rob Brink of The Hundredth Acre","content":"<p><em>Rob Brink’s career has seen him go from a skate shop employee in New Jersey to one of skateboarding’s hardest working behind the scenes guys. He’s worked for companies like DC Shoes and Sole Tech, written for TransWorld and hosted Weekend Buzz. There are plenty of interviews out there about Rob’s involvement in skateboarding, but we wanted to chat to him about something a little different: his candle company, The Hundredth Acre.</em></p>\n<p><span style=\"color: #ff0000;\"><strong>There are plenty of interviews out there already that cover your extensive history working in the skate industry so I won’t dig too much into that. But for those who don’t know, can you give us a brief summary of how you went from a skate shop employee in New Jersey to skateboarding’s hardest working behind the scenes guy?<br />\n</strong></span>It was such a whirlwind that sometimes I can’t even remember it all happening. Once I gave up hopes of becoming a legit sponsored skater, I continued college and then grad school. All along I’d been working at a bagel shop and a skate shop … and by the end of grad school, about summer 2000, I quit the bakery to work full time as a book editor at a small publishing house in NJ. But the whole time kept working remotely, for free, helping the skate shop with their buying. I kept that door open because I loved working in skating and didn’t want to not have it in my life. At the exact same time, Tim O’Connor, who was a good friend of mine, was blowing up. He introduced me to all the mag editors and they were all super gracious in giving me a chance. Ted Newsome at TWS, Aaron Meza at Skateboarder, Eric Stricker at Strength. So I was a book editor, freelance writing for skate mags and buying for the shop all at once.</p>\n<p>Then the shop came back at me with a full time General Manager offer. People were tripping because I’d gotten my foot in the door in publishing in such a short time … but I knew if I went back to the shop and immersed myself in skating fully again, I could focus on the writing more while sitting there all day, and using that as a way to get myself out west. So after 3 years at the shop again, I got a job offer from DC shoes and moved to California. From there, 8 years at Sole Tech. All the while, writing for TransWorld or being staff writer for The Skateboard Mag and doing other stuff on the side. Then I helped launch Ride Channel and with that, <a href=\"https://www.youtube.com/playlist?list=PL3337C303C02B1108\" target=\"_blank\" rel=\"noopener\">Weekend Buzz</a> came along. Soon after was the opportunity to help launch Primitive skate, for a year and a half, which is awesome to see doing well.</p>\n<p>I’m telling you all this because I’ve basically had 2-4 jobs since 1997. I just kept chasing what I loved and working hard and doing what felt right. Kids hit me up all the time asking me how to get there. But to be honest, I rarely see anyone who has the drive and the commitment to do what needs to be done. It takes serious work and sacrifice. Like I said, I don’t remember a ton of it because I was sleep deprived, stressed out and also enjoying the ride. I was out of my mind on a mission to get published or to have my interviews or brands I worked for be the best they could be.</p>\n<p><img class=\"aligncenter size-full wp-image-3063\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-6.jpg\" alt=\"The Hundredth Acre candles by Rob Brink\" width=\"680\" height=\"850\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-6.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_240/mag/uploads/Rob-Brink-6.jpg 240w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>What’s your involvement in the skate industry these days?<br />\n</strong></span>I think I’m “the guy who put enough time in to still be invited.” Hahaha. I’m stoked I’m still allowed to be involved and to be honest, it’s so fun being able to just be a fan, without any allegiance to a certain brand. I can just be a skater again and enjoy video premieres and contests and stuff. But as for involvement, I don’t have any really. Buzz is done after 5 years. I don’t work for any skate brands, instead I have been working for a nutrition brand outside of skateboarding and it’s been going really well. They are called Orgain and I am the director of content and social marketing. They have been great to me and I’m learning a lot.</p>\n<p>My last articles were in Playboy earlier this year. I have sort of stepped back for a reboot and to work on my brand. But I’ll be back soon in some capacity I hope. I always want to write. I want to start a new podcast because I miss Weekend Buzz so much and I still feel there is something missing from skate interviews and shows that I could bring to the table, the way I think they should be done.</p>\n<p><span style=\"color: #ff0000;\"><strong>I read in your interview with <a href=\"http://getbornmagazine.com/featureshome2/rob-brink\" target=\"_blank\" rel=\"noopener\">Get Born</a> that your first ‘foot in the door’ moments in your career were kind of just “random happenings”. Would you say that a lot of your career has evolved like this?<br />\n</strong></span>Random happenings that came from a lot of hard work. Yes. I’d say all I’ve done is a split between luck and then the persistence of chasing something. Like, for example, even recently with Playboy … that was a DREAM mag of mine to write for and NEVER IN A MILLION YEARS would I think it would happen. So much so that I never even tried. But I was job hunting outside the skate industry in 2016, before the Orgain gig happened, and spoke with some random woman on LinkedIn who worked for Playboy to see if they had any digital marketing openings. I just hit her up. I wasn’t even applying to a job. When she saw I was a writer she kind of ignored the digital thing and passed me on to the editor and he asked for pitches. Next thing I know I’m interviewing Dill for Playboy and had <a href=\"http://www.playboy.com/articles/playboy-conversation-brian-anderson\" target=\"_blank\" rel=\"noopener\">Brian Anderson’s first interview</a> after he came out on Vice? Dude, for me, it was fucking nuts. Not long before that I’d also interviewed Gonz, Neil Blender and Tony Alva all for mags outside of skateboarding. I had a 5-year run with Weekend Buzz and interviewed hundreds of skaters and had the best times. That’s why I have chilled out a bit. So much good shit happened that I felt so fulfilled, if that makes any sense? I didn’t need to be chasing every opportunity to do every little skate interview I could, or more talk shows. Like when you have a great meal and it’s the end of the night, you don’t want more food, you know? You are content.</p>\n<p><img class=\"aligncenter size-full wp-image-3056\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-5.jpg\" alt=\"Rob Brink\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-5.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Rob-Brink-5.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Was your transition into candle making a result of random happenings? It seems like a big jump from working in skateboarding.<br />\n</strong></span>It sounds random as hell, I know. But this should put it into perspective. I wanted to start a brand. But the skate world doesn’t need another hardware or griptape or hat or tee shirt brand or even another blog or magazine, you know? Plus I’m the old guy now. Skate brands should be started by the kids or the pros… like Hardies or Dads or WKND or Numbers or FA/Hockey. That shit is sick! I wanted to start something that was a reflection of me. And the other half of me, the non-skate half, is the writer. So the idea was to create a lifestyle brand for writers and bookworms and people like that. A brand I could tie into skating when possible. “Things for Thinkers” is kinda the mantra. <a href=\"https://thehundredthacre.com/\" target=\"_blank\" rel=\"noopener\">The Hundredth Acre</a> is not just a candle brand. I have pens, tees, I am working on journals and tea as well. Just all the things that accompany my journey as a writer, with the aesthetic of libraries and children’s stories and great literature and legendary authors and typewriters and a “writer’s cabin in the woods” vibe.</p>\n<p>But the candles were the first thing and the main thing because they are wildly popular. A growing industry. And I figured out how to make them myself pretty easy. And they are a vehicle to tell stories with every single scent. And when people pick them up and say to me “Oh my God this reminds me of my grandfather I need to have this.” And they start telling me about their grandfather’s pipe smoking and how this pipe tobacco candle smells just like him … I have done so much more than made and sold a product. I have told a story to someone else who has a similar story. We share a story. I brought back amazing memories for them, transported them back in time, whatever … it’s so much more than just a product.</p>\n<p>My other goal was to be as eco-friendly and socially responsible as possible. I use all natural soy wax grown in the USA. My jars are partially recycled and recyclable. My boxes are recycled and recyclable. The bag it comes in is reusable. My oils are phthalate-free and not tested on animals. I hire my friends to make my supplies whenever I can. Skaters make my tees and stickers and shoot my product photography and design my logos. I want to make sure I am supporting the industry I came from. I also donate portions of sales whenever I can to what’s going on in the world, from Standing Rock to World AIDS Day to Hurricane Harvey to the Charlottesville NAACP to multiple LGBTQ charities.</p>\n<p><span style=\"color: #ff0000;\"><strong>Coming from such a macho industry like skateboarding, did you cop any slack when you started making candles? And if so, how did—or do—you deal with those reactions?<br />\n</strong></span>I actually didn’t. My friends always seemed a bit thrown at first, like “Candles? WTF!?” And I explain what I just told you above. And they get it. I get the occasional troll talking shit and gay bashing as if candles aren’t masculine, like you said. But someone like that is too pathetic to “deal with.” Nothing you can do or say is going to hurt them more than they are already hurting. I have a growing candle business I started with my own hands in my kitchen. Even if it fails I’m proud and having a blast. I have an amazing life surrounded by amazing people and the things I love. They can hate me all they want but they’re just mad ‘cuz their gal wants to buy my candles. No, but really, it’s been all love and support.</p>\n<p><img class=\"aligncenter size-full wp-image-3065\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-7.jpg\" alt=\"Rob Brink\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-7.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Rob-Brink-7.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>How did the Kenny Anderson x Converse x Chocolate collab candle come about?<br />\n</strong></span>I’d been bugging Kenny for a Poler connect because they have a really cool store in Laguna Beach where I live and I wanted to pitch the candles to them. He circled back a while later talking about how his new shoe is coming out and he wanted to have something cool and unique for the gift bags at the launch party. I jumped right on it. Then we agreed to make ‘em <a href=\"https://thehundredthacre.com/products/kenny-anderson-x-converse-x-chocolate-skateboards-candle-set\" target=\"_blank\" rel=\"noopener\">available on my site</a> for people who might want access to it as part of his capsule. It’s not an “official” collab with Chocolate and Converse. Like, those two brands aren’t selling it to shops as part of the collab. I don’t want to mislead anyone. But shops can order from me or people can buy them on the TheHundredthAcre.com until they sell out. But it’s just kinda something he allowed me to piggyback on and it’s been super cool I am so appreciative. Kenny is an amazing person for skateboarding, both on and off the board.</p>\n<p><span style=\"color: #ff0000;\"><strong>Was there any specific thought given to the scent of that candle?<br />\n</strong></span>I went to Kenny’s place one day with dozens of fragrances for him to try. Since the theme of his <a href=\"https://skateboarding.transworld.net/gear/converse-cons-x-chocolate-collab/\" target=\"_blank\" rel=\"noopener\">capsule</a> is “plant, grow, pollinate” he wanted it to be sort of “gardening/herbal” themed but not necessarily like fruits and vegetables or produce. So he landed on lavender and citrus blend and a sage leaf blend in glass that matches the white and black colorways of the shoes, and we’ve got the logo on there to match the deck and shoes too.</p>\n<p><span style=\"color: #ff0000;\"><strong>What if you were to do “pro model” candles where skaters have custom scented candles? Who would you want to make one for and what would the scent be?<br />\n</strong></span>If I answer that, it’ll get ripped off so fast. But there are some really good ones that can be done.</p>\n<p><img class=\"aligncenter size-full wp-image-3054\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-3.jpg\" alt=\"The Hundredth Acre candles\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-3.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Rob-Brink-3.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Do you sell many candles to skaters? I mean surely they can appreciate some of their uses—seduction tool in the bedroom, bad smell camouflage in the toilet…<br />\n</strong></span>Haha, yes. More people are into candles than you think. It’s just not something people in our world run around talking about. Lots of pros and industry people hit me up for them or buy them. Especially for their wives and girlfriends. They’ve all been so supportive. But also, I have plenty of skate customers to my web store and to my retailers and at my pop ups. It’s awesome to be able to connect with skaters over my own brand, even if it’s not a skate brand. And it’s awesome to turn people onto quality candles and maybe introduce them to something they wouldn’t have been exposed to yet. You know? Not that people don’t know what a candle is, but letting them know that it’s simply a nice thing to treat yourself to or helping them understand the value of a luxury, all natural candle as opposed to a cheap toxic one from Target.</p>\n<p><span style=\"color: #ff0000;\"><strong>What’s the story behind the name, “The Hundredth Acre”?<br />\n</strong></span>It&#8217;s inspired by Winnie the Pooh’s Hundred Acre Wood—the forest where the characters all played and interacted. And it was an interaction between humans and nature. All different types of friends having fun adventures, creating memories. It’s the type of place you wish you could be in when you are reading or watching Pooh. It just gives you that special feeling. I think we all have a special place like that from some past time in our lives that we reminisce fondly of, or wish we could get back to. For me, it’s the forest behind my grandma’s place in New Jersey. I grew up exploring and playing there. Reading books and observing plants and trees and making forts and learning things and using my imagination. I could sit there for hours on soft beds of fallen leaves and pine needles. With birds and squirrels and insects doing their thing all around me. Smelling all the different smells. Eating wild blueberries. Just existing with nature and feeling safe and feeling that awesome energy you know? When I was about 17 that forest got torn down and made into housing. I was devastated. Some of these things, we can never get back, but we all think about them. We all have our own version of that forest, our own Hundred Acre Wood. I also liked the idea of the notion that “The Hundredth Acre” is the final acre, like you are at the border. Do you want to leave and go back to the real world or do you want to stay in that special place full of imagination and creativity with your friends? My logo almost ended up being a really old school hand made wooden fence to represent that notion, but I went with the spruce tree instead.</p>\n<p><img class=\"aligncenter size-full wp-image-3053\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-2.jpg\" alt=\"The Hundredth Acre candles\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-2.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Rob-Brink-2.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>I’m a huge fan of your writings about skateboarding but my favourite pieces I’ve read from you are <a href=\"https://robbrink.com/category/had-a-dad/\" target=\"_blank\" rel=\"noopener\">the ones you wrote about your late dad</a>. When you’re in the skate industry it’s refreshing to see that sort of raw honesty and emotion. Do you often write personal narratives and if so have they or will they be published?<br />\n</strong></span>Thank you. If someone doesn’t write with raw emotion they might as well not bother. In my opinion, with creative writing (or films or music or any art), the goal is to create a visceral experience that leaves the reader sitting there like they got kicked in the chest … entertained of course, but breathless with their brain spinning out of control. That’s how I feel when I watch a good movie or read a good book. I can’t sleep after. I’m all fucked up from it. I’m inspired and want to create. Stuff like that doesn’t come from anything but raw truth and emotion. You can’t connect with an audience by being vanilla and fake.</p>\n<p>Funny you should ask though. I’m finally doing more of that writing now because I’m back in grad school for another master’s and much of what I’m working on revolves around the loss of my father and the years leading up to it that I spent working at a bagel shop, which kind of became my second (or maybe even surrogate) family. So we’ll see where that goes.</p>\n<p><span style=\"color: #ff0000;\"><strong>What’s next for you? Are you working on anything exciting at the moment that you can tell us about?<br />\n</strong></span>I think a book might come out of what I just mentioned. I don’t know when but it seems like it could be a possibility. Which is really cool. I like to just let things happen so if it does, so be it. If not, I’ll be busy with other stuff.</p>\n<p>Time permitting, I really want to start up a podcast or show to pick up where Buzz left off. But it would be just me so I can create my own vision a bit better, as opposed to a team effort with a lot of elements in the equation and some of the limitations that come with working for a larger media entity.</p>\n<p>And of course, the candles. I would be blown away and the luckiest person ever if The Hundredth Acre got to a place where it could support me and it was my only job. It’s got a long way to go but I’m enjoying the ride.</p>\n<p><span style=\"color: #ff0000;\"><strong>Well I look forward to all of those things. Thanks for taking the time to share your story with us Rob, and for everything you’ve done for skateboarding.</strong></span></p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 16 that shipped with the Halloween <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["interviews","krakbox","krakmag","rob-brink","the-hundredth-acre","the-weekend-buzz"],"featuredImages":[{"file":"Rob-Brink-1.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/Rob-Brink-1.jpg"}],"video":""}