{"id":3404,"date":"2018-11-04T05:57:34","date_gmt":"2018-11-04T13:57:34","slug":"rory-underhill-lifetime-laces","title":"Founders Interview: Rory Underhill of Lifetime Laces","content":"<p><span style=\"color: #ff0000;\"><strong>How did Lifetime Laces come about? Was it one too many broken shoelaces and you couldn&#8217;t bear it anymore?<br />\n</strong></span>I would break laces all the time, always just before getting something I had been trying for hours or midway through filming a line&#8230; As it turned out, the more skaters I met, the more I saw had wrecked laces and when I asked them about it, it pissed them off too! I set out to solve the problem, more than start a business. I did a ton of research into materials and different applications of them, then had a factory make up some samples for me. One of them blew me away and that turned into our first generation &#8216;Original&#8217; lace.</p>\n<p><span style=\"color: #ff0000;\"><strong>We always love to read personal stories so tell us, where do you come from, Rory? When did you start skateboarding? And how?<br />\n</strong></span>I&#8217;m from a small town in the UK called East Grinstead. It&#8217;s not got much going on but it had a pretty basic skatepark. So as a twelve-year-old boy with mostly male friends we all wound up with boards and that was that, down for life from that point.</p>\n<div id=\"attachment_3411\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3411\" class=\"size-full wp-image-3411\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Phil-Batchelor-Kickflip-Fakie-Chris-Dale.jpg\" alt=\"Phil Batchelor, kickflip fakie. Photo: Chris Dale\" width=\"680\" height=\"464\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Phil-Batchelor-Kickflip-Fakie-Chris-Dale.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Lifetime-Phil-Batchelor-Kickflip-Fakie-Chris-Dale.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3411\" class=\"wp-caption-text\">Phil Batchelor, kickflip fakie. Photo: Chris Dale</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Who else is behind Lifetime?<br />\n</strong></span>The homies I skate with have all played a part in it as it developed, getting clips for the cause and helping out with ideas. The main dudes I couldn&#8217;t be doing it without are my business partners Myles Cantello and <a href=\"https://www.youtube.com/watch?v=Ng6m-rXRZOY\" target=\"_blank\" rel=\"noopener\">Phil Batchelor</a>. Funnily enough, these were the older guys that looked out for me when I was a grom. Myles handles the UK shipping and distribution alongside all our video production (plus loads of creative ideas that push things forward). Check out the last videos he made for our <a href=\"https://www.youtube.com/watch?v=Ng6m-rXRZOY\" target=\"_blank\" rel=\"noopener\">Bristol Fix-Up entries</a>. Phil is our team manager and for sure one of the best dudes on the team itself. He&#8217;s got a hardflip that will knock your socks off.</p>\n<p><span style=\"color: #ff0000;\"><strong>Who&#8217;s on the team? How did you meet everyone? Do you want to expand the team right now?<br />\n</strong></span>Apart from Myles and Phil, we have some other killer members on the team. <a href=\"https://www.youtube.com/watch?v=WYV5_4tnNm4\" target=\"_blank\" rel=\"noopener\">Conor Manion</a> is another homie from the local park with a ridiculously deep bag of tricks. That was the initial team and then we added a few others. I noticed <a href=\"https://www.instagram.com/alex.griffiths/?hl=en\" target=\"_blank\" rel=\"noopener\">Alex Griffiths on Instagram</a> a few years ago when he was thirteen, he was shredding vert ramps all over the world and I had learned that vert skaters break laces as much as street skaters, so we got him on to spread the word in the vert world. Then Moose Tarry was a younger generation skater from our local park who grew up and got better than all of us&#8230; that guy is going places for sure. Our newest addition was Matze Wieschermann, a German am skater that reached out to us. Turns out the dude is a clip machine and on some big companies, plus one of the nicest guys I have had the pleasure of dealing with… we didn&#8217;t need any convincing there!</p>\n<p><iframe src=\"https://www.youtube.com/embed/VqCerrO0HAA?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><strong>Which of your riders goes through the most laces?<br />\n</strong></span>Phil for sure, that guy will break a normal lace in about ten minutes of warm up! Luckily ours give him quite a bit longer, but he still gets the most care packages.</p>\n<p><span style=\"color: #ff0000;\"><strong>Did you notice over time any correlation between your skating style and the amount of laces you need?<br />\n</strong></span>The more tre flips and kickflips I do, the more laces I break! It&#8217;s a weird one really&#8230; I thought that all skaters would break laces at about the same rate as me, but some people don’t even scratch them. Different styles I suppose. I now barely ever change my laces despite having access to fresh ones, one pair of our originals usually lasts me through two pairs of shoes.</p>\n<p><span style=\"color: #ff0000;\"><strong>Tell us about the new Formula X laces.<br />\n</strong></span>The two main things we get tons of requests for are flat laces and white laces. Up until recently, there wasn&#8217;t a way of making these using our original formula as they came out weaker. We were working on these issues when Krak asked us if we wanted to be part of their next box, so we went into hyperdrive to make sure we could get something super fresh and new for all the subscribers to see. Lots of agonising research and testing later, we got our 10th sample (The X in Formula X&#8230;) in the mail and it was super tough—we finally cracked it! We could make them in flat or round and in any colour with a huge bonus that they would also be 20x stronger than normal laces—doubling our last lace!</p>\n<div id=\"attachment_3407\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3407\" class=\"size-full wp-image-3407\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Alex-Griffiths-Melon-Justin-Thomas.jpg\" alt=\"Alex Griffiths, melon. Photo: Justin Thomas\" width=\"680\" height=\"510\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Alex-Griffiths-Melon-Justin-Thomas.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Lifetime-Alex-Griffiths-Melon-Justin-Thomas.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3407\" class=\"wp-caption-text\">Alex Griffiths, melon. Photo: Justin Thomas</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Why did you change the formula actually? Where you unhappy with the previous one?<br />\n</strong></span>I&#8217;m still stoked on the strength and quality of our original laces. No other company has been able to match them. They have been running for a while now and we had wanted to do a new product, half so that our loyal customers get their requests met, but also so nobody else can catch up with us!</p>\n<p><span style=\"color: #ff0000;\"><strong>When you say that &#8220;the new laces are 20x stronger than normal laces, a 100% increase in strength from our last line&#8221; how do you come up with these numbers? Do you run special tests? Do you have any sort of &#8220;laces lab test,&#8221; haha? But seriously, how do you test the strength of laces?<br />\n</strong></span>We essentially simulate the motion that&#8217;s going on when your foot scrapes along the griptape. We use a control cotton lace from a skate shoe and all tests are run a minimum of three times per lace to build an average. Basically, we just secure the lace to a surface and repeatedly scrape it with 10cm of fresh griptape &#8211; normally Jessup or Mob as these are pretty harsh straight out the box and this is what your average skater is using. The cotton lace is normally gone after 5–10 hits. Our originals put up the fight for about 100–120 hits, but the new Formula X managed 274 hits on it&#8217;s best test, averaging out at about 250 — so we use 20x just to be safe.</p>\n<p><span style=\"color: #ff0000;\"><strong>I noticed something really interesting on your website: at some point, you say that stronger laces will increase the lifetime of your shoe directly. Could you explain this a bit more?<br />\n</strong></span>This was a total &#8216;happy accident&#8217; that we discovered down the line. If you have your laces tied in a bow, then the loop hangs over the side of the shoe, conveniently getting between your foot and the board when you flip it. All that nasty power from the griptape gets soaked up by the lace instead of your shoe. I didn&#8217;t think it would have that much an effect until my shoes were still looking pretty good after a month of skating—something that would normally leave them tattered and holey.</p>\n<p><span style=\"color: #ff0000;\"><strong>Have you talked to shoe companies to sell your laces directly to them?<br />\n</strong></span>We tried to get our foot in the door with a few of them but what we ended up finding out was of all the components that go together to make a shoe, the company places the shoelace at the bottom of the budget, most of the time spending no more than 10 cents on each one, so as you can imagine they didn&#8217;t take to the idea. Plus I think that skate shoe companies have quite a lot of planned obsolescence built in to keep people buying shoes, if you make a shoe that lasts twice as long, you get half the revenue as nobody is buying that second pair they normally would. We&#8217;re still open to it! If one of the Van Doren&#8217;s is reading this right now, hit me up, I&#8217;ll give you a great price.</p>\n<p><span style=\"color: #ff0000;\"><strong>Is there in fact a brand that gives and/or makes better laces than the others?<br />\n</strong></span>I think Nike tried some special laces and the Janoski&#8217;s had leather ones to start with, but I don&#8217;t think that led anywhere for them and they returned to cotton/synthetic laces. Supra ran a range called TUF for a little while that was supposed to have tougher materials, but I don&#8217;t think that became a big seller for them either.</p>\n<div id=\"attachment_3410\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3410\" class=\"size-full wp-image-3410\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Phil-Batchelor-Hardflip-over-Conor-James-Griffiths.jpg\" alt=\"Phil Batchelor, hardflip over Conor. Photo: James Griffiths\" width=\"680\" height=\"1020\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Phil-Batchelor-Hardflip-over-Conor-James-Griffiths.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_200/mag/uploads/Lifetime-Phil-Batchelor-Hardflip-over-Conor-James-Griffiths.jpg 200w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3410\" class=\"wp-caption-text\">Phil Batchelor, hardflip over Conor. Photo: James Griffiths</p></div>\n<p><span style=\"color: #ff0000;\"><strong>You mentioned in an email that you went greener with the packaging too. Was it important to you? Why?<br />\n</strong></span>I try to be a pretty eco person. Our last packaging was a resealable plastic bag which was designed for re-use (the second greenest method of production) for storing skate bits etc. but as it turned out most people just chucked it in the bin right away. Not good. This time I accepted that most people don&#8217;t care too much about what happens to their waste and tried to plan for that. The new box is made from 100% recycled card and even if people don&#8217;t recycle it, it will degrade fairly harmlessly in a landfill.</p>\n<p><span style=\"color: #ff0000;\"><strong>What&#8217;s in your mind for the future? Are you aiming for stronger and stronger laces all the time or do you want to expand to other products at some point?<br />\n</strong></span>We looked into using our materials to make super tough skate clothing, but it&#8217;s crazy expensive to do. I just want to keep an ear to the ground and see what our customers are asking for, so this is speaking directly to you KrakBox subscribers—If you try the laces and they are missing something you want, or you think you have a good idea, shoot us a message from <a href=\"https://www.lifetimelaces.com/\" target=\"_blank\" rel=\"noopener\">our website</a> or via <a href=\"https://instagram.com/lifetimelaces\" target=\"_blank\" rel=\"noopener\">our Insta</a>. We read them all and if enough people ask, we will do it. Who knows what the future holds.</p>\n<div id=\"attachment_3409\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3409\" class=\"size-full wp-image-3409\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Moose-Tarry-Back-Tail-Matej-Kardelis.jpg\" alt=\"Moose Tarry, back tail. Photo: Matej Kardelis\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Moose-Tarry-Back-Tail-Matej-Kardelis.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Lifetime-Moose-Tarry-Back-Tail-Matej-Kardelis.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3409\" class=\"wp-caption-text\">Moose Tarry, back tail. Photo: Matej Kardelis</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Is there any pro (in skate history) who had a special/weird relationship with their laces? Like changing them few times a day or having different colors on each foot or anything else&#8230;<br />\n</strong></span>Not a pro, but there was a dude at our local park that would wrap duct-tape around the whole lace part of his shoe so they wouldn&#8217;t break. You know we gave that guy some laces haha!</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you wear your laces as a belt too? Do you recommend it, haha?<br />\n</strong></span>Oh for sure! I have so many goddamn laces and samples in my house it&#8217;s ridiculous. Naturally they get used everywhere they can. Plus when you see someone with a lace belt you know they are a skater and can give them a nod. Part of that big family we&#8217;re all in with our scuffed shoes and scarred elbows.</p>\n<div id=\"attachment_3408\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3408\" class=\"size-full wp-image-3408\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Matze-Wieschermann-Kickflip-Faby-Reichenbach.jpg\" alt=\"Matze Wieschermann, kickflip. Photo: Faby Reichenbach\" width=\"680\" height=\"452\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Matze-Wieschermann-Kickflip-Faby-Reichenbach.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Lifetime-Matze-Wieschermann-Kickflip-Faby-Reichenbach.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3408\" class=\"wp-caption-text\">Matze Wieschermann, kickflip. Photo: Faby Reichenbach</p></div>\n","author":"kev","categories":["interviews"],"tags":["interview","krakbox","krakmag","lifetime-laces","rory-underhill"],"featuredImages":[{"file":"Lifetime-Rory-Underhill-Overcrook-Tom-Sparey.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/Lifetime-Rory-Underhill-Overcrook-Tom-Sparey.jpg"}],"video":""}