{"id":3096,"date":"2018-03-04T22:49:24","date_gmt":"2018-03-05T06:49:24","slug":"shoe-goo","title":"Fixing your skate shoes with Shoe Goo","content":"<p>If you’re still repairing your worn out skate shoes with duct tape then please come out from under your rock so we can introduce you to Shoe Goo.</p>\n<p>There are only so many ollies and kickflips you can do before the side of your shoe starts to wear thin and an otherwise perfectly good pair of shoes appear to be destined for the trash.</p>\n<p>This is where Shoe Goo comes in.</p>\n<p>It was <a href=\"https://en.wikipedia.org/wiki/Shoe_Goo\" target=\"_blank\" rel=\"noopener\">first invented in 1972</a> for tennis players but skaters later caught on. Shoe Goo is an epoxy adhesive that dries strong but flexible, making it ideal for repairing the sides and soles of skate shoes.</p>\n<p>So next time your favourite pair of shoes start falling apart you can save your <a href=\"https://www.youtube.com/watch?v=XfCa3wn37mU\" target=\"_blank\" rel=\"noopener\">MacGyver methods</a> and go straight for the Shoe Goo instead.</p>\n<p><img class=\"aligncenter wp-image-3099\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/shoe-goo.jpg\" alt=\"Shoe Goo\" width=\"300\" height=\"557\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/shoe-goo.jpg 350w, https://res.cloudinary.com/krak/image/upload/w_162/mag/uploads/shoe-goo.jpg 162w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p><strong>How to fix your skate shoes with Shoe Goo</strong></p>\n<ol>\n<li>First, make sure the area that you are going to fix is clean and dry.</li>\n<li>If you&#8217;re repairing a hole, put a piece of duct tape of the inside so the Goo doesn&#8217;t form a bump on the inside of your shoe (make sure you remove the tape within 2 hours or it will become a permanent fixture!)</li>\n<li>Squeeze some Shoe Goo onto the area you&#8217;re fixing.</li>\n<li>If you&#8217;re repairing a tear, apply to each side and then wait 2 minutes for the Goo to slightly cure before bringing them together.</li>\n<li>Use an ice cube to smooth out the Shoe Goo (it won&#8217;t stick to ice!)</li>\n<li>If you want to build up a thick area of Goo then you should apply it in layers and build it up slowly. Wait a couple of hours between layers so that the final product doesn&#8217;t take forever to dry.</li>\n<li>When you&#8217;re done, wait at least 24 hours before using your shoes. Maximum strength may not be reached for  2–3 days.</li>\n<li>For future easy cap removal, apply a thin coat of petroleum jelly to the threads of the tube before replacing the cap.</li>\n</ol>\n<h3><span style=\"color: #808080;\"><strong>Shoe Goo was included in the Xmas <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["box"],"tags":["krakbox","krakmag","shoe-goo"],"featuredImages":[{"file":"Krak-Shoe-Goo-LR.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/Krak-Shoe-Goo-LR.jpg"}],"video":""}