{"id":2590,"date":"2017-10-16T08:23:58","date_gmt":"2017-10-16T15:23:58","slug":"skrap-chris-anderson","title":"Founder&#8217;s Interview: SKRAP&#8217;s Chris Anderson","content":"<h3><span style=\"color: #808080;\"><strong>The following interview was originally featured in the printed KrakMag issue 14 that shipped with the July 2017 <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n<p><span style=\"color: #ff0000;\"><strong> Could you introduce yourself briefly?<br />\n</strong></span>Sure thing, my name’s Chris Anderson and I’m the owner of <a href=\"https://skrap.co/\" target=\"_blank\" rel=\"noopener\">SKRAP</a>. I live in Ottawa Ontario Canada with my wife and 4 year old daughter. Love to be in nature, camping on a river and paddling white water rapids in the summer or having some fun skiing and snowboarding in our Canadian winters!</p>\n<p><span style=\"color: #ff0000;\"><strong>What is Skrap? How was it born? I heard this deck recycling thing came up during a trip with your wife in beautiful Nova Scotia; tell us more about it!<br />\n</strong></span>This all started when I was on a little vacation years ago, found a great little skate shop that was selling rings made from recycled skateboards. I thought this was such a cool idea from an artist perspective as well as environmentally. I love the idea of reusing something that would otherwise end up in a landfill. So when I got home I decided to see if I could make one, and I did. At the time I was a front-end web developer and an idea to build an online marketplace specifically for artist creating their work from recycled skateboards became all I could think about and I started trying to build one. In the end it proved to be way too much work for just me around all the rest of the things in life, but what came out of it was a lot of notice and I was introduced to a few very important people including Kevin Harris from <a href=\"http://www.ultimatedistro.com/\" target=\"_blank\" rel=\"noopener\">Ultimate Distribution</a> and Bones Brigade. After many discussion with Kevin along with many other very helpful folks I was persuaded to see if instead of a marketplace could we come up with a recycled skateboard brand that could see top quality products to a large North American market. This is where SKRAP was born! We spent the next couple years sourcing broken/recycled skateboard decks in volume and creating the best products that we could all created here in North America!</p>\n<p><img class=\"alignleft wp-image-2593\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-wallet.jpg\" alt=\"SKRAP wallet\" width=\"320\" height=\"320\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-wallet.jpg 330w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/skrap-wallet.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/skrap-wallet.jpg 300w\" sizes=\"(max-width: 320px) 100vw, 320px\" /></p>\n<p><img class=\"alignleft wp-image-2591\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-process.jpg\" alt=\"\" width=\"320\" height=\"320\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-process.jpg 330w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/skrap-process.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/skrap-process.jpg 300w\" sizes=\"(max-width: 320px) 100vw, 320px\" /></p>\n<p><strong><span style=\"color: #ff0000;\">Who else works on Skrap?<br />\n</span></strong>I have a great team here in Ottawa!</p>\n<p><span style=\"color: #ff0000;\"><strong>Where do you collect the damaged boards from?<br />\n</strong></span>We create products out of skateboards as well as snowboards and have partnered with local skate shops, distribution companies, ski hills (like Banff, Fernie etc.) and manufacturers across the US and Canada.</p>\n<p><span style=\"color: #ff0000;\"><strong>What products do you make today?<br />\n</strong></span>Our top selling products are our <a href=\"https://skrap.co/product-category/sunglasses/\" target=\"_blank\" rel=\"noopener\">skateboard sunglasses</a> and our <a href=\"https://skrap.co/product-category/wallets/\" target=\"_blank\" rel=\"noopener\">snowboard wallets</a>! We also make coasters, keychains, bottle openers, cufflinks, belts, rings and earrings! We also have an amazingly exciting new product coming in August but I can’t reveal it just yet, so stay tuned!</p>\n<p><span style=\"color: #ff0000;\"><strong>What’s the process?<br />\n</strong></span>Collecting the material (skateboards and snowboards) is a large part of the process, the next step is to degrip the skateboards. After that we have a CNC machine as well as laser engraving machines to cut and brand our products. The biggest step to finishing any of our products is the sanding! There’s just no way around it, there is a tonne of sanding 🙂</p>\n<p><span style=\"color: #ff0000;\"><strong>Could you share a picture of what your workshop looks like? We’re damn curious!</strong></span></p>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-workshop.jpg\"><img class=\"alignnone wp-image-2594 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-workshop.jpg\" alt=\"SKRAP workshop\" width=\"680\" height=\"383\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-workshop.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/skrap-workshop.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>What’s the craziest creation you’ve made out of a skateboard?<br />\n</strong></span>Again, coming in August but I can’t reveal it just yet, so stay tuned! 🙂</p>\n<p><strong><span style=\"color: #ff0000;\">That coffee table was insanely cool! Was it yours?<br />\n</span></strong>No, amazing though isn’t it! This was created by another great Canadian shop called adrianmartinus, check them out on <a href=\"https://www.instagram.com/adrianmartinus/?hl=en\" target=\"_blank\" rel=\"noopener\">Instagram</a>.</p>\n<p><span style=\"color: #ff0000;\"><strong>What has been your biggest challenge since you started?<br />\n</strong></span>Our goal was always a lofty one. We wanted to build a brand that could be sold around the world but always staying true to the original goal of using 100% recycled/used or broken skateboards and snowboards. This is a huge challenge, but so rewarding. Of course it would be much easier to have products created overseas that might claim ‘reclaimed’ but in reality they are just taking good skateboard veneer or boards off the line and turning them straight into a new product. So long story short, our biggest challenge is creating strong relationships with great people and businesses that will help build our recycle program with their old boards.</p>\n<p><span style=\"color: #ff0000;\"><strong>The most exciting moment/The proud moment?<br />\n</strong></span>Every time you create something new! Every piece is unique and that makes it a constant joy.</p>\n<p><span style=\"color: #ff0000;\"><strong>What are the things you enjoy most in life?<br />\n</strong></span>Being with my family in the bush. Just finding time to get into the woods and get away from everything is so important for me.</p>\n<p><span style=\"color: #ff0000;\"><strong>What are your ambitions for SKRAP?<br />\n</strong></span>We hope to keep building our recycle programs and perfecting our line of products as we grow.</p>\n<p><strong><span style=\"color: #ff0000;\">What can we wish you?<br />\n</span></strong>Fun it the sun this summer! 😉</p>\n<h3><span style=\"color: #808080;\"><strong>Liked this interview? Check out the print KrakMag in each <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a></strong><strong> for more great content</strong><strong>!</strong></span></h3>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n","author":"kev","categories":["interviews"],"tags":["krak-mag","krakbox","recycled-skateboards","skrap"],"featuredImages":[{"file":"skrap-sunglasses.jpg","width":680,"height":454,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/skrap-sunglasses.jpg"}],"video":""}