{"id":1991,"date":"2015-09-21T07:30:52","date_gmt":"2015-09-21T14:30:52","slug":"youngblood-alexander-loren","title":"Youngblood: Alexander Loren","content":"<h3><span style=\"color: #999999;\"><strong>The following interview was originally featured in the print Krak Mag issue 2 that shipped with </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>#2 in June 2015. Don&#8217;t want to miss the next issue of the print Krak Mag? Want to receive some epic skateboarding product every two months? Check out the </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>now!<em><br />\n</em></strong></span></h3>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1996\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/AlexanderLoren_Youngblood.png\" alt=\"AlexanderLoren_Youngblood\" width=\"300\" height=\"200\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/AlexanderLoren_Youngblood.png 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/AlexanderLoren_Youngblood.png 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/AlexanderLoren_Youngblood.png 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/AlexanderLoren_Youngblood.png 1160w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><em>Tall 50-50 in Santa Barbara. Photo: Will Fisher (<a href=\"https://instagram.com/willfisherphoto/\" target=\"_blank\">@willfisherphoto</a>)</em></p>\n<h3><i>One of the best things about skateboarding is meeting the coolest, chillest people who share your love for riding this little four-wheeled plank of wood. You might speak different languages, but as long as you skate, you can always relate. Alexander has always been super friendly and hella nice, quick to come up to you to say what up, and ever ready to give anyone a high five. Alexander also definitely rips, he’s an ATV that skates everything amazingly, from ledges, tall-ass rails, stairs and gaps to flatground. Generous, well spoken and with a really positive attitude and thankful for everything, he’s the kind of person you’d want to kick it with both on and off the board. He has a pretty interesting story too, coming to the US from Sweden, and having attended Malmo’s Bryggeriets Gynmansium. He tells us about growing up in Sweden, skateboarding through cold winters, and finally moving to Los Angeles. This is a good one! &#8211; HK</i></h3>\n<p><span style=\"color: #ff0000;\"><b>What up Alexander, thanks for doing this. First up, tell us a little bit about yourself?</b></span></p>\n<p>Thank you man! I’m Alexander Loren and I’m from Sweden, south Sweden actually, a small town called Kristianstad, it’s 1 hour outside of Malmo. I just turned 20. And I moved here in August last year and I’ve just been skating and going to school at Santa Monica College. I got to know so many people here and I’m just enjoying my LA trip.</p>\n<p><span style=\"color: #ff0000;\"><b>What’s it like over there in Kristianstad? What’s the skate scene like?</b></span></p>\n<p>It’s not like here of course but it’s actually getting really big, like last year. It’s getting really big. Especially Malmo, because it has a really good skate scene. I don’t know if you’ve heard about Ultrabowl and Vert Attack.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah those are big contests! Pros from all over would go, like Pedro Barros, all the guys like Rune Glifberg and all the big names would be there.</b></span></p>\n<p>Legends too! Tony Hawk was at Vert Attack.</p>\n<p><span style=\"color: #ff0000;\"><b>Stevie Cab?</b></span></p>\n<p>Yeah Stevie Cab, Hosoi, they were all there.</p>\n<p><span style=\"color: #ff0000;\"><b>So how many skaters are there in your hometown?</b></span></p>\n<p>How many skaters? Like where I’m from? In my small city, it’s not many at all. It’s like me and my crew and maybe some more that skate, but it’s not many at all, because we don’t really have anywhere… Actually last summer we got our first skatepark, an outdoor skatepark.</p>\n<p><span style=\"color: #ff0000;\"><b>You guys didn’t have anything before that?</b></span></p>\n<p>I just skated the streets and DIY spots before that. And the funny thing is, in the winter it’d get super cold. Sometimes it gets snowy and rainy, zero degrees, even colder than zero degrees. We had this indoor park but it’s got no heat. It’s the same cold on the outside as the inside. I don’t understand how I grew up like this. I went back this winter after I’d been here for half a year, and I went, wow, I can’t even skate in here anymore.</p>\n<p><span style=\"color: #ff0000;\"><b>But you don’t even skate much in the wintertime because it’s so damn cold right?</b></span></p>\n<p>But my whole life I did. I just put on gloves, actually the warm up was running in the park for 15 minutes. 10-15 minutes just running and after you’ve warmed up you just have to skate non-stop because if you sit down, you got stiff. Your body cools down immediately, your fingers can’t even text because it’s so cold. Crazy, I don’t even understand how I did that my whole life.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1995\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/IMG_5303.jpg\" alt=\"IMG_5303\" width=\"300\" height=\"225\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/IMG_5303.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/IMG_5303.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/IMG_5303.jpg 1080w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><b>Damn, that’s definitely dedication dude.</b></span></p>\n<p>Yeah, every day after school I went there, even when it was super cold.</p>\n<p><span style=\"color: #ff0000;\"><b>So if it’s just you and your crew, it’s a really small scene, and you basically know everyone in your hometown that skates?</b></span></p>\n<p>Yeah, we knew everyone that skates. But the cool thing is that our city is not that far from Malmo, and I always go there, it’s just an hour away by train. That’s where I went to school too, Bryggeriets Gymnasium.</p>\n<p><b><span style=\"color: #ff0000;\">I</span> <span style=\"color: #ff0000;\">was actually going to ask you about that, you went to Bryggeriets? That’s a skater’s dream school! When I heard about it, I saw a documentary about it on the Berrics…</span></b></p>\n<p>I had a trick in it too.</p>\n<p><span style=\"color: #ff0000;\"><b>You had a trick in it?</b></span></p>\n<p>I did a nollie flip down this four block, this four stair block.</p>\n<p><span style=\"color: #ff0000;\"><b>Wait, that was you? They didn’t put your name up did they?</b></span></p>\n<p>Yeah, they did.</p>\n<p><span style=\"color: #ff0000;\"><b>Alright I watched it some time ago, I need to re-watch it again.</b></span></p>\n<p>(laughs) That’s two long episodes, you probably don’t remember, there’s a lot of tricks in it.</p>\n<p><span style=\"color: #ff0000;\"><b>I met Fernando Bramsmark when he was out here.</b></span></p>\n<p>Yeah he’s my homie.</p>\n<p><span style=\"color: #ff0000;\"><b>He skates really good. Transition? Shit. He’s ridiculous.</b></span></p>\n<p>He’s the best, dude! He’s such a cool dude too.</p>\n<p><span style=\"color: #ff0000;\"><b>Oskar “Oski” Rozenberg (Hallberg) is your homie too right?</b></span></p>\n<p>Yeah yeah. They’re all my homies, we went to the same school. Everyone.</p>\n<p><span style=\"color: #ff0000;\"><b>Everyone went to Bryggeriets?</b></span></p>\n<p>Oski actually just graduated this year, this summer. Yeah and Fernando is like 2 years older than me.</p>\n<p><span style=\"color: #ff0000;\"><b>Wow dude, you guys all kill it, I’ve seen footage of you guys skating. Tranny skills are so good, street skills are so good, that place must be crazy to go to school. Ok, I’ll ask you a little bit more about that later. So how did you even start skating while living in a small city like Kristianstad?</b></span></p>\n<p>It’s actually my brother who got me into skating, my older brother, he still skates, not so much anymore but he’s been skateboarding his whole life you know?</p>\n<p><span style=\"color: #ff0000;\"><b>Daniel?</b></span></p>\n<p>Yeah, my brother Daniel. And I remember I was super small and he tried to get me into skateboarding but I was like, it’s boring, I want to hang out with my friends, I wanna be cool with my friends and hang out in the street. And then one Christmas, I got a board for my Christmas present.</p>\n<p><span style=\"color: #ff0000;\"><b>Did your brother give you the board?</b></span></p>\n<p>Yeah<b>, i</b>t was a Santa Cruz. I don’t remember what pro model it was, all I remember is that it had a face on it, like Halloween. It was kinda like a face with a little bit of blood.</p>\n<p><span style=\"color: #ff0000;\"><b>Is there a legendary spot in your hometown that you all skated?</b></span></p>\n<p>Legendary spot? They actually took the roof out, there’s no more roof. It’s an old train station, an abandoned train station and all the homies that used to skate before built their own stuff like ledges, banks, kickers, flatbars. They put everything there, so it’s just like a skatepark kind of. But then after the company next door bought the land and wanted to do something else and they just took the roof off so we couldn’t skate when it was raining anymore. They took all the obstacles off. After a while, they actually went out of business, and they left everything like that.</p>\n<p><span style=\"color: #ff0000;\"><b>That sucks. You guys basically built the spot and then they took it away.</b></span></p>\n<p>One concrete ledge though, that’ll never be gone. It’s too heavy to move. My brother and his homies built it, like way back. So that’ll always be there. And that’s one of my favorite ledges too.</p>\n<p><span style=\"color: #ff0000;\"><b>And you just got your first outdoor skatepark last summer? Wow.</b></span></p>\n<p>It’s actually not like a normal park, they wanted to do like a street plaza. So it’s for skating but they want it to look like a spot. So it doesn’t have metal ledges, it’s got real street ledges like JKwon.</p>\n<p><span style=\"color: #ff0000;\"><b>I remember seeing some footage of one spot in Malmo with so many ledges that looked so perfect that you’d think they designed it for skateboarding. But it’s not?</b></span></p>\n<p>They call it Riverside. It’s literally 30 ledges, 30 manny pads you can skate in a row. It’s just like skatepark concrete, everything. You can say it’s a skatepark, but sometimes there’s stuff going on, and you can’t skate all the time, but most of the time you can.</p>\n<p><span style=\"color: #ff0000;\"><b>So when you went to Bryggeriets? It’s got a full high school curriculum but with an emphasis on skateboarding. It’s basically a sports school. How did you convince your parents to let you move to Malmo to go to Bryggeriets? It’s got great academics as well, the curriculum is first class.</b></span></p>\n<p>I know exactly what you mean, it took me a while to convince them. I had to ask them a lot. They didn’t want to let me go there at first. I was like, I don’t know what I want to do you know? I don’t even know what I want to study so I just want to study there. All my friends were about to go there too and Malmo is a bigger city. I’m from a really small city and that’s so boring you know.</p>\n<p><span style=\"color: #ff0000;\"><b>What’s the population in your city?</b></span></p>\n<p>Like 70,000. Like the whole county you know. For the actual city center, I don’t even know, half of that? It’s really small. So I had to convince my parents, but they were cool. They were like, yeah alright, you can go there.</p>\n<p><span style=\"color: #ff0000;\"><b>It’s not what a lot of people expect because when I watched the Bryggeriets documentary, I thought to myself, if I were a teacher and if I could teach somewhere, I want to teach somewhere like that, so that I could be close to skateboarding.</b></span></p>\n<p>That’s exactly what I was thinking when I got here. I’m going to Santa Monica College, why not you know? Make a change in my life, I’ve been in Sweden my whole life and in the same part so why not try something new. And yeah, I’m kind of focused on school, I still want to get my degree. I want to finish school but at the same time I wanna skate too. Like as much as I can.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1994\" src=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/IMG_5293.jpg\" alt=\"IMG_5293\" width=\"225\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/IMG_5293.jpg 225w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/IMG_5293.jpg 768w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/IMG_5293.jpg 1080w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><b>How about in LA? What’s your favorite spot to skate?</b></span></p>\n<p>Favorite spot? LA has so many good spots, it’s crazy. Like street spots or park?</p>\n<p><span style=\"color: #ff0000;\"><b>Both, what’s your favorite park and what’s your favorite street spot?</b></span></p>\n<p>That’s a hard one. It’s hard to say one but I like Stoner a lot, because it’s my local park, the good homies are always there, a good vibe. And the Berrics is always a fun time. I like skating Westchester at night too. Just have a fun session at night, I never really go there in the day though.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah me neither, that’s why I always see you there on those night sessions.</b></span></p>\n<p>I don’t know why but, it’s always at night. I have a good sesh and just wherever you go, whenever you stack some footy you have a good time, it’s a good spot. You have good memories of that spot. So I’m always hyped to go everywhere.</p>\n<p><span style=\"color: #ff0000;\"><b>Which part of LA are you living in?</b></span></p>\n<p>Santa Monica.</p>\n<p><span style=\"color: #ff0000;\"><b>You like living out here in LA?</b></span></p>\n<p>Yeah I’ve been around the whole city but I kind of like this part the best. Santa Monica, the West LA area. Everything because it’s kind of mellow here, it’s not that stressful. The beach, it’s close to everywhere.</p>\n<p><span style=\"color: #ff0000;\"><b>From what I’ve heard, in Sweden it’s cold all winter. But on the East Coast, it can warm up and then get cold all over again.</b></span></p>\n<p>Actually, where I’m from it’s like kind of the same. Sometimes it’s hotter, sometimes it’s colder, when you go to the north of Sweden, it’ll be like snow up till like May. You know? That’s like very cold all year, unless the summer comes. Summer’s really nice out in Sweden though, that’s what I’m really looking forward to going home to right now.</p>\n<p><span style=\"color: #ff0000;\"><b>Is that the best time of the year for you?</b></span></p>\n<p>Yeah, like from June, July and August is the best. If you want to go to Sweden it’s the best. And don’t go there if it’s not during that time.</p>\n<p><b><span style=\"color: #ff0000;\">In Sweden, who’s in your crew? Your brother back in the day</span>?</b></p>\n<p>My brother’s always been older, so I never really skated with him. Sometimes when I was out shooting, I went with his crew. We never really like… He’s been living out here, he’s been living out in Barcelona, I’ve been living in Sweden. So it’s been like we haven’t been able to be with each other that much. But my crew, there’s some homies I went to the same school with as well. Bryggeriets, we all went to the same class. My roomie that lives here too, Mo.</p>\n<p><span style=\"color: #ff0000;\"><b>He moved out here with you?</b></span></p>\n<p>Yeah that’s my homie Mo. He’s called Alexander (Hedeya) but we call him Mo. Yeah, and we live together too. He’s from my hometown too, I skated with him my whole life. My homie called Billy that films, he filmed like all my footage back in Sweden and like yeah, a couple more homies. It was always different you know. Sometimes it was people from Malmo.</p>\n<p><span style=\"color: #ff0000;\"><b>And Mo went to Bryggeriets too?</b></span></p>\n<p>Yeah, same class. So we’re kind of like a family, it’s me, him, my brother, and my brother’s girlfriend. And I’m so hyped to live with them. Rather than living with random, crazy people you know? Sometimes you have bad luck.</p>\n<p><span style=\"color: #ff0000;\"><b>It must be nice when you move out here and have your “family” here too?</b></span></p>\n<p>Exactly. I’ve been to LA a couple of times before moving here so I knew what I was coming to.</p>\n<p><span style=\"color: #ff0000;\"><b>Which is the best city in Sweden to skate? We don’t know too much about the scene out there.</b></span></p>\n<p>I don’t know, it’s either the cities like Malmo or it’s Stockholm. It’s different types of skating because Malmo is more like, you know Polar, Pontus, that type of style. It’s a lot of DIY spots, like Pontus’ spot, which is really sick. Like harder type spots, it’s harder to skate but it’s sick on the footy.</p>\n<p><span style=\"color: #ff0000;\"><b>They have that spot right by the railway line, TBS?</b></span></p>\n<p>Yeah yeah, TBS!</p>\n<p><span style=\"color: #ff0000;\"><b>That spot looks so hard to skate man!</b></span></p>\n<p>Yeah, I’ve been there a couple of times, it’s really hard to skate. Like all the guys are wallriding over and ollieing over, respect to them. So hard!</p>\n<p><span style=\"color: #ff0000;\"><b>Are there a lot of brands out there? Board brands? Obviously we only tend to know the ones that make it out here to the States, the one’s like Polar.</b></span></p>\n<p>Yeah, there are a lot of brands and everyone is trying to get their new brand. Like the biggest Swedish brands are like Polar of course, that’s really big in the whole world. It used to be Sweet. You know about Sweet skateboards?</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah, of course I do. What happened to Sweet? It’s kind of low key right now.</b></span></p>\n<p>I don’t know what happened, they changed the name or like changed the whole thing to Sour now. So it’s Sour Skateboards.</p>\n<p><span style=\"color: #ff0000;\"><b>Who’s your favorite skater?</b></span></p>\n<p>That’s a hard one. Since I grew up, I always, as a little kid I always liked P-Rod. I always looked up to him, his clips. I like Koston too. They were like my childhood heroes you know? And now lately it’s hard, there are so many good skaters.</p>\n<p><span style=\"color: #ff0000;\"><b>Have you skated with P-Rod?</b></span></p>\n<p>I skated his park a couple of times, but I’ve never seen him there. Yeah, he’s pretty busy I think. He’s always travelling and stuff.  But yeah, now I don’t know, there’s so many good ones. I really like Luan.</p>\n<p><span style=\"color: #ff0000;\"><b>Luan? Dude skates with so much power.</b></span></p>\n<p>Yeah, and respect for Nyjah too. He’s a boss.</p>\n<p><span style=\"color: #ff0000;\"><b>Super consistent.</b></span></p>\n<p>No one skates like that. His mentality too, I don’t understand how you can just go with the mindset to win everything. Like it’s pressure too, sometimes you win, sometimes you don’t. But he’s just taking everything. I was like wow, that’s a different level of skateboarding. Now I have a lot of respect for that, that’s crazy.</p>\n<p><span style=\"color: #ff0000;\"><b>Favorite video part?</b></span></p>\n<p>I think I got to say P-Rod in the City Stars video, Street Cinema. That’s an oldie and goldie dude. I feel like lately, the parts they put up I don’t know, it’s like different quality and stuff. It’s not VX anymore, it’s HD. It’s still really sick but I grew up with the old stuff. I can’t really say the old stuff because I’m pretty young but the older, it’s always each generation, I’m hyped on my generation as I grew up. And that’s always gonna be the case for sure.</p>\n<p><span style=\"color: #ff0000;\"><b>Did you see the remake of P-Rod’s video part? He re-filmed all his tricks from Street Cinema.</b></span></p>\n<p>Yeah, that was sick. I really loved that Street Cinema part, because he was so young. I love the song too, because I don’t know if you know that Guy Mariano used that same song when he was a little kid, and then P-Rod used it too. Because they are both my favorite skaters. Wonder child.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah of course, that Jackson 5 song was in Guy’s Blind Video Days part. Do you have a favorite Swedish skater?</b></span></p>\n<p>I always liked Josef Scott, you know about this guy? There’s so many good skaters in Sweden. Josef, I like Albert Nyberg, Erik J Petterson, Pontus is sick. I like Oski, Nando too. And my homie, I don’t know if you know him, David Jakinda? He’s from Stockholm and he won the Swedish skater of the year. And that’s like my homie from years back. And I’m hyped for him you know. Making moves and stuff. He’s one of my favorite skaters too. Like a super cool guy, always having fun and his style is so sick. He’s a really good homie.</p>\n<p><span style=\"color: #ff0000;\"><b>How long were you at Bryggeriets?</b></span></p>\n<p>It’s a 3 year high school. I don’t know about the rest of the world, but in Sweden we go to high school for 3 years. And we don’t really call it high school, we call it, Gymnasium.</p>\n<p><span style=\"color: #ff0000;\"><b>It’s like the European system, Germany has the same thing right?</b></span></p>\n<p>And we went there for 3 years and it’s still like a regular school, we have Math and English classes but instead of gymnastics and stuff we had like skateboarding instead. We had gymnastics too but we had skateboarding twice a week. So it was two skateboarding classes a week.</p>\n<p><span style=\"color: #ff0000;\"><b>How long would each class be?</b></span></p>\n<p>Yeah, two-and-a-half hours, something like that.</p>\n<p><span style=\"color: #ff0000;\"><b>Five hours a week of classes in skateboarding? That’s incredible.</b></span></p>\n<p>That was super fun, and the skatepark, indoor park is in the same building as the school. So like every break, you can just go down and skate. And yeah like you can skate it whenever it’s not class time and then like after school’s done, it’s like a park for everyone. So everyone can go there and skate. And the students get free entry for three years. So I was hyped on that, I saved a lot of money from that.</p>\n<p><span style=\"color: #ff0000;\"><b>So coming back to the skateboarding questions, what’s your favorite trick?</b></span></p>\n<p>I don’t know… like on rails, I think my favorite trick is 50-50 on round rails. I could do that for days. 50-50s, long pop in pop out, the whole thing you know. It’s always fun because it always feels good especially when you wax it too. Otherwise, I do treflips a lot in my life. I can do it so many different ways, I just love messing around with it. I think it’s fun. But yeah, like I don’t really have one special trick I always do, I always try to skate ledges, skate rails, skate flatground.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah, that’s one thing I noticed. When you skate you don’t do just one single trick, you try and vary it up. And you skate everything. That one day I saw you trying back smith 180 out on the C-ledge, and I thought, wow, you’ve got pretty sick back smiths.</b></span></p>\n<p>Yeah I was trying back smith backside flip out for 3 days. I remember trying it again and again, I finally got it though.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah. How did you get so good at skating rails? You skate the JKwon rail, which isn’t even that long, which makes it harder and it’s kind of narrow, it’s not round. It’s a thin, flat rail.</b></span></p>\n<p>Super thin. I don’t know it’s like I always thought rail skating was cool, since I was a kid, like even before I could skate rails, before I jumped on rails. I always thought it was cool. And I just started practicing it. I wanted to learn. And that’s the thing with rails, because even though you can do a 50-50, and you go to a 15 stair, and it’s like, even though I have 50-50s, every try I’m not sure if I’m gonna do this you know. That’s kind of what I like with rails, it’s a different fear, from like ledges and stairs and stuff because you can always kick out. So I kind of like that fear because either you do it or you don’t and if you stay up there and think about it, the more you think, the more scared you get. So it’s more like a struggle, just have to do it right here.</p>\n<p><span style=\"color: #ff0000;\"><b>Do you think you want to try and do something with skateboarding?</b></span></p>\n<p>Yeah, I love skateboarding so I’d love to skate as much as I can. That’d be sick, that’d be really sick. But yeah.</p>\n<p><span style=\"color: #ff0000;\"><b>What’s it like having your brother run Bliss Wheels? Must be pretty cool.</b></span></p>\n<p>Yeah, I’m super hyped on that. He hooked me up with wheels. And I really like the wheels too so I’m really hyped on that. I just like seeing how he’s progressed. How he’s working hard too, he always has something like, “hey, I got this, we’re putting this out soon, we’re releasing this soon. “ I’m like damn! Yeah, I’d like to see that.</p>\n<p><span style=\"color: #ff0000;\"><b>The company’s vibe is sick. I like the vibe, and the graphics are clean, the visuals are really on point and the wheels are good. All the homies ride it, like Daniel Lebron and Brian Gille. I talked to Dani about Bliss and he’s so hyped on the wheels.</b></span></p>\n<p>Yeah, I’m hyped on the team, all of them. Chaz Ortiz, Manny Santiago, Larelle Gray, all the guys over here in the States. Dani Lebron, Michael Sommer, Mark Baines.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah Mark Baines is on Bliss. Mark is super OG.</b></span></p>\n<p>That’s what I mean, it’s like a super good team, we got Daniel Grönwall. Dude, he’s from Stockholm, Sweden and lives in Malmo now though, but he’s so good like a lot of people don’t know about him but he’s so good. He won’t skate for maybe 2 months, a month, and he’ll come to the park and front blunt helicopter flip on the ledge like in a couple of tries.</p>\n<p><span style=\"color: #ff0000;\"><b>No way. Are you serious?</b></span></p>\n<p>He’s like damn, I didn’t know I could do that. I was like bro, that’s crazy, like nollie flip backtail handrails in the park and stuff and he hasn’t been skating for like 2 months. It’s like shut up man, you’re like still the best dog, you know. Don’t complain. Yeah, he rides for Bliss too, he’s super sick.</p>\n<p><span style=\"color: #ff0000;\"><b>You’ve also been getting some stuff from DGK? Is that through the Swedish distributors? HOEP Skate?</b></span></p>\n<p>I got some stuff before I moved here, I’m still riding for this distributor called HOEP. It stands for House of Elite Products or something. And they have all the brands like Diamond, Grizzly, Primitive, Primitive boards, the whole Kayo stuff, and a bunch of other stuff like Brixton. And they were hooking me up with Diamond and Grizzly and all that stuff for a while in Sweden, but Ante Ossianson, he’s like the team manager, hooked it up because he knows the guys here because he goes back and forth. So he hooked it up over here, I started to get some stuff over here and I’m hyped to get it going.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah, gotta make it happen!</b></span></p>\n<p>Yeah, I started getting some DGK stuff. I got a DGK box.</p>\n<p><span style=\"color: #ff0000;\"><b>That’s sick man. And in LA I know you told me that you usually skate with Mo, the Seattle guys, Will Fisher.</b></span></p>\n<p>Mo’s my roomie, he’s always down to skate. I skate a lot with Oscar Meza. He used to live in this building here too actually.</p>\n<p><span style=\"color: #ff0000;\"><b>No way, he lived here too?</b></span></p>\n<p>He used to live here, he moved downtown though. But yeah, we skate a lot, he’s like my older brother. He’s super cool. We’re really good friends.</p>\n<p><span style=\"color: #ff0000;\"><b>His new part is unreal dude.</b></span></p>\n<p>He’s a beast. I kind of got inspired by him actually with rails, because in Sweden I skated smaller rails, but then when I started skating with him, he took me to some gnarly ass rails. I was like damn, is this what you guys are skating over here? I was like damn. I gotta keep up! (laughs) So he got me inspired to do that. I love his skating, he does everything first try and that’s what I like to see.</p>\n<p><span style=\"color: #ff0000;\"><b>How often do you skate with him?</b></span></p>\n<p>Like recently, the last month, it hasn’t been that much because he was filming for his part and I’ve been like in the streets skating with other people and stuff so we haven’t really been skating together the last month. Yeah, but like before that it was almost everyday. I was actually at his house today. We kicked it by his pool and stuff.</p>\n<p><span style=\"color: #ff0000;\"><b>How did you meet him? Through skating?</b></span></p>\n<p>My brother knew him before I knew him. So I met him through my brother.</p>\n<p><span style=\"color: #ff0000;\"><b>And your brother actually moved out here first right?</b></span></p>\n<p>Yeah, 3 years before me. He’s been here for a while. So that’s how I got to know Oscar, through my brother and yeah, we started skating.</p>\n<p><span style=\"color: #ff0000;\"><b>You push each other to progress. You go to spots and I’m sure you get amped off of each other.</b></span></p>\n<p>And we’re like really good friends too, so it’s not like we only skate. We hang out, we joke with each other. It’s always fun you know. And he’s super cool.</p>\n<p><span style=\"color: #ff0000;\"><b>How about Will Fisher? How’d you end up shooting photos with him?</b></span></p>\n<p>This was… I don’t even know. Oh yeah, it was, I don’t know if you know Sammy Perales? He’s a super good skater too. He’s from Seattle, he just moved here not that long ago. So I got to know Will through Sammy. And after that I just got his number and we’ve just been out shooting.</p>\n<p><span style=\"color: #ff0000;\"><b>Will takes some sick photos. When you showed me the photos he took, I was thinking damn, these are amazing.</b></span></p>\n<p>Yeah he’s super good. He’s got the eye for it for sure.</p>\n<p><span style=\"color: #ff0000;\"><b>He obviously skates, he’s got the eye for it. He knows what looks good in a photo.</b></span></p>\n<p>And he’s such a cool dude too. He’s always hyped, he’s always down to go shoot. He doesn’t even care if it’s far. He’s like, let’s just get the gas and we’ll get the footy. I’m always down for that. Because LA is kind of a bust to skate.</p>\n<p><span style=\"color: #ff0000;\"><b>Santa Monica is a bust because they know so many people skate here.  All the businesses go “No, you can’t skate here, or we’ll call the cops on you right now.” It’s harsh. Are you filming for any video parts?</b></span></p>\n<p>Yeah, I’m actually just filming right now. I haven’t really a full part but I have some footy. I’m trying to get more. So I’m just trying to do like a full part while I’m out here. It’s hard dude, like it’s such a bust and driving and you know all that but I can do it. It just takes time. Yeah, next month I have an interview in a Swedish magazine called Transition.</p>\n<p><span style=\"color: #ff0000;\"><b>How long are you headed back this summer for?</b></span></p>\n<p>I’m just going back for a month in July. I’m not trying to stay out there for too long but it’s sick to be around family during the summer and stuff, all the homies.</p>\n<p><span style=\"color: #ff0000;\"><b>Do you have any video parts online the readers can check out?</b></span></p>\n<p>I have one video part from 2012, but it’s a bit old now. It’s not new but it’s got my full part. That one part, and I have this clip you saw too, the 2014 clips (10qs with Alexander Loren). But it’s not like a part, it’s just a couple of clips. So I’ve never had this full part to be stoked on. So that’s what I’m trying to do right now. Of course I’m stoked on my old part, but I want to put out something with my skating right now, because that part’s already going to be old. I put my stuff on Instagram (<a href=\"https://instagram.com/alexanderloren/\" target=\"_blank\">@alexanderloren</a>).</p>\n<p><span style=\"color: #ff0000;\"><b>Last question, what’s your current setup?</b></span></p>\n<p>I ride a DGK board 8” or 8.1”, I like 8.1”, I think it’s perfect. It depends, sometimes 8”, sometimes 8.1” and I ride 147 High Thunder Light Trucks, Diamond Hardware, Diamond bearings, Grizzly Griptape. Oh yeah, and 52mm Bliss Wheels. I ride Bliss 51s/52s.</p>\n<p><span style=\"color: #ff0000;\"><b>Who are your sponsors?</b></span></p>\n<p>I ride for the distributor HOEP, I ride for this skate shop in my hometown called Street Lab. I ride for <a href=\"http://www.dgk.com/\" target=\"_blank\">DGK</a>, <a href=\"http://www.diamondsupplyco.com\" target=\"_blank\">Diamond</a> and <a href=\"http://www.grizzlygriptape.com\" target=\"_blank\">Grizzly</a> through HOEP Distribution and <a href=\"http://www.blisswheelco.com/\" target=\"_blank\">Bliss Wheel Co</a>.</p>\n<p><span style=\"color: #ff0000;\"><b>Lastly, thank you and shout outs?</b></span></p>\n<p>It’s a lot of people man. Thank you first of all, for doing this with me. And of course, all my sponsors that help me out with stuff, my family for supporting me out here. My brother Daniel, he helped me a lot, like all my homies you know. All the people that give me a positive energy, I’d like to thank them because that’s where they keep me going. That’s what I feel like, I just want to thank everyone that’s hyped on what I do and let’s do it together.</p>\n<p><span style=\"color: #ff0000;\"><b>That’s it, we’re done. Thanks Alexander!</b></span></p>\n<p>Thank you man!</p>\n<p><span style=\"color: #ff0000;\"><em><span style=\"color: #999999;\">Liked this interview? Check out the</span> <span style=\"color: #999999;\">print Krak Mag in each </span><a style=\"color: #ff0000;\" href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> <span style=\"color: #999999;\"> for more great content!</span></em></span></p>\n","author":"kev","categories":["interviews"],"tags":["alexander-loren","alexander-mo-hedeya","bliss-wheels","bryggeriets-gymnasium","daniel-loren","dgk","diamonds-supply-co","grizzly-griptape","hoep","krak-mag"],"featuredImages":[{"file":"IMG_5275-e1442820939224.jpg","width":2034,"height":1792,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/IMG_5275-e1442820939224.jpg"}],"video":""}