{"id":1979,"date":"2015-09-16T06:45:10","date_gmt":"2015-09-16T13:45:10","slug":"alfonso-de-anda","title":"Artist Interview &#8211; Alfonso de Anda","content":"<h3><span style=\"color: #999999;\"><strong>The following interview was originally featured in the print Krak Mag issue 2 that shipped with <a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox </a>#2 that shipped in June 2015. Don&#8217;t want to miss the next issue of the print Krak Mag? Want to receive some epic skateboarding product every two months? Check out the </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>now!<em><br />\n</em></strong></span></h3>\n<h4><span style=\"color: #75757d;\">Read on.</span></h4>\n<h2><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1981\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/enties_2.jpg\" alt=\"enties_2\" width=\"300\" height=\"158\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/enties_2.jpg 300w, https://res.cloudinary.com/krak/image/upload/mag/uploads/enties_2.jpg 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></h2>\n<h2><span style=\"color: #ff0000;\"><strong>Artist Profile – Alfonso de Anda</strong></span></h2>\n<p>For this second KrakBox, we are thrilled to be working with Alfonso, an amazing artist who has been skateboarding for a long time and whose work has been strongly influenced by his background as a skateboarder. We sat down with him to have a little conversation about how he got started doing art, and to hear how skateboarding factors into his work, and his decision to become an artist. Without further ado, may we present, Alfonso de Anda.- HK</p>\n<p><strong><span style=\"color: #ff0000;\">HK: What up Alfonso! Tell us a little about yourself?</span><br />\n</strong></p>\n<p><strong>ALFONSO: </strong>Hey! I’m Alfonso de Anda. I’m 26 years old and have been living in Los Angeles, California since 2014. I was born and grew up in Guadalajara, México.</p>\n<p><span style=\"color: #ff0000;\"><strong>You’re from Guadalajara? Wow. Why did you move to Los Angeles?</strong></span></p>\n<p>It felt like the place I had to be, you know? Because of the type of work that I do.</p>\n<p><span style=\"color: #ff0000;\"><strong>By type of work you do, I suppose you’re referring to art. How long have you been involved with art? </strong></span></p>\n<p>I’ve been making stuff since I was a little kid. Probably since I was 6 or 7. I used to build things to make my room cooler and shit, record cartoons on VHS to then re-watch and pause at certain scenes that I liked, to draw the characters on poster boards. At school, daydreaming and drawing was far more interesting to me than paying attention in class.</p>\n<p><span style=\"color: #ff0000;\"><strong>How did you link up with Krak?</strong></span></p>\n<p>Through a mutual friend. We met once to talk about the project and then things just started from there.</p>\n<p><span style=\"color: #ff0000;\"><strong>That’s cool. So tell us a little more about the kind of mediums you work with?</strong></span></p>\n<p>I try to use “tangible” materials as much as I can. I work with acrylics, ink, spray paint, watercolor, colored pencils and regular pencils, for the most part. I also use my computer. And for photography I’ve been mostly shooting film with a Canonet QL17, an Olympus XA and an Olympus Stylus Epic.</p>\n<p><span style=\"color: #ff0000;\"><strong>Wow, that’s a pretty broad range of mediums! Have you got a formal background in art?</strong></span></p>\n<p>I’ve done some art classes but I consider myself self-taught. I started taking art seriously when I was about 16, so I’ve been doing the “same” thing everyday and dedicating a lot of brain energy and thought to art for the past 10 years. Also, reading books and learning things by making them via trial and error, you know? You know, it’s along the lines of “Man I want to make some screen prints. I´ll just read about it, get the materials, experiment and mess things up and then eventually get it right.”</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1983\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/NOWAX.jpg\" alt=\"NOWAX\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/NOWAX.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/NOWAX.jpg 150w, https://res.cloudinary.com/krak/image/upload/mag/uploads/NOWAX.jpg 886w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>That’s a lot like how skateboarding is, we learn tricks via trial and error. Which brings me to my next question, when did you start skateboarding?</strong></span></p>\n<p>I started skating when I was around 11 years old. I had some years inbetween where I hardly skated though, when the skateboarding trend died and all my friends stopped skating. Don’t get me wrong, skating by yourself is fun but you know&#8230; Anyhow I used to pretty much just skate street but for the last couple of years I’ve been skating mostly transition.</p>\n<p><span style=\"color: #ff0000;\"><strong>So what got you into skateboarding?</strong></span></p>\n<p>Back when I was in middle school, some friends started doing it and I was like, cool! I want to do it too. The trend died a couple of months after that and I&#8217;m the only one who continued skating.</p>\n<p><strong><span style=\"color: #ff0000;\">How often do you skate? What keeps you skating?</span> </strong></p>\n<p>I ride my board as part of my commute every day but, in terms of actual skating (doing tricks), probably between 1 to 4 days a week, It’s a little bit hard to balance it with work. The idea of becoming a professional or even getting paid for skating died pretty quickly for me, I’ve never been that good. But as I saw that idea die I also realized that there are a whole bunch of other things in skateboarding besides skating that I could do so I was like yup, that’s my spot.</p>\n<p><span style=\"color: #ff0000;\"><strong>That’s so true, we’re all on the weekend warriors program. So who’s your favorite skateboarder?</strong></span></p>\n<p>I like what Gilbert Crocket and Pedro Barros have been up to, I’ve also always liked the way Jerry Hsu skates.</p>\n<p><span style=\"color: #ff0000;\"><strong>Jerry Hsu! Hell yeah!! What about favorite videos?</strong></span></p>\n<p>As far as videos, I really like “In search of the miraculous” by Pontus Alv, Habitat’s “Origins”, Toy Machine’s “Brainwash”, Ambig’s “Modern art” is pretty cool too and Foundation’s “That’s Life.” Oh and “Bag of Suck” from Enjoi, I could go on…<br />\n<span style=\"color: #ff0000;\"><strong>Those are some good choices. So what&#8217;s your current setup like?</strong></span></p>\n<p>I am currently riding an 8.5” Welcome board, Independent 149 trucks and some 54mm wheels. I can’t remember what bearings I have. (laughs)</p>\n<p><span style=\"color: #ff0000;\"><strong>Going back to the art questions,</strong> <strong>when did you start to combine your love for skateboarding and your love for art?</strong></span></p>\n<p>I don&#8217;t think that was a conscious decision. It would&#8217;ve been weird if it didn’t happen actually. As soon as I started skateboarding my work was influenced by it.</p>\n<p><span style=\"color: #ff0000;\"><strong>But was there something specific that prompted you to meld art and skateboarding? Or did it happen gradually and organically? </strong></span></p>\n<p>It just happened. Like I said, there is so much visual stimuli in skateboarding that I would have to be a robot to keep it from happening.</p>\n<p><span style=\"color: #ff0000;\"><strong>Have you ever made your own board graphics? Can you tell us more about the process? What type of paint did you use? Was it screened?</strong></span></p>\n<p>I painted my board once back in the day, It was pretty lame though. (laughs) I just used spray-paint and made some stencils. I guess I always knew it was going to get scratched super quick so I didn&#8217;t even make the effort to manually make it look pretty. Plus most of the time I&#8217;m stoked on the graphics already. Now, making board graphics for production, that&#8217;s another story.</p>\n<p><strong><span style=\"color: #ff0000;\">Tell us about this art piece you&#8217;ve worked on for the KrakBox? How did you get the idea?</span> </strong></p>\n<p>Re-heat is the name of the piece I did for the KrakBox. The idea came one night when I was out eating pizza, I must have had around 10 slices if not 14. My stomach was hurting like crazy and I ended up passing out in the alley behind the pizza place, I don’t remember much, my last visual memory from the night is laying down on the floor and seeing a rat eat a slice of pizza that they had thrown out the back door. That pizza place is quite rat-friendly. I woke up the next morning inside the pizza place and they fed me re-heated pizza from the night before. That’s how the idea came about.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1982\" src=\"https://res.cloudinary.com/krak/image/upload/w_206/mag/uploads/Krak-riso.jpg\" alt=\"Krak riso\" width=\"206\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_206/mag/uploads/Krak-riso.jpg 206w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Krak-riso.jpg 486w\" sizes=\"(max-width: 206px) 100vw, 206px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><strong>Interesting. Each of these pieces is pretty unusual, can you tell us about the printing process you used?</strong></span></p>\n<p>The printing process is called Risograph printing which is like a hybrid between screen-printing and photocopying. It’s such a beautiful process because it’s not perfect, those little imperfections give each print a special flavor and uniqueness.</p>\n<p><span style=\"color: #ff0000;\"><strong>So that makes each piece unique and limited in a way. How does the piece you did for the KrakBox relate to skateboarding?</strong></span></p>\n<p>The piece I did for the KrakBox, how it relates to skateboarding is that it was an adventure that happened on a night that I was out skating, you know? Like we went to the pizza shop after having a good sesh and it was one of those things that happens because of skateboarding, because skateboarding is a catalyst for a bunch of other things and this was one of them. It was like a little adventure that wouldn’t have happened if I didn’t go out skating.</p>\n<p><strong><span style=\"color: #ff0000;\">What other skate related work have you done?</span> </strong></p>\n<p>I’ve done some work for Vans (México), and two cartoon mini-series for Supra México as well. I’ve also had the chance to work with Premier Skateshop and Ambig clothing, just to name a few.</p>\n<p><span style=\"color: #ff0000;\"><strong>How did you get to work with Vans, Supra and Ambig?</strong></span><br />\nBy knocking on doors and talking to people who worked for those brands, pretty much. And putting work out there I guess.</p>\n<p><strong><span style=\"color: #ff0000;\">In terms of skateboard aesthetics, which skate company’s artistic direction are you most excited about right now?</span> </strong></p>\n<p>I’ve always been a fan of Ed Templeton’s work and thus Toy machine, Tired skateboards is coming up with really cool stuff, and also Friendship skateboards. I feel that these brands are paying attention to art, kind of like how it used to be. Protopositive graphics.</p>\n<p><strong><span style=\"color: #ff0000;\">Toy Machine has definitely always stood out in terms of their graphic direction. Who’s your favorite skateboard artist?</span><br />\n</strong>It’s hard for me to pick one favorite for everything, if you haven’t noticed. (laughs) I’m more of a “group of favorites” kind of guy. I grew up looking at stuff from Michael Sieben, Andrew Pommier, and Ed Templeton. Those genres and styles of graphics and art are going to stay in my heart forever.</p>\n<p><span style=\"color: #ff0000;\"><strong>Yeah, I know this is a tough one but what is your all time favorite skateboard graphic?</strong></span></p>\n<p>There are too many, I really like the Toy Machine graphic that has the words “Toy Machine” written on the fingers of two clenched fists (the Toy Machine fist graphic). Even though it’s almost a logo board, it blew my mind the first time I saw it.</p>\n<p><strong><span style=\"color: #ff0000;\">Since you’re obviously deeply into art, who’s your favorite non-skateboard artist?</span><br />\n</strong>I’m a big fan of ‘90s cartoons. I also really like the work from Barry McGee, Jim Houser, Raúl Pardo, Nathan Russell, David Rocha, Mike Brodie, Oliver Jeffers to name a few. A bunch of artists from the kids section of your local bookstore. I’ve also been obsessing on Efterklang’s music lately.</p>\n<p><strong><span style=\"color: #ff0000;\">That’s a list! I need to check out some of their work. Tell us a bit about the projects you are working on now?</span><br />\n</strong>I’m very exited on the work I’m doing right now, there are a couple of projects that are blowing my mind. Sadly I can’t say too much. On the other hand I’ve been continuously working on my zine “CALL ME A FOOL”, which is a quarterly zine with photos, illustrations, sketches, essays and stuff.<br />\nMy instagram is a good way to see what I’m up to (<a href=\"https://instagram.com/aldeanda/\" target=\"_blank\">@aldeanda</a>).</p>\n<p><strong><span style=\"color: #ff0000;\">Alright, we’ll look forward to seeing more of your work in that. What plans do you have for the rest of the year?</span><br />\n</strong>I’m still getting settled here in Los Angeles, so we’ll see what that brings. And like I said, I have a couple of projects aligned but can’t talk about them. In a nutshell, I’m skating and making stuff.</p>\n<p><span style=\"color: #ff0000;\"><strong>Any skateboard related art projects that you are working on or plan on working on in the future?</strong></span></p>\n<p>Can’t talk about it. (laughs)</p>\n<p><span style=\"color: #ff0000;\"><strong>All right, thanks for doing this Alfonso, who do you want to thank as we wrap this up?</strong></span></p>\n<p>Well, thank you guys! And I would like to give a shout out to all the dogs on earth, you guys rule, every single one of you. Cats too.</p>\n<h2><span style=\"color: #ff0000;\"><em>Liked this interview? Check out the <a style=\"color: #ff0000;\" href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a>  for more great content!</em></span></h2>\n","author":"kev","categories":["interviews"],"tags":["alfonso-de-anda","ambig","art","artists","california","krak-mag","krakbox","mexico","skateboarding","supra"],"featuredImages":[{"file":"enties_2.jpg","width":1000,"height":525,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/enties_2.jpg"}],"video":""}