{"id":3313,"date":"2018-05-31T21:24:59","date_gmt":"2018-06-01T04:24:59","slug":"amrit-jain-skate-sauce","title":"Founders Interview: Amrit Jain of Skate Sauce","content":"<p><span style=\"color: #ff0000;\"><strong>If my math is correct, this year is the 10 year anniversary of Skate Sauce. When you started the brand, where did you imagine it would be at this point in time?<br />\n</strong></span>Yes this November will be 10 years since I started Skate Sauce. That’s such a trip to even say. Time flies! I have always been an ambitious person so back then I imagined in 10 years the brand would be doing worldwide tours, in the big magazines, have a huge warehouse with a TF and I would be able to work on Skate Sauce full time without depending on a side job. Now that I am here, none of those are happening, haha! But that’s ok. Over the years I have learned so much and understand why we are where we are. The knowledge I have gained and the fun in growing a company is priceless. At the same time I know what I have to do to get to that goal – get an investor to throw down some serious loot.  At the moment we are actually entertaining that idea but I honestly have enjoyed building the brand from the ground up using only the money we started with and whatever profit we made put back into the brand. It may be a little slower growth but I believe it’s kept us around longer than a quick investment that builds hype but may not last. Specially with the way the industry has fluctuated over the past 10 years.</p>\n<p><span style=\"color: #ff0000;\"><strong>Yeah, surviving as a small business in the skate industry for that long is an accomplishment in itself. What’s the secret?<br />\n</strong></span>Patience and persistence. And being smart with how you spend your money. I remember reading some business article 10 years ago that asked the question: if you had $1,000,000 to spend on your company, how would you spend it? They produced two examples. One example was spending that budget in 2-3 years to create a huge amount of hype – ads in the mags, tons of product, pay to have the top Pro skaters, etc. The other example was spending $1,000,000 over 10 years. In their conclusion the company that spent the $1,000,000 in 2-3 years wouldn’t have enough time to build a solid following and value versus the company that’s around for 10 years. That resonated with me a lot. It made me think of companies like Independent Trucks, Bones, etc and how they are the go-to’s, not only because they make quality products, but because they are household names, they have been around so long. So for us we didn’t have a $1,000,000 investment or anything close, but I used that formula of just slow but sure growth. Starting small and growing at our pace – taking the time to see what products work and don’t work, analyzing the industry changing to things like social media and developing an understanding on how to tackle those challenges.</p>\n<div id=\"attachment_3319\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3319\" class=\"size-full wp-image-3319\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Gavin-Nolan-Frontside-Noseblunt.-2016-New-York-City.-Digital-photo-by-Amrit.jpg\" alt=\"Gavin Nolan, frontside noseblunt, 2016 NYC. Photo: Amrit Jain\" width=\"680\" height=\"454\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Gavin-Nolan-Frontside-Noseblunt.-2016-New-York-City.-Digital-photo-by-Amrit.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Gavin-Nolan-Frontside-Noseblunt.-2016-New-York-City.-Digital-photo-by-Amrit.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3319\" class=\"wp-caption-text\">Gavin Nolan, frontside noseblunt, 2016 NYC. Photo: Amrit Jain</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Is it still a one man show or do you have a team working with you behind the scenes now?</strong></span><br />\nIt’s pretty much still a one man show.  It was easier in the beginning but it has been a bit tricky now that we have grown so much.  There is just so much to do from filming new videos to editing them, shooting photos for catalogs and ads, designing new products, making new graphics, sales, overseeing production, accounting, marketing, etc etc. I handle it all while working a full time job at SLS &amp; ETN. But now we are slowly starting to try to build a team. I have a friend named <a href=\"https://www.behance.net/FreddieLonka\" target=\"_blank\" rel=\"noopener\">Freddie Lonka</a> who is a rad skater from Denmark and has been helping me lay out the catalog this year. I’ve been looking for a graphic designer for some time now, but I am picky and it’s hard to find someone that will work with our budget and make the type of graphics we like. Also looking for a salesperson. So if you guys know anyone send ‘em our way!</p>\n<p><span style=\"color: #ff0000;\"><strong>Damn, you’re a busy man! Ok, so if there are any qualified people reading this, how can they get in touch?</strong></span><br />\nEither DM us on Instagram <a href=\"https://www.instagram.com/skatesauce/?hl=en\" target=\"_blank\" rel=\"noopener\">@skatesauce</a>, or DM me <a href=\"https://www.instagram.com/amrit/\" target=\"_blank\" rel=\"noopener\">@amrit</a>, or email me: <a href=\"mailto:amrit@skatesauce.com\" target=\"_blank\" rel=\"noopener\">amrit@skatesauce.com</a></p>\n<p><span style=\"color: #ff0000;\"><strong>Skate Sauce is, in all seriousness, pretty big in Japan. What led to this and how did you first connect with the Japanese riders on the team?<br />\n</strong></span>Yea Japan is SAUCED UP!!  The brands success there has helped us grow so much. It all started with a pretty known Japanese skater named <a href=\"https://www.instagram.com/yutokojima/\" target=\"_blank\" rel=\"noopener\">Yuto Kojima</a>. He came to live in LA for 5 years and we became friends.  He was the life of the party and actually brought all the LA crews together because he was friends with everyone. Around 2012 a distribution from Japan reached out and wanted to distribute the Sauce.  From there it was really rad to see how much effort the distro put behind the brand. They helped us get ads in the big Japanese mags and built a whole team of really good Japanese skaters. But it all started with Yuto. He was the first Japanese rider and then worked with the distro to help us build a solid team. I was fortunate to meet all of them in 2016 when we did a mini Japan tour and they were all some of the nicest dudes I’ve ever met.</p>\n<div id=\"attachment_3320\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3320\" class=\"size-full wp-image-3320\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/JAPAN-team-skatelife-2016.-film-photo-by-Amrit.jpg\" alt=\"Japan team, 2016. Photo: Amrit Jain\" width=\"680\" height=\"430\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/JAPAN-team-skatelife-2016.-film-photo-by-Amrit.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/JAPAN-team-skatelife-2016.-film-photo-by-Amrit.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3320\" class=\"wp-caption-text\">Japan team, 2016. Photo: Amrit Jain</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Any funny stories from that tour?</strong></span><br />\nYes it all had to do with one of the Japanese Skate Sauce riders whose nickname is <a href=\"https://www.instagram.com/junyafire/\" target=\"_blank\" rel=\"noopener\">Junyafire</a>.  For some reason he kept saying DAAAYYYYYUUUMMMMM… TIGHT. Maybe he had just learned about that East Coast slang word TIGHT, but he kept saying that phrase whenever something happened – whether it was someone landing a trick, eating good food, etc etc. And the way he said it was hilarious. You can see some of it in the credits of the Skate Sauce Japan Tour on Youtube.</p>\n<p><iframe src=\"https://www.youtube.com/embed/YO_uK-uaN8U?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><strong>Let’s talk about your job at Street League and ETN&#8230; What do you guys chat about at the water cooler?<br />\n</strong></span>Haha currently sitting at my desk looking at that water cooler as I type this… making me thirsty! Working at SLS &amp; ETN has been a dream come true.  Besides wanting to start my own company, I have always wanted to work in skateboarding. I had a brief stint in 2008 before I started Skate Sauce helping Steve Berra build The Berrics as their first official employee. But when I was approached to work for SLS at the end of 2014 it changed my life.  They asked me to run their social media because they liked the way I did social for Skate Sauce. And because of my extensive knowledge of skateboarding I was also able to help contribute to building SLS – from course design to invited skaters to format to judging, etc. In 2016 we started working on the ETN idea and vision. In 2017 we launched ETN and it’s been a fun experience trying to do something new in skateboarding.  As far as water cooler talk, it’s actually a lot of fun games of skate with the other employees, shredding the park, coming up with new ideas for shows, talking about skating, the industry, racking our brains for days to pick the <a href=\"http://streetleague.com/trickoftheyear/\" target=\"_blank\" rel=\"noopener\">Trick of the Year</a>, etc, etc. Between all of that and running my own skate company, life is currently a dream come true.</p>\n<p><strong><span style=\"color: #ff0000;\">Has the inclusion of skateboarding in the Olympics had an impact on your role there or on the general office vibes (or politics)?<br />\n</span></strong>Not so much actually. Maybe next year since that will be the year before the Olympics.  It’s talked about in meetings for sure, and there is a plan I can’t discuss at the moment.  If anything it will help SLS grow which is a cool opportunity. Office vibes haven’t changed one bit.  At the end of the day it will be an event that goes down once every 4 years so I am not too worried about it. It’s not stopping me and my friends from having fun skateboarding!  I just wish I could help make it cool as I am not sure who is in charge of setting up the actual event. As for politics, yea I hear it when I’m out and about at industry parties. There are the die hards that are like, fuck that shit it’s going to ruin skateboarding, the optimistic ones who see the benefits, and the neutral ones who just don’t care and are going to have fun skating no matter what.</p>\n<div id=\"attachment_3316\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3316\" class=\"size-full wp-image-3316\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Amrit-Oscar-Gronbaek-Tom-Penny.-2017-Copenhagen-Denmark..jpg\" alt=\"Amrit, Oscar Gronbaek, Tom Penny, 2017 Copenhagen\" width=\"680\" height=\"511\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Amrit-Oscar-Gronbaek-Tom-Penny.-2017-Copenhagen-Denmark..jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Amrit-Oscar-Gronbaek-Tom-Penny.-2017-Copenhagen-Denmark..jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3316\" class=\"wp-caption-text\">Amrit, Oscar Gronbaek, Tom Penny, 2017 Copenhagen</p></div>\n<p><span style=\"color: #ff0000;\"><strong>You’ve been shooting a lot of photos lately&#8230; I scoped some cool ones from Copenhagen Open on your Instagram. Do you just shoot for fun or does it tie back into your work with SLS?<br />\n</strong></span>It’s mostly just for fun. Ever since I picked up a video camera in 2004 I have been into videography and photography. It was mostly video up until 2010 when I got a Canon 7D and started shooting HD videos while also being able to shoot crispy photos. At the time websites and blogs were still big so I would use the photos for the Skate Sauce blog or for social media or our catalogs. When my HD cam broke in 2014, I started just shooting photos &amp; videos on my iPhone.  Working for SLS in 2015 I pretty much traveled the world with an iPhone and since I had a background of videography &amp; photography I was able to just shoot stuff on my phone and post it instead of waiting for the SLS photogs &amp; filmers to send me stuff. So it does tie back to SLS to a certain extent. In 2016 I bought a Canon AE1 film camera which came out a year after I was born – 1984! That one has been so fun to shoot photos on, like those Copenhagen Open photos.</p>\n<p><span style=\"color: #ff0000;\"><strong>What do you prefer to shoot, film or digital?<br />\n</strong></span>Since everyone has gone full HD/4k/etc I thought it would be cool to go back to shooting photos on film and filming with a VX video camera.  It’s been pretty fun because unlike digital where you see what you shot right away and can fix it, you have to know your shot/lighting/etc for film and cross your fingers that you got the shot. So it’s fun getting the roll developed and seeing if you shot it right or fucked up. And if you shot it right it just looks so dope and classic. Same with VX – the sound of skating is perfect and I just like that raw older look. But I still have fun filming HD on my iPhone 7! It’s a trip to see how good the phones have become at shooting photos &amp; video. As for preference, I like to just balance them both out.</p>\n<div id=\"attachment_3321\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3321\" class=\"size-full wp-image-3321\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Luis-Tolentino-Backside-Powerslide-2016-New-York-City.-Film-photo-by-Amrit.jpg\" alt=\"Luis Tolentino, backside powerslide, 2016 NYC. Photo: Amrit Jain\" width=\"680\" height=\"438\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Luis-Tolentino-Backside-Powerslide-2016-New-York-City.-Film-photo-by-Amrit.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Luis-Tolentino-Backside-Powerslide-2016-New-York-City.-Film-photo-by-Amrit.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3321\" class=\"wp-caption-text\">Luis Tolentino, backside powerslide, 2016 NYC. Photo: Amrit Jain</p></div>\n<p><span style=\"color: #ff0000;\"><strong>When we spoke to you way back in issue 4 of KrakMag you mentioned you weren’t filming as much as you wanted to. Are there any Skate Sauce videos in the works at the moment?<br />\n</strong></span>Yea I def still don’t film as much as I want to. I have been trying to change that but it’s tough these days. Everyone has a camera now so a lot of the guys get tied up shooting other projects. On top of that they don’t always want to film VX and have to wait months for an edit to come out which I totally understand. So I somewhat get it out of my system by filming on the phone, but I truly miss working on a big project over a few years, having the premiere and putting out a DVD. With that said I filmed some sick VX clips in 2016 with a bunch of the guys in LA and Barcelona and have a 4 minute edit called SHAOLIN JAZZ thats marinating at the moment [fresh out the oven, see below! – ed.]. I’m putting the final touches on it and then releasing it in the next few weeks. After that I want to try to work on more smaller projects. Maybe just film over a weekend or two and then put that stuff out after a few weeks instead of trying to work on larger projects.</p>\n<p><iframe src=\"https://www.youtube.com/embed/fPaUf_gPD4s?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><strong>Lastly, what are you excited for in 2018?<br />\n</strong></span>I’m excited and thankful to still be able to do what I do and to ride a skateboard down the street. Thats def number 1, nothing can top that feeling. For Skate Sauce I am excited to see where we go this year and hoping we can find that graphic designer to help us get to the next level.  We have some new products we are designing that I am hoping to drop this year as well as some new distributions around the world that are interested. I also have an idea for a Sauce shop that I want to do. I don’t want to reveal it yet but it’s not just a skateshop. Other than that I am super hyped for another year of traveling the world with SLS/ETN while spreading the SAUCE!</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 18 that shipped with the Love <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n<div id=\"attachment_3318\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3318\" class=\"size-full wp-image-3318\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Flo-Marfaing-2017-Barcelona-Spain.-Film-photo-by-Amrit-.jpg\" alt=\"Flo Marfaing, 2017 Barcelona. Photo: Amrit\" width=\"680\" height=\"1076\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Flo-Marfaing-2017-Barcelona-Spain.-Film-photo-by-Amrit-.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_190/mag/uploads/Flo-Marfaing-2017-Barcelona-Spain.-Film-photo-by-Amrit-.jpg 190w, https://res.cloudinary.com/krak/image/upload/w_647/mag/uploads/Flo-Marfaing-2017-Barcelona-Spain.-Film-photo-by-Amrit-.jpg 647w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3318\" class=\"wp-caption-text\">Flo Marfaing, 2017 Barcelona. Photo: Amrit Jain</p></div>\n<div id=\"attachment_3322\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3322\" class=\"size-full wp-image-3322\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Oscar-Gronbaek-Kickflip.-2011-Barcelona-Spain.-Digital-photo-by-Amrit.jpg\" alt=\"Oscar Gronbaek, kickflip, 2011 Barcelona. Photo: Amrit Jain\" width=\"680\" height=\"452\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Oscar-Gronbaek-Kickflip.-2011-Barcelona-Spain.-Digital-photo-by-Amrit.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Oscar-Gronbaek-Kickflip.-2011-Barcelona-Spain.-Digital-photo-by-Amrit.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3322\" class=\"wp-caption-text\">Oscar Gronbaek, kickflip, 2011 Barcelona. Photo: Amrit Jain</p></div>\n<div id=\"attachment_3317\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3317\" class=\"size-full wp-image-3317\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Amrit-Tom-Penny-Evan-Smith-Josef-Scott-Jatta.-2015-Barcelona.-Photo-by-Thomas-Winkle..jpg\" alt=\"Amrit, Tom Penny, Evan Smith &amp; Josef Scott Jatta. 2015 Barcelona. Photo: Thomas Winkle\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Amrit-Tom-Penny-Evan-Smith-Josef-Scott-Jatta.-2015-Barcelona.-Photo-by-Thomas-Winkle..jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/Amrit-Tom-Penny-Evan-Smith-Josef-Scott-Jatta.-2015-Barcelona.-Photo-by-Thomas-Winkle..jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Amrit-Tom-Penny-Evan-Smith-Josef-Scott-Jatta.-2015-Barcelona.-Photo-by-Thomas-Winkle..jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3317\" class=\"wp-caption-text\">Amrit, Tom Penny, Evan Smith &amp; Josef Scott Jatta. 2015 Barcelona. Photo: Thomas Winkle</p></div>\n","author":"kev","categories":["interviews"],"tags":["amrit-jain","interviews","krakbox","krakmag","skate-sauce","street-league"],"featuredImages":[{"file":"Amrit-Spencer-Fujimoto-2016-NYC-skatelife.-Digital-photo-by-David-Serrano.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/Amrit-Spencer-Fujimoto-2016-NYC-skatelife.-Digital-photo-by-David-Serrano.jpg"}],"video":""}