{"id":3334,"date":"2018-07-03T15:57:03","date_gmt":"2018-07-03T22:57:03","slug":"anthony-pappalardo-adult-inc","title":"Founders Interview: Anthony Pappalardo of Adult Inc.","content":"<p><em>Inspired by the likes of Phelps, Gitter and Pushead, Anthony Pappalardo kicked off his writing career contributing to Slap at the ripe age of 19 and went on to write multiple books covering the hardcore music scene. These days he’s a contributing writer for Jenkem and Vice, and he’s just recently launched the new East Coast rooted skate brand, Adult Inc. To celebrate, we’ve teamed up to bring you a KrakBox exclusive Adult Inc. pin and tee! We also took the opportunity to talk to Anthony about being raised by skateboarding, music and bad tv, and how it’s shaped him and the brand.</em></p>\n<div id=\"attachment_3342\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3342\" class=\"size-full wp-image-3342\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-jerry-patrick-buckley.jpg\" alt=\"Jerry Mraz. Photo: Patrick Buckley\" width=\"680\" height=\"452\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-jerry-patrick-buckley.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-jerry-patrick-buckley.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3342\" class=\"wp-caption-text\">Jerry Mraz. Photo: Patrick Buckley</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Let’s start with some background details: when and how did you get into skateboarding, when did you become a writer, and when did you put the two together?<br />\n</strong></span>Do you remember the movie <a href=\"https://www.youtube.com/watch?v=MKyZ7R-tDQg\" target=\"_blank\" rel=\"noopener\">Thrashin</a>’? It’s not good. Much like Gleaming the Cube/A Brother’s Revenge was also trash, but those two movies along with the much more iconic Back to the Future got a lot of ‘80s kids into skating or at least landed them a Christmas/ Holiday complete.</p>\n<p>Check this out though, the female lead in Thrashin’ was played by Pamela Gidley, who was a beauty pageant winner and from Salem, NH, the town my family moved to when I was 10. This was a big story in the local paper. I guess she got some loot, because she bought a DeLorean—the exact car in fucking Back to the Future. It sat in front of this suburban ranch home for years and was about half the length of the home. Anyway, like most kids I asked for a skateboard one Christmas, but unlike most of my friends, I actually rode it all the time—in my basement, in my garage, and on the streets when the snow melted. New England winters suck. The hardest part wasn’t even the actual skateboarding, but rather, finding people to skate with until you get your driver’s license—at least for me, as I lived in a place without public transportation that would take you to a city.</p>\n<p>On the East Coast, specifically the Northeast, there weren’t many devoted skate shops yet—it was mostly BMX shops that carried skateboards. I rode my bike to this spot called Flyin’ Wheels and got an issue of Thrasher. That was a big deal. I immediately subscribed and devoured every page until the next arrived, along with getting a free Skate Rock cassette with the sub—a real introduction to this imaginary culture that only lived in my head. More importantly, I was reading about skateboarding written by skateboarders, as well as music that I had only heard of in passing… I mean fuck, I was 12 or some shit.</p>\n<p><img class=\"alignright wp-image-3347\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-smile.jpg\" alt=\"Adult Inc\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-smile.jpg 330w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/adult-smile.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-smile.jpg 300w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p>Phelps. Gitter. <a href=\"https://en.wikipedia.org/wiki/Pushead\" target=\"_blank\" rel=\"noopener\">Pushead</a>. Here’s why this trinity was important. Jake Phelps had lived in Boston and was a legend before working for Thrasher and was a roadie for SS Decontrol, arguably the most important hardcore band from the city. Mike Gitter published his own zine called <a href=\"https://www.amazon.com/xXx-Fanzine-1983-1988-Mike-Gitter/dp/0976596660\" target=\"_blank\" rel=\"noopener\">xXx</a> and parlayed that into a freelance music journalism career and later A&amp;R lane. He was also from Boston and wrote for the mag. Pushead had the Metallica/Zorlac connection and he was also an incredible writer, who captured what a band actually sounded like. OK, he was in SF, but it didn’t matter. Knowing that some of the roots of all of this connected back to something local made it more tangible to me.</p>\n<p>I started working on my own terrible zines, then contributing to better ones, before I was introduced to Lance Dawes at Slap, through I believe Vern Laird and Sergei Trudnowski—I’m foggy on that. Dawes had a deep hardcore history, growing up in the Washington, D.C. area and he allowed me to submit some music reviews to Slap, as well as later letting me write about some skate events and interview bands. I was 19 and contributed to Slap into the early 2000s. I’m scared to read most of that stuff—I’m sure it was full of cliches and poor grammar, but it didn’t matter, as that opened things up for me and I actually got paid.</p>\n<div id=\"attachment_3337\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3337\" class=\"size-full wp-image-3337\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-B-DOUGS-zander-taketomo.jpg\" alt=\"Brian Douglas. Photo: Zander Taketomo\" width=\"680\" height=\"450\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-B-DOUGS-zander-taketomo.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-B-DOUGS-zander-taketomo.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3337\" class=\"wp-caption-text\">Brian Douglas. Photo: Zander Taketomo</p></div>\n<p><span style=\"color: #ff0000;\"><strong>You’ve also played in hardcore bands and been involved in that scene—including writing a few books about it—did music and skateboarding go hand in hand when you were growing up? Did one influence the other?<br />\n</strong></span>For sure, but I think that there’s a bit of revisionist history in that the connection to hip-hop and rap gets left out of this Southern California fairytale. Contextually, as the first wave of hardcore is fading, rap/hip-hop forces its way into mainstream culture. That was equally vital and exciting, even if—at least in the Boston area—it wasn’t experienced in all-ages matinees. In the same way that we’d search out punk singles, we’d look for hip-hop 12”s or rare B-Sides. I mean, if you saw <a href=\"https://www.youtube.com/watch?v=WV7CPkCQQQY\" target=\"_blank\" rel=\"noopener\">Plan B Questionable</a>, you wanted to know who Hieroglyphics were as much as you wanted a Firehose or Dinosaur Jr cassette years prior. Boston historically had a big hardcore scene, but around 1990 it shrunk a bit, so if you saw someone at a show who looked like they skated, chances are you run into them at a spot and you became friends.</p>\n<p>Skating and hardcore punk were similar in that they made you travel outside of your town—once you got a taste, you wanted to experience it other places. You want to go to CBGB and skate the <a href=\"http://map.skatekrak.com/spot/597abec52f9189000115d574\" target=\"_blank\" rel=\"noopener\">Brooklyn Banks</a>, etc. Later getting to go on tour and play so many historic venues as well as legendary skate spots was a trip. I mean, fuck, we played Gilman Street in Berkeley, CA and there ended up being a skate contest in SF. That was the first time I saw Mark Gonzales skate in person. Fuck.</p>\n<div id=\"attachment_3341\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3341\" class=\"size-full wp-image-3341\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-Jerry-jonathan-mehring.jpg\" alt=\"Jerry Mraz. Photo: Jonathan Mehring\" width=\"680\" height=\"454\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-Jerry-jonathan-mehring.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-Jerry-jonathan-mehring.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3341\" class=\"wp-caption-text\">Jerry Mraz. Photo: Jonathan Mehring</p></div>\n<p><span style=\"color: #ff0000;\"><strong>So you’ve just launched your new skate brand ‘Adult’—congrats! You told Jenkem that when the opportunity to start the brand came up you hesitated because there are so many brands already, but then you decided you were overthinking it. Did you just decide to take the gamble or did you realise that there was a gap you could fill?<br />\n</strong></span>Honestly, it will work or it won’t. I try not to stay in my own head. The skateboarding industry is a lot like memes at this point. Sometimes I look at the shit and wonder what it even means—am I too old to get the humor? Is that what a 16-year-old somewhere in the world likes? We just stepped back and made what we thought would be interesting and looked right on a skateboard. The entire idea of starting a company where the profit margins suck is counter to capitalism, so in that sense, it’s not even a business. It’s not a hobby either, it’s a creative outlet, so I look at a brand like I would painting or fine art. How many artists make money in their lifetime? Well, sadly, mostly the shitty ones do or at least the ones I don’t find interesting. Ha.</p>\n<p><iframe src=\"https://www.youtube.com/embed/RvsT98-QWWw?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><strong>You threw around ideas for the brand with artist Noah Butkus and he art directed the video ‘Back Pages’ which you launched with. Is he responsible for all the graphics in the first range? What is it about his aesthetic that you like and why did you think it was right for Adult?<br />\n</strong></span><a href=\"https://www.instagram.com/noah.butkus/?hl=en\" target=\"_blank\" rel=\"noopener\">Noah</a> is one third of the brand along with Cortney Miner. He’s the visual identity and will be creating the brand’s aesthetic as long as it exists. What attracted me to what he does, is that it has a familiarity, but it’s distinct. It’s his own thing and language that I think translates into what looks good on a skateboard. We set up this guardrail of using a little restraint and trying to create some tone without giving it all away. Are you really going to outdo Cliver or McKee? Is that even possible in this current landscape/post-analog world? It’s similar to the advent of rip-off graphics in the early-’90s—World Industries owned that, because they put a spin on it, while other companies were looking at a fucking Lay’s Chips logo, wondering what rider’s name started with an “L.”</p>\n<p>When you look at what Jason Dill has done with FA/Hockey’s aesthetic, he really had a vision to fill a void, so if you want to play in the space, you not only have to create something more compelling, but you’re against a company owned by two of skateboarding’s most recognizable personalities, with the deepest roster. Good luck. That’s suicide. For Adult, it’s more about thinking of new ways to communicate without being too fucking extra at the same time.</p>\n<p><img class=\"aligncenter size-full wp-image-3346\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-sleep.jpg\" alt=\"Adult Inc skateboard\" width=\"680\" height=\"151\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-sleep.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-sleep.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>I’ve read that you were into B-grade movies and old Marvel cartoons as a kid and I can see some of this in the look of Adult. That, and the collage DIY style reminiscent of the hardcore scene. Was there much thought put into the brand aesthetic or was it the natural direction based on your own tastes and influences?<br />\n</strong></span>On one hand, I firmly believe that everyone inherently has a voice and when you try to change it, rather than refine it, it’s counter to the creative process. Conversely, anyone in my age group that got into skating, punk, indie, whatever, probably had the same experience. We were latchkey kids, raised by an era of television when cable wasn’t in every home, so you just watched what was on. The later the day got, the weirder the programming. You’re some kid drunk on sleep staring at the USA network at 1AM, watching a movie that probably shouldn’t have gotten made. It’s slightly off and slightly right on. So there’s that.</p>\n<p>That commonality is automatic and you can’t control it, but we also both agreed that we wanted to own our visuals. Why are we going to pay to print other people’s art that wasn’t created with skating in mind? That’s been done. Also, nostalgia is a game for old people. I may be old, but I’m not interested in recreating my youth or thinking Adult should be like H-Street or Santa Cruz. I mean, let’s be honest, a lot of H-Street’s graphics kinda sucked—it’s easy to remember a Hensley graphic, but who the fuck is scouring eBay for a John Sonner board?</p>\n<p><img class=\"aligncenter size-full wp-image-3348\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-spit-boards.jpg\" alt=\"Adult Inc skateboard\" width=\"680\" height=\"438\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-spit-boards.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-spit-boards.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>The t-shirt you’ve done exclusively for this KrakBox has a hardcore album reference. What’s the story behind the design?<br />\n</strong></span>The “spit” graphic is something Noah drew up that immediately felt right for <a href=\"https://www.instagram.com/adultinc/?hl=en\" target=\"_blank\" rel=\"noopener\">Adult</a> and is a character that we can evolve. As far as the reference, it was a nod to a time, put in a new context. It’s actually less about Greg Ginn or Black Flag, but the colors and typography on that <a href=\"https://en.wikipedia.org/wiki/Gone_(band)\" target=\"_blank\" rel=\"noopener\">Gone</a> album. The hope is that someone connects the dots and digs that record, but it’s kind of an outlier in that those references aren’t really in the line at all.</p>\n<p><img class=\"alignleft wp-image-3343 size-medium\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-kiss.jpg\" alt=\"Adult Inc\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-kiss.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/adult-kiss.jpg 150w, https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-kiss.jpg 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p>Also, Gone took that line/sample from an Elvis track called “<a href=\"https://www.youtube.com/watch?v=8bSVEA0ZAVw\" target=\"_blank\" rel=\"noopener\">Milk Cows Boogie</a>,” so it’s that tradition of reappropriating, as much as it is a little homage. His version came out in 1955, pre-dating the King getting real, real gone himself.</p>\n<p><span style=\"color: #ff0000;\"><strong>Tell us about that bag of sketchy polaroids you found in the woods as a kid.<br />\n</strong></span>Actually, there was this overpass near my house and depending on the water levels, you could walk across this creek or stream or whatever, if the rocks were poking through. Real suburban idiot shit, because they were usually slippery and you were bound to fall. Some creep had to have planted them or at least sent a perved out “message in a bottle,” because stuck on one of these rocks was a clear ziplock bag filled with Polaroids. I grabbed the bag and jumped back to the shore, only to find several pics of some hairy guy’s junk. My brain was thinking “boobs,” but then it was an uncircumsized dick, so that was a bit anticlimactic. I guess the experience would have been way different if I were attracted to men, but that wasn’t the case. One’s trash truly is another’s treasure. But honestly, I still believe some lurker saw us always fucking around down at this place and planted them.</p>\n<div id=\"attachment_3340\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3340\" class=\"size-full wp-image-3340\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-Frankie_180_5050_from_flat_photo_Leo_Menezes.jpg\" alt=\"Frankie Nash, 180 50-50 from flat. Photo: Leo Menezes\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-Frankie_180_5050_from_flat_photo_Leo_Menezes.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/adult-Frankie_180_5050_from_flat_photo_Leo_Menezes.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-Frankie_180_5050_from_flat_photo_Leo_Menezes.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3340\" class=\"wp-caption-text\">Frankie Nash, 180 50-50 from flat. Photo: Leo Menezes</p></div>\n<p><span style=\"color: #ff0000;\"><strong>The team consists of Jerry Mraz, Frankie Nash, Brian Douglas and Jake Baldini. Why did you choose these guys?<br />\n</strong></span>They’re East Coast, they’re all different, but they all share the thread of telling this story. Most importantly, they all have been so patient and trusting of us so far and have been giving real, unfiltered feedback. For example, Jake was really vocal about wanting the brand to work with <a href=\"http://www.chapmanskateboards.com/\" target=\"_blank\" rel=\"noopener\">Chapman Skateboards</a> and really continue the lineage of East Coast skateboarding, as well as work with someone who really put this on the map. That’s what’s really important to me. We went out to Long Island, looked at concaves, and just shot the shit, taking in the magnitude of what they’ve been able to do for skateboarding. The place is a lowkey museum.</p>\n<p><span style=\"color: #ff0000;\"><strong>Lastly, where can we get our hands on the first Adult range?<br />\n</strong></span>For this first drop we’re only selling directly to shops—no online sales direct to consumer. Yup, another fucking dumb idea, but hopefully it builds a little synergy with the local shops that are so vital to skateboarding. We’ll eventually sell online, since not everyone is near a shop, but for now, if you want Adult, tag a shop <a href=\"https://www.instagram.com/adultinc/?hl=en\" target=\"_blank\" rel=\"noopener\">on our Instagram</a> or ask your local politely—don’t be a punisher.</p>\n<p><img class=\"aligncenter size-full wp-image-3345\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-shooter.jpg\" alt=\"Adult Inc\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-shooter.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/adult-shooter.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/adult-shooter.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 18 that shipped with the Love <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["adult","anthony-pappalardo","interview","krakbox","krakmag"],"featuredImages":[{"file":"adult-cover.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/adult-cover.jpg"}],"video":""}