{"id":1312,"date":"2015-05-08T15:18:57","date_gmt":"2015-05-08T22:18:57","slug":"conversation-daniel-lebron","title":"A Conversation with Daniel Lebron","content":"<p style=\"text-align: center;\"><a href=\"https://itunes.apple.com/us/app/krak/id916474561?mt=8\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1374\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Daniel-Lebron-2.png\" alt=\"Daniel Lebron 2\" width=\"300\" height=\"168\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Daniel-Lebron-2.png 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/Daniel-Lebron-2.png 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/Daniel-Lebron-2.png 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Daniel-Lebron-2.png 1089w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><em>Daniel Lebron was recently in Los Angeles for 2 months working on a few projects. During this recent trip to the US, I got to watch him skate the West Los Angeles Courthouse (now a designated legal skate spot) for the first time in almost 15 years. I&#8217;ve always been a fan of Dani&#8217;s skateboarding, and used to watch and re-watch his L.A. County(2000) video part on VHS (check out Dani&#8217;s <a href=\"http://mag.skatekrak.com/time-capsule-daniel-lebron/\" target=\"_blank\">Time Capsule</a>). He&#8217;s one of a select few pros who has proper frontside heels on flat both switch and regular, and a ridiculous repertoire of tricks that includes fakie flip fakie backside crooks on ledges. On his last day in Los Angeles, we got to have a conversation about his life in skateboarding thus far and his love for Flamenco guitar on the drive from Costa Mesa back to Huntington Beach, finishing off over some cheese and avocado on bread, pizza generously shared by his super friendly housemates, and a glass of Merlot. Dani&#8217;s huge spirit is only matched by his bigger heart. Thank you Dani for the inspiration, sharing your stories, your food and wine, and for showing all of us what a life lived with passion really means. See you in Barcelona soon brother! Mil gracias! &#8211; HK</em></p>\n<h3>What&#8217;s up Dani, thanks for doing this. Really psyched to hear more of your story. You were born and grew up in Alicante, Spain right? What is Alicante like? What&#8217;s the city know for?</h3>\n<p>Alicante is in the Southeastern part of Spain, it&#8217;s a small city and I lived in the suburbs. The main industry there is a cement factory. Most of Alicante&#8217;s residents want to work in the cement factory as it&#8217;s a good job there.</p>\n<h3>I understand you left school at an early age to start working. Did you work in the cement factory there?</h3>\n<p>I didn&#8217;t work in the cement factory, there aren&#8217;t many jobs there, as is true in most of Spain. I worked for my parents t-shirt printing business. I started working at 13 so that I could make my own money, so I could buy my own boards. When my parents business wasn&#8217;t doing so good and had to close down, I could use what I learned from the t-shirt business to work elsewhere, at all kinds of jobs. It was tough man, but it&#8217;s normal there for young people to leave school and start working early. I was happy I could make my own money to buy my own boards and shoes for skating. I really fell in love with skateboarding.</p>\n<h3>I know you moved to Madrid later, why did you move and did you meet the Fernandez brothers in Corona Square there?</h3>\n<p>Before I moved, I was working very hard and didn&#8217;t have much time to skate. So actually I moved to Madrid to skate. Yes, that also where I met Alfonso and Jesus Fernandez, skating Corona Square.</p>\n<h3>And you decided to go to the States then to pursue the dream? Did you go to San Francisco as well as Los Angeles?</h3>\n<p>What happened is Alfonso was saving money to go to the States and we talked about it, and I was lucky I won a Vans contest in Spain and the prize was a ticket to the US. So I was really lucky as I wasn&#8217;t saving money like Alfonso for a plane ticket. So my first trip to the US was for 3 months, and Alfonso was also in the States with me. I went to SF for a month, San Diego for a month, and LA for about a month.</p>\n<h3>This was the same time J.B. Gillet came over to the States too right? And what about Jesus Fernandez?</h3>\n<p>Yes J.B. was here at the same time as our first trip. Our next trip back to the states was with Jesus as well, the three of us, Alfonso, Jesus and me.</p>\n<h3>To me, your L.A. County part was super influential, I still remember the orange VHS box cover. A lot of people might not also know you had a part in Neighborhood&#8217;s LaLa Land video from 1998. You turned pro for Neighborhood too right?</h3>\n<p>Thank you man. I turned pro for Julio De la Cruz&#8217;s Neighborhood Skateboards and had quite a number of pro models with Neighborhood. Actually, I was also the last pro on Neighborhood when everyone else had left. I stayed with the company to the end.</p>\n<p><em>Daniel in Neighborhood&#8217;s &#8220;La La Land&#8221; (1998).</em></p>\n<p><iframe width=\"1080\" height=\"810\" src=\"https://www.youtube.com/embed/k30w-YFlRNI?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p><em>Daniel in &#8220;LA County&#8221; (2000).</em></p>\n<p><iframe width=\"1080\" height=\"810\" src=\"https://www.youtube.com/embed/0St1FKalC7I?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<h3>You also rode for Stamina Clothing right?</h3>\n<p>Yes, I did ride for Stamina Clothing and Tracker Trucks. Back then, they were all one big company.</p>\n<p style=\"text-align: center;\"><em>Daniel with a superfast backtail at the West L.A. Courthouse.</em></p>\n<h3><strong><a href=\"https://itunes.apple.com/us/app/krak/id916474561?mt=8\" target=\"_blank\"><img class=\" size-medium wp-image-1375 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/IMG_9825.jpg\" alt=\"IMG_9825\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/IMG_9825.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/IMG_9825.jpg 150w, https://res.cloudinary.com/krak/image/upload/mag/uploads/IMG_9825.jpg 640w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></strong></h3>\n<h3>Where did you usually skate back when you were living in LA? Courthouse or USC?</h3>\n<p>I skated Courthouse a little bit back then but I skated the USC ledges a lot more, because it was close to where we were living, and you don&#8217;t need a car to get there.</p>\n<h3>What was it like living in the USC area? It&#8217;s gotten a bit better now but back then it must have been pretty different.</h3>\n<p>Man, it was ghetto. It was the hood. There was shootings in the street in front of where we lived. Like people were scared to come pick us up to go film because we were living in the hood. I heard that there was recently a student murdered there.</p>\n<h3>Yeah, the area has gotten better but it&#8217;s still not too safe, especially after dark.</h3>\n<p>It&#8217;s gnarly there! All kinds of people would be chilling out front of where we lived. But they were cool with us.</p>\n<h3>You, Alfonso and Jesus were riding Chocolate boards in the L.A. County video, this must have been after Neighborhood had ended? What happened with Chocolate?</h3>\n<p>Yes we were getting flowed Chocolate boards. Basically, there was a possibility we would get on the team. But around this time, in 2002 I went back to Spain, to Barcelona. And so did Jesus, but to Madrid. At that point I had lost all my US sponsors, since Neighborhood, Stamina and Tracker were all one big company. So when I went back to Spain I had no US sponsors. But I still skated, I didn&#8217;t care too much, I love skateboarding. But Lakai did help me out by sending me shoes, and I&#8217;m very thankful to them for that. Thanks Mike and Rick and everyone!</p>\n<h3>It must have been hard back in those days to come back and forth to the US without the athlete&#8217;s visa you can apply for nowadays?</h3>\n<p>Yes, it was difficult then. I had problems once and had to go apply for a visa in Spain, but crazy thing is they gave me a 6 months visa after that so it made it easier after for me.</p>\n<h3>Looking back, how different do you think your career would be if you had stayed on in the US? You were already doing stuff back then that still blows people away today.</h3>\n<p>Oh, very different. I had been in the US for 6 years by the time I left. It was a really long time. I think my skateboarding career would be very different. A lot of the things I was doing back in Barcelona when I went back, nobody saw, and I think if they did, things would be really different. But you know, I might not have made a lot of money now, but in the end I am happy with my life. I missed the Spanish way of life. If I had not moved back, I wouldn&#8217;t have gotten into Flamenco guitar. So that turned out to be a really good thing for me. I&#8217;ve been back in Barcelona for 13 years now, and it doesn&#8217;t feel like a long time compared to the US and Madrid. I know it sounds crazy but it doesn&#8217;t seem as long, I love the Barcelona lifestyle.</p>\n<h3>That brings us to the next topic, Flamenco guitar. Tell us a little how you got into it and I understand you now play professionally?</h3>\n<p>It&#8217;s funny, I actually first got interested in guitar again while living in LA, when a friend lent me his guitar. I used to play guitar when I was younger so it wasn&#8217;t too hard to pick it up again. So I was pretty good. When I moved back to Barcelona I got more into it, I met my teacher there and he told me that he taught at the Conservatoire and encouraged me to go there. So I applied and got in, and went there for 8 years.</p>\n<p style=\"text-align: center;\"><a href=\"https://itunes.apple.com/us/app/krak/id916474561?mt=8\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1376\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Daniel-Lebron-Day-in-the-life-1.png\" alt=\"Daniel Lebron Day in the life 1\" width=\"300\" height=\"169\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Daniel-Lebron-Day-in-the-life-1.png 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/Daniel-Lebron-Day-in-the-life-1.png 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/Daniel-Lebron-Day-in-the-life-1.png 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Daniel-Lebron-Day-in-the-life-1.png 1366w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<h3>8 years? Damn, that&#8217;s a long time. Did you have to take exams too?</h3>\n<p>Yes, it&#8217;s super long, that&#8217;s equivalent to going to music school up to high school. To get to college level takes a few more years, but for music, 8 years is already a lot. So for me who left school so early, it was a long time to study. Yes, we had to take exams like performance. I like Flamenco guitar so it was good for me. So I now have a career in Flamenco guitar as well, it&#8217;s good.</p>\n<h3>Do you teach as well? I know you recently went on a <a href=\"http://www.redbull.com/en/skateboarding/stories/1331699708579/skateboarding-meets-flamenco-chapter-01\" target=\"_blank\">Flamenco tour</a> with Jesus Fernandez and Julian Lorenzo to the Andalucia?</h3>\n<p>Yes, I can teach but I am more into performances. Jesus, Julian and I went on a tour to Andalucia where we got to skate in the day and play Flamenco in bars at night. It was a really fun tour, finish the day with music, food, friends and wine.</p>\n<h3>Was it hard to get noticed by US companies while you were back in Spain?</h3>\n<p>Many US companies were actually going to Barcelona a lot then(in the 2000s), so it wasn&#8217;t a problem to be noticed. They already knew who I was, the problem was I didn&#8217;t really want to move back to the US, which I would have had to do If I rode for a US company. I enjoyed being in Barcelona and my life there, so it was hard for me to leave and move back to the US.</p>\n<h3>I guess during those years, we didn&#8217;t get to see much of you in the US based skate media. What Spanish companies did you ride for then? Were there any US companies that you almost got on during this period?</h3>\n<p>I was still skating a lot, just maybe not filming as much as I could. I rode for Alai Skateboards in Spain during this time. And I rode for a French shoe company called Ion.  I also almost got on DGK at one point.</p>\n<h3>No way! You almost got on DGK?</h3>\n<p>(laughs) Yes, DGK. I was talking to Stevie back then and he was telling me that they were going to put me on the team. But it didn&#8217;t happen. It&#8217;s all good though.</p>\n<p><em>Daniel&#8217;s footage from when he moved back to Barcelona in 2002.</em></p>\n<p><iframe width=\"1080\" height=\"810\" src=\"https://www.youtube.com/embed/5O7NoxPSfOg?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<h3>That would have been really crazy though. But you did get on Michael Leon&#8217;s Stacks later? I remember your welcome to Stacks video, it was tight. And your first pro board with them had the nautical ship theme, I really liked that graphic. It&#8217;s sad when that came to an end, you and Sebo Walker were both killing it. And the brands visuals and graphic design was amazing.</h3>\n<p>Yes, I got on Stacks in 2011. It was strange when it ended. Maybe Sebo and I didn&#8217;t fit or something?</p>\n<p><em>The good folks over at <a href=\"http://www.quartersnacks.com\" target=\"_blank\">Quartersnacks</a> edited this reel of Daniel from some Nike SB trips in 2010 and 2011.</em></p>\n<p><iframe width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/UAisslPLRCw?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<h3>How and when did you get on Nike SB?</h3>\n<p>It was in 2006, so it&#8217;s been 9 years already. Reese (Forbes) spoke to Kasper (van Lierop) and I got on the team. It&#8217;s been good, they&#8217;ve really supported me and I recently got to film a part for them and travel to places like China. I want to go back to China again, maybe for a month. My trip there to film for the Nike SB video was only for 2 weeks.</p>\n<h3>Which Nike SB shoes do you currently like skating in?</h3>\n<p>I like the Project BA(Brian Anderson) and the P-Rods. I mainly skate the P-Rods and those.</p>\n<h3>Your Nike SB part was really well rounded. It had a good mix of everything, and you also had one of my favorite lines in the middle of the video, with the switch frontside 180 over the ledge, a perfect frontside heelflip on flat and then a fakie flip fakie back crooks. You were also riding boards from 3 different companies I think.</h3>\n<p>Thank you, I actually like that fakie flip fakie crook. Yes, I was riding a few different companies boards then as I was also between sponsors during some of the filming. Thanks to everyone who helped me out.</p>\n<p><em>Daniel&#8217;s Nike SB #notbadatall part (2013).</em></p>\n<p><iframe width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/W8WRWYK2X4g?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<h3>It&#8217;s good that you&#8217;re now on Boulevard, how long have you been on the team and how did that come about? Your first pro model is fittingly a guitar graphic. But your boards are still hard to find in the US stores Dani!</h3>\n<p>I&#8217;ve been on Boulevard for about a year now. It happened through Rob G and Nike SB. I&#8217;m very happy because it feels like family to me. We also have Danny Montoya, Danny Supa, Rodrigo Petersen, Carlos Iqui and Tiago Lemos and many homies. Yes, I was stoked my first pro model is a guitar graphic. I&#8217;m not sure why my boards are hard to find, maybe it&#8217;s available mainly in Europe?</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561?mt=8\" target=\"_blank\"><img class=\" size-medium wp-image-1380 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/2015-04-21-21.43.15.jpg\" alt=\"2015-04-21 21.43.15\" width=\"300\" height=\"225\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/2015-04-21-21.43.15.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/2015-04-21-21.43.15.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/2015-04-21-21.43.15.jpg 1080w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><em>Daniel in Boulevard Skateboard&#8217;s Spain tour.</em></p>\n<p><iframe width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/M7Ooxxpjdpw?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<h3>I had to call a ton of stores in LA before I found one (laughs). It was worth it though. Okay, we all want to know, what&#8217;s your setup right now?</h3>\n<p>I ride an 8.1&#8243; Boulevard deck, Independent 139 trucks (forged hollow with the hollow axles and kingpin and forged baseplates), 52mm Bliss Wheels, Swiss Bearings, Diamond 7/8&#8243; Hardware and Grizzly Griptape.</p>\n<h3>How did you get on Bliss Wheels? Was it through Daniel (Loren)?</h3>\n<p>Yes, through Daniel. I think they were hyped on my skating. My pro model wheel should be out soon.</p>\n<h3>That&#8217;s awesome news. Yeah they put out some good wheels, hard and grippy.</h3>\n<p>Yeah, they make super good wheels. Really backing them.</p>\n<p><em>Daniel&#8217;s line for Bliss Wheel Co.</em></p>\n<p><iframe width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/3NZODKSuO_o?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<h3>Okay, this is a question I really want to ask. How do you have frontside heels both regular and switch so good? What&#8217;s the secret behind them?</h3>\n<p>(laughs) I don&#8217;t know man. I guess I can do them pretty good both ways. I think it&#8217;s because I can do heelflips pretty well? But I can also do kickflips well so I don&#8217;t know man. I don&#8217;t think many people have both kickflips and heelflips good. (laughs)</p>\n<h3>So I guess I gotta practice. Okay, for all the skate visitors to Barcelona, what do you recommend they also check out aside from just going skating at the spots?</h3>\n<p>I think they can also try the culture and the museums, it&#8217;s a beautiful city and has so much art and culture. I think that&#8217;s one thing a lot of skateboard visitors miss. Come visit!</p>\n<p><em>Daniel&#8217;s &#8220;Barcelona Day in the life&#8221; from Ohlo de Peixe.</em></p>\n<p><iframe src=\"https://player.vimeo.com/video/95839130\" width=\"1080\" height=\"608\" frameborder=\"0\" title=\"Um dia na vida de Dani Lebron\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></p>\n<h3>Where do you usually skate in Barcelona?</h3>\n<p>Macba usually and Forum too. Both are only a few minutes from my place so it&#8217;s really easy to go skate there. Meet up at Macba and go to a different spot maybe later.</p>\n<p style=\"text-align: center;\"><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/Daniel-Lebron-Day-in-the-life-3.png\"><img class=\"alignnone size-medium wp-image-1373\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Daniel-Lebron-Day-in-the-life-3.png\" alt=\"Daniel Lebron Day in the life 3\" width=\"300\" height=\"169\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Daniel-Lebron-Day-in-the-life-3.png 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/Daniel-Lebron-Day-in-the-life-3.png 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/Daniel-Lebron-Day-in-the-life-3.png 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Daniel-Lebron-Day-in-the-life-3.png 1366w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<h3>How about here in Los Angeles? Where have you been skating?</h3>\n<p>Here in Cali I skate a lot at Cherry Park, and spots around Long Beach and Lake Forest. I also skated at Courthouse and Stoner Plaza too.</p>\n<h3>You must be happy to be going home after being here for 2 months.</h3>\n<p>Yes, I&#8217;m really looking forward to going home. It&#8217;s been a good time here but a long time away from Barci.</p>\n<p style=\"text-align: center;\"><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/2015-04-21-21.26.46.jpg\"><img class=\"alignnone size-medium wp-image-1377\" src=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/2015-04-21-21.26.46.jpg\" alt=\"2015-04-21 21.26.46\" width=\"225\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/2015-04-21-21.26.46.jpg 225w, https://res.cloudinary.com/krak/image/upload/w_768/mag/uploads/2015-04-21-21.26.46.jpg 768w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/2015-04-21-21.26.46.jpg 1080w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a></p>\n<h3>So before we wrap this up, any plans to come back to the US for a longer amount of time?</h3>\n<p>I am planning to come back for maybe 6 months at the end of the year with my girlfriend when she comes here to study. With my visa now, it&#8217;s easier. So I should be back soon to LA again. I will probably try to stay in K-town so I will be able to skate more of the spots downtown again.</p>\n<h3>All right, I think that wraps things up. Any thank yous and shout outs?</h3>\n<p>I want to thank my sponsors for all their support, <a href=\"http://www.blvdskateboards.com\" target=\"_blank\">Boulevard Skateboards</a>, <a href=\"http://www.independenttrucks.com\" target=\"_blank\">Independent Trucks</a>, <a href=\"http://www.blisswheelco.com\" target=\"_blank\">Bliss Wheel Co</a>, <a href=\"http://www.nike.com/us/en_us/c/skateboarding/nike-skateboarding-team\" target=\"_blank\">Nike SB</a>, <a href=\"http://www.bonesbearings.com\" target=\"_blank\">Bones Swiss</a>, <a href=\"http://www.diamondsupplyco.com/\" target=\"_blank\">Diamond</a>, <a href=\"http://www.grizzlygriptape.com/\" target=\"_blank\">Grizzly Grip</a> and <a href=\"http://ajprojectskateshop.blogspot.com/\" target=\"_blank\">AJ Project Skateshop</a> in Tenerife. I want to also thank my family, my girl and all my friends. Thank you everyone!!</p>\n<h3>Thanks Dani, safe travels home and see you soon! Cheers!</h3>\n<p>Thank you brother!</p>\n<p style=\"text-align: center;\"><em>Daniel with his Brazilian roomie.</em></p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561?mt=8\" target=\"_blank\"><img class=\" size-medium wp-image-1378 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/2015-04-21-21.34.30.jpg\" alt=\"2015-04-21 21.34.30\" width=\"300\" height=\"225\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/2015-04-21-21.34.30.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/2015-04-21-21.34.30.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/2015-04-21-21.34.30.jpg 1080w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<h3></h3>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n","author":"kev","categories":["interviews"],"tags":["aj-project-skateshop","alfonso-fernandez","alicante","barcelona","bliss-wheel-co","bliss-wheels","bones-swiss","boulevard-skatebaords","daniel-lebron","diamond"],"featuredImages":[{"file":"IMG_9825.jpg","width":640,"height":640,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/IMG_9825.jpg"}],"video":""}