{"id":3382,"date":"2018-08-01T14:03:35","date_gmt":"2018-08-01T21:03:35","slug":"florent-baraban-7plis","title":"Founders Interview: Florent Baraban of 7PLIS","content":"<p><span style=\"color: #ff0000;\"><strong>How did 7Plis start?</strong></span><br />\nFirst, I&#8217;m a passionate skater and an optician for a living, and 7PLIS started when I created my first tie clip and cufflink (2012) with recycled skateboards to wear at my job! So then I had the idea to make glasses, given my professional experience in optics.</p>\n<p><span style=\"color: #ff0000;\"><strong>Why skateboards?<br />\n</strong></span>Skateboards are colorful, easy to find and free. Each board is unique and the curves are perfect for eyewear.</p>\n<p><span style=\"color: #ff0000;\"><strong>How does your background in optometry help with what you&#8217;re doing now?<br />\n</strong></span>My background in optometry is very useful in terms of ergonomics and for all the measurements. Furthermore, optometric knowledge allows me to adapt a visual correction on all the 7PLIS frames.</p>\n<p><span style=\"color: #ff0000;\"><strong><img class=\"alignleft wp-image-3384\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-1.jpg\" alt=\"7PLIS process\" width=\"300\" height=\"456\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-1.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_197/mag/uploads/7plis-1.jpg 197w\" sizes=\"(max-width: 300px) 100vw, 300px\" />How long does it take to make a pair of glasses? What is the process?<br />\n</strong></span>It takes about 2 days to make a pair with a case and a little recycled glasses keychain (same board, same shape). First, I take off the grip of the board. Next, after having cut the face and the 2 arms, I refine them with various tools for about 3 hours.</p>\n<p>They must then be oiled in 5 different baths in order to saturate the wood moisture and ensure their durability. Unlike varnish, this technique allows the wood to retain its natural feel. Also, because the material is alive, it can continue to evolve on the face of the wearer, unlike a varnish which will freeze the wood evolution!</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you use every part of the board, or do you end up with some scrap wood?<br />\n</strong></span>Scrap wood allows me to create rings, cufflinks, tie clips, USB keys, earrings, camera shutter buttons, keychains, watches, etc&#8230; All the wood that isn’t used is recycled into paper to make my labels. So I think there is only about 5% woodfall which can be reduced to make paper, so I use it all!</p>\n<p><span style=\"color: #ff0000;\"><strong>How many different products can you make out of one board?<br />\n</strong></span>With one board I can make about 6 glasses, 2 watches, 10 rings, 10 cufflinks, 10 tie clips, 2 USB keys, and some earrings.. If everything is perfectly in its place, we can make lots of things with only one!</p>\n<p><img class=\"aligncenter wp-image-3389 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-6.jpg\" alt=\"7PLIS\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-6.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/7plis-6.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/7plis-6.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>You offer many different recycled skateboard products. Who is your biggest distributor?<br />\n</strong></span>My biggest seller is <a href=\"http://7PLIS.fr\" target=\"_blank\" rel=\"noopener\">7PLIS.fr</a> and an optician in the Marais district, Paris, France.</p>\n<p><span style=\"color: #ff0000;\"><strong>Once the product is complete, is it still connected in any way to the original board?<br />\n</strong></span>Yes, you can read the skateboard history on the box of each pair of glasses: the name of the skater, their best tricks, the spot where the board was used most, and the brand! On the back of each watch you can also see the name of the skater.</p>\n<p><img class=\"alignright size-medium wp-image-3385\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/7plis-2.jpg\" alt=\"7PLIS watches\" width=\"300\" height=\"200\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/7plis-2.jpg 300w, https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-2.jpg 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Your products include repurposed boards and bearings. Any ideas to include wheels or trucks in the future?<br />\n</strong></span>Yes! Right now there is already a handle with trucks and a card holder with wheels in my workshop, maybe some other ideas in the future!</p>\n<p><span style=\"color: #ff0000;\"><strong>What are your feelings about recycling/repurposing things in general?<br />\n</strong></span>I think that in general it&#8217;s a very good thing to recycle for the future of our planet. However, I often feel that recycling is done badly. That&#8217;s why the bottom line of my thinking is to prove that recycling can be premium and very well finished.</p>\n<p><span style=\"color: #ff0000;\"><strong>What is your biggest piece of advice for readers who want to start a brand/company?<br />\n</strong></span>Know what you bring different to the table from everyone else, and cultivate it!</p>\n<p><img class=\"aligncenter size-full wp-image-3388\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-5.jpg\" alt=\"7PLIS sunglasses\" width=\"680\" height=\"450\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-5.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/7plis-5.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>Last but not least, could you give us some info about yourself: Where are you from? Where do you live? When and how did you start skateboarding?<br />\n</strong></span>I&#8217;m a passionate French guy, 30 years old. I started skateboarding at 12 at a small village skatepark and in Nancy city (France) and never stopped. I also love snowboarding and I work at night in my little workshop at the bottom of my small family home garage. I worked as an optician for 3 years before embarking on the 7P adventure! Now I’ve lived in Seichamps, France (North East) for 7 years and when I was young I lived in French Guiana and Lebanon.</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 19 that shipped with the 3 Years <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["7plis","florent-baraban","interview","krakmag","recycled-skateboards"],"featuredImages":[{"file":"7plis-Flo.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/7plis-Flo.jpg"}],"video":""}