{"id":2782,"date":"2017-09-20T11:54:06","date_gmt":"2017-09-20T18:54:06","slug":"jacob-chaney-dizzy","title":"Founders Interview: Jacob Chaney of Dizzy Skate Co.","content":"<p><em>We jumped on the phone with Jacob Chaney, the ambitious kid behind <a href=\"http://www.dizzyskateco.com/\" target=\"_blank\" rel=\"noopener\">Dizzy Skate Co</a>. to find out how he started out making skate wax and what it&#8217;s like running a business as a 15 years old. k.</em></p>\n<p><span style=\"color: #ff0000;\"><strong>What time is it? Where are you right now?</strong></span><br />\nI am in Cincinnati, OH. Here it’s 4:26.</p>\n<p><span style=\"color: #ff0000;\"><strong>You gonna skate?</strong></span><br />\nI’m gonna skate in a minute probably.</p>\n<p><span style=\"color: #ff0000;\"><strong>Where do you skate usually?</strong></span><br />\nStreet. I have a little half-pipe in my backyard but I use that when I can’t go street-skate.</p>\n<div id=\"attachment_2786\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2786\" class=\"wp-image-2786 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-2.jpg\" alt=\"Dizzy - Jacob Chaney\" width=\"680\" height=\"454\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-2.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/dizzy-jacob-chaney-2.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2786\" class=\"wp-caption-text\">Jacob Chaney, kickflip. Photo: Sybilka Storie Photography</p></div>\n<p><span style=\"color: #ff0000;\"><strong>D you have your usual spot with the homies or do you change and go from one spot to another?</strong></span><br />\nThere is this one park where I go a lot. It’s called ‘The Bridge Project’. It’s under a highway and it’s like a DIY spot that these kids have been doing for like forever now. There are some quarter pipes and ledges and rails and curbs and stuff like that. So I chill out there.</p>\n<p><span style=\"color: #ff0000;\"><strong>So you don’t skate ramps or bowls, just street?</strong></span><br />\nI can do ramps and bowls but I prefer street-skating.</p>\n<p><em>(few minutes later&#8230;)</em></p>\n<p><span style=\"color: #ff0000;\"><strong>So you needed to pick up that call from your Dad I guess?</strong></span><br />\nHe’s taking me down to this other park in Kentucky, that&#8217;s is the state below me.</p>\n<p><span style=\"color: #ff0000;\"><strong>Where did you grow up? </strong></span><br />\nI grew up in Cincinnati, OH.</p>\n<p><span style=\"color: #ff0000;\"><strong>How’s the skateboarding scene?</strong></span><br />\nIt’s actually not big like California, but in this area this is still pretty big. We have a bunch of skaters and a lot of them skate for local teams around.</p>\n<p><span style=\"color: #ff0000;\"><strong>And how did you start?</strong></span><br />\nMy Dad used to skate so I pretty much picked it up from him.</p>\n<p><span style=\"color: #ff0000;\"><strong>That’s cool. So you started early I guess? </strong></span><br />\nYeah, around 6 or 7 years old.</p>\n<p><span style=\"color: #ff0000;\"><strong>How old are you right now? </strong></span><br />\n15 years old.</p>\n<p><img class=\"aligncenter size-full wp-image-2787\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-3.jpg\" alt=\"Dizzy - Jacob Chaney\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-3.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/dizzy-jacob-chaney-3.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/dizzy-jacob-chaney-3.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>How did you start Dizzy?</strong></span><br />\nI was chilling in school one day with a bunch of homies I was hanging out with. We were just thinking how funny would it be if we just started a business like just being kids that start a company and shock everybody. So first it kinda started off as a joke. And then I was like ‘well let’s have a name, let’s make some stickers, get a logo’ and I found the name, got a logo and made some stickers. Then I made a couple shirts just for my friends and stuff and I gave them some shirts and other people were like ‘oh that’s cool’.</p>\n<p>I wanted to make some wax but you can’t go to a skate shop and sell them this because they’ll be like ‘oh but what’s the difference between yours and every other kid that come here?’ So I was like, what’s the top 2 things that people skate and that’s curbs and barrier wall—there is a spot by my house where me and my friend took some concrete, like threw some concrete to the barrier wall to wallride. So I made a mold out of sheet metal and I actually still do it out of sheet metal. I’m not a big company yet. I melted it in a Crock-Pot, poured it on the mold, like in the shape of the barrier, and then I just popped them out. I made them singular and I just recently made a 10-foot mold to get enough of them knocked out for you guys. I cut ziplock bags and with the shape of the curb and then I put a sticker in it and I sealed them over the stove. I put it over the hot oven and then shrink wrap through the shape of the barrier (or the curb). I went to a couple skate shops and asked ‘would you guys be down to buy it?’ and they were like ‘for sure’. They bought it and it just got bigger from there.</p>\n<p>And then there was an art show that was going on a couple of months ago and I wanted to make something. Everything there has to be made of out of skateboards. It could be anything. So I was thinking what&#8217;s the top thing that people use? People watch videos on their phone so I made a phone stand; everybody drinks beers so I made a bottle opener etc…</p>\n<p>It kept blowing up and blowing up. Now I’m in the phone with you.</p>\n<p><img class=\"aligncenter size-full wp-image-2790\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-6.jpg\" alt=\"Dizzy - Jacob Chaney\" width=\"680\" height=\"383\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-6.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/dizzy-jacob-chaney-6.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>So you always kept that DIY spirit in every product you came up with. When did you start exactly?</strong></span><br />\nLike 2 years ago. And then my mom, she does internet marketing and builds website and stuff, she puts me in touch with her business advisor because we were pretty serious about it. Then my friends they don’t run it with me but they come by and helped me. Sort of a team practically.</p>\n<p><span style=\"color: #ff0000;\"><strong>How did your mom react? Like, you were 13 and came back home and said ‘let’s start a business’. I mean it’s pretty unusual.</strong></span><br />\nYeah (laughs). She was kinda shocked. She was like, ‘you realise that you can’t just say I wanna start a business; it’s a lot more commitment than you would think it is; you gotta have a website; you gotta know who to sell stuff to; you gotta market yourself; you gotta be a certain way to certain people; know how to talk to other people’ etc&#8230; And that’s where the business advisor came in. She was definitely shocked at first and she was like ‘let me tell you what this is exactly’. But I’m still into it and I still think it’s fun.</p>\n<p><span style=\"color: #ff0000;\"><strong>And were you still involved in school?</strong></span><br />\nWhat we did is she put me in home school. So now I can focus on that stuff cause I have more time.</p>\n<p><span style=\"color: #ff0000;\"><strong>You have a cool mum haha!</strong></span><br />\nYeah I’m pretty lucky.</p>\n<p><img class=\"aligncenter size-full wp-image-2788\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-4.jpg\" alt=\"Dizzy - Jacob Chaney\" width=\"680\" height=\"680\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-4.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/dizzy-jacob-chaney-4.jpg 150w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/dizzy-jacob-chaney-4.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>And how did the guys at the skate shop react?</strong></span><br />\nI kinda knew them for a little bit. I mean I’ve been there a lot to buy boards and stuff but they didn’t know I was about to start my own company but they were kinda down to support a local, whoever he is. So at the beginning the guy was just like, ‘let’s buy 5 of them and if I sell them I’ll ask for more’ and the first 5 of them sold the first month so the guy asked for 10 more and I gave him 10 more and now we’re up to 3 shipments.</p>\n<p><span style=\"color: #ff0000;\"><strong>Congrats man! Would you say right now that starting a company today, in the US, is easy?</strong></span><br />\nHum… kinda. Yes and no. It’s easy because you can market yourself and talk to anybody and they’ll understand it but it’s hard because sometimes you’ll get the people like ‘oh you&#8217;re just a kid and don&#8217;t know what you’re talking about’ and that&#8217;s hard. It depends who you’re talking to actually. But it makes me wanna push things even further and get out there more.</p>\n<p><span style=\"color: #ff0000;\"><strong>Are you happy now? Would you do it again?</strong></span><br />\nYeah for sure.</p>\n<p><span style=\"color: #ff0000;\"><strong>What would you do differently?</strong></span><br />\nI don’t really know. It just kinda fun.</p>\n<p><span style=\"color: #ff0000;\"><strong>So what would you say to kids who wanna start something now?</strong></span><br />\nI’d tell them think about it and make sure it’s really what you wanna do cause I had a friend one time who wanted to start a company and he just did it but didn’t really have a plan. He didn&#8217;t really know what he was doing. I tried to help him but he got overwhelmed because everyday he didn’t know what to do and was like, ‘what if this, what if that’. Now he’s medium successful and now he’s just overwhelmed. So I would just say ‘have a plan’ and don’t just do it to go into the wall.</p>\n<p><img class=\"aligncenter size-full wp-image-2789\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-5.jpg\" alt=\"Dizzy - Jacob Chaney\" width=\"680\" height=\"383\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-5.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/dizzy-jacob-chaney-5.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p><span style=\"color: #ff0000;\"><strong>What’s your plan? What’s next for you?</strong></span><br />\nMy plan is to get a mold way better than sheet metal cause that takes so much time. Probably find a manufacturer. Eventually get out of Ohio and move to California. That’s pretty much about it. Just go with the flow and see what happens.</p>\n<p><span style=\"color: #ff0000;\"><strong>So you wanna be in CA?</strong></span><br />\nYeah that’s where my dream place would be.</p>\n<p><span style=\"color: #ff0000;\"><strong>Have you already been?</strong></span><br />\nYeah I’ve been to LA area and Venice area a couple times.</p>\n<p><span style=\"color: #ff0000;\"><strong>You liked it?</strong></span><br />\nI loved it.</p>\n<p><span style=\"color: #ff0000;\"><strong>Ok, so you need to go. I’ve been truly amazed Jacob. Thanks for your time!</strong></span></p>\n<p>Cover image: Jacob Chaney. Photo: <a href=\"http://www.thestorieteller.com/\" target=\"_blank\" rel=\"noopener\">Sybilka Storie Photography</a></p>\n<h3><span style=\"color: #808080;\"><strong>A short version of this interview was originally featured in the printed KrakMag that shipped with the Old School <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> last year. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["dizzy-skate-co","interviews","jacob-chaney","krakbox","krakmag"],"featuredImages":[{"file":"dizzy-jacob-chaney-1.jpg","width":680,"height":452,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/dizzy-jacob-chaney-1.jpg"}],"video":""}