{"id":2992,"date":"2018-02-11T22:06:48","date_gmt":"2018-02-12T06:06:48","slug":"justin-gardner-bldg-active","title":"Founders Interview: Justin Gardner from BLDG Active","content":"<p><span style=\"color: #ff0000;\"><strong>What does BLDG stand for and what inspired the name?<br />\n</strong></span>BLDG stands for building. We’re building a bridge between science and sports, taking cutting edge science from hospitals directly to action sports athletes. We each have unique backgrounds but all have a deep-rooted love/obsession for action sports and the desire to build a company that is bold and disruptive.</p>\n<div id=\"attachment_2996\" style=\"width: 310px\" class=\"wp-caption alignleft\"><img aria-describedby=\"caption-attachment-2996\" class=\"size-full wp-image-2996\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/BLDG17_HydroGel_Front.jpg\" alt=\"BLDG Active HydroGel\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/BLDG17_HydroGel_Front.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/BLDG17_HydroGel_Front.jpg 150w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-2996\" class=\"wp-caption-text\">BLDG Active HydroGel</p></div>\n<p><span style=\"color: #ff0000;\"><strong>So there are three of you responsible for this brand and these groundbreaking products; who are you all, how did you all come together and what are your backgrounds that brought you to this point?<br />\n</strong></span>The three of us all had different professional backgrounds but would surf, skate, snowboard, rock-climb and travel together in our free time. My background is in the biomedical and regenerative medicine space; Jason spent the last 10 years <a href=\"https://www.spohnranch.com/\" target=\"_blank\" rel=\"noopener\">designing and building skate parks</a> all over the world and Mat was in digital marketing. I had been working on a project to launch a new technology using a molecule called HOCL into the hospital system and realized that it worked really well on the everyday issues I was dealing with as a surfer, skater, climber etc. I started to give samples to my friends and very quickly it became an essential in all of our packs no matter what we were getting into. Not only did it replace toxic generic products like Neosporin or peroxide but it filled a void that no other product could and did so in one little 3oz bottle. It was on a surf trip to the Maldives last year when over a few beers talking about how amazing this technology is that we decided to quit our jobs, build a team and start <a href=\"https://www.bldgactive.com/\" target=\"_blank\" rel=\"noopener\">BLDG Active</a>.</p>\n<div id=\"attachment_2997\" style=\"width: 310px\" class=\"wp-caption alignright\"><img aria-describedby=\"caption-attachment-2997\" class=\"wp-image-2997 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/BLDG17_Spray_Front.jpg\" alt=\"BLDG Active Repair Spray\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/BLDG17_Spray_Front.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/BLDG17_Spray_Front.jpg 150w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-2997\" class=\"wp-caption-text\">BLDG Active Repair Spray</p></div>\n<p><span style=\"color: #ff0000;\"><strong>How do you see skateboarders using BLDG products?<br />\n</strong></span>HOCL, our products active molecule, is what the human body naturally produces to internally kill bacteria. BLDG has replicated HOCL and put into a bottle so people can now externally treat all the damage skateboarding inflicts on their skin (cuts, scrapes, wounds, road rashes etc.) the same way their body does internally.</p>\n<p>Our products kill 99.9% of all bacteria within 15 seconds of contact and helps aid your body&#8217;s natural healing process. What’s really crazy is that it does all this while being 100% natural, 100% non-toxic, anti-biotic free, petroleum free, non-sensitizing (no sting) and completely safe for use around your eyes, ears, nose and mouth.</p>\n<p>As skater’s I think we can all agree that injury comes with the territory and is the inevitable reality of pushing boundaries, progression, and just all around going for it. Think about how many times you slammed and tore yourself up going after a big stair-set or hand-rail for the first time? When is comes to skateboarding it’s less about if you’re going to slam and more so about when. BLDG now gives skaters a healthier more effective way to treat these battle wounds that will not only disinfect but help you heal faster.</p>\n<p>Being injured sucks, this helps it suck a little less.</p>\n<p><span style=\"color: #ff0000;\"><strong>And is it true that it can also be used to treat sunburn and insect bites? So it’s got us covered on the mellow skate sessions as well?<br />\n</strong></span>Because HOCL reduces inflammation it works really well on things like insect bites and sunburns which are simply inflammation of the skin. We joke at the office it’s the WD40 of skin repair, it can work on the really gnarly cuts but also on the everyday stuff like sunburns and insect bites.</p>\n<p><span style=\"color: #ff0000;\"><strong>These products aren’t just good for our bodies either, they’re good for the world, right? Tell us about this and why it’s important to you.<br />\n</strong></span>Here at BLDG Active, we believe that “If you love something you have a duty to protect it” and we do that by creating environmentally friendly products.</p>\n<p>Products like Neosporin use petroleum which are both bad for you and the environment.  Our products use biodegradable materials that are healthier for you and for the environment.</p>\n<p>We are a 1% for the planet company. Being a 1% For The Planet Member means that your company donates 1% of all sales (not profits, top line sales) to environmental organizations on the frontlines doing the work.  We believe it is not only a cost of doing business, but also a company ethos to help protect the playgrounds that we all love.</p>\n<div id=\"attachment_2995\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2995\" class=\"wp-image-2995 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/bldg-Othello-Skatepark-24LR.jpg\" alt=\"Alex Lobasyuk, f/s smith. Photo: Bobby Escobedo\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/bldg-Othello-Skatepark-24LR.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/bldg-Othello-Skatepark-24LR.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2995\" class=\"wp-caption-text\">Alex Lobasyuk, f/s smith. Photo: Bobby Escobedo</p></div>\n<p><span style=\"color: #ff0000;\"><strong>Are you working on any new products at the moment? What exciting breakthroughs can we look forward to in the future?<br />\n</strong></span>Yes, probably top of the list and something that will be most intriguing to skaters is a surgical glue. We’ve all used superglue to close up cuts mid-session before but we know there are better options in hospitals that just haven’t been made available to consumers. There’s a lot of really amazing technologies used in hospitals that as consumers we don’t have access to. BLDG seeks to change that.</p>\n<p><span style=\"color: #ff0000;\"><strong>Sounds great! So that leaves us with one last important question: where can skaters get their hands on BLDG products?<br />\n</strong></span>Right now the best place is either on our website at <a href=\"https://www.bldgactive.com/\" target=\"_blank\" rel=\"noopener\">bldgactive.com</a> or on <a href=\"https://www.amazon.com/ACTIVE-Skin-Repair-Hydrogel-Antibacterial/dp/B0728B4R65\" target=\"_blank\" rel=\"noopener\">amazon</a>. We just launched in June so it will take a little while until we get in skate stores around the country.</p>\n<p><em>If you&#8217;ve tried out the BLDG Active product we included in the <a href=\"https://krakbox.com/shop/product/999371797\" target=\"_blank\" rel=\"noopener\">Cheers Krakbox</a> then feel free to pass on your feedback to Justin <a href=\"mailto:justin@bldgactive.com\">via email</a>. He&#8217;d love to hear what you think!</em></p>\n<p>Cover image: Ryan Chaney, blunt. Photo: Chris Spiegel</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 15 that shipped with the Cheers <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["bldg-active","interviews","justin-gardner","krakbox","krakmag"],"featuredImages":[{"file":"bldg-DM5A7158.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/bldg-DM5A7158.jpg"}],"video":""}