{"id":2119,"date":"2015-10-01T04:03:02","date_gmt":"2015-10-01T11:03:02","slug":"lucas-beaufort","title":"Artist Profile &#8211; Lucas Beaufort","content":"<h3><span style=\"color: #999999;\"><strong>The following interview was originally featured in the print Krak Mag issue 3 that shipped with </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>#3 in August 2015. Don&#8217;t want to miss the next issue of the print Krak Mag? Want to receive epic skateboarding product every two months? Check out the </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>now!<em><br />\n</em></strong></span></h3>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2126 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_243/mag/uploads/KrakMag3_cover.png\" alt=\"KrakMag3_cover\" width=\"243\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_243/mag/uploads/KrakMag3_cover.png 243w, https://res.cloudinary.com/krak/image/upload/mag/uploads/KrakMag3_cover.png 566w\" sizes=\"(max-width: 243px) 100vw, 243px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Tom Asta backside noseblunt shot by Chad Foreman, cover of our print Krak Mag #3.</em></p>\n<p>&nbsp;</p>\n<p><b>You may have seen Lucas Beaufort’s beautiful painted monsters gracing the covers of some of your favorite skateboard magazines over the past few years. Nothing short of prolific, Lucas has quickly carved a niche for himself through his unique artistic perspective, giving a new twist to each photo by juxtaposing each photo’s reality with his vibrantly colored fantastical monsters. We got the chance to interview Lucas about all things art when he worked on the special piece that graces the cover of the</b> <b>Krak Mag you’re now holding in your hands.  Read on to find out more about Lucas and his beautiful monsters. &#8211; HK</b></p>\n<p><span style=\"color: #ff0000;\"><b>HK: Hi Lucas, thanks for doing this! We&#8217;re hyped to have you work on Krak Mag #3’s cover. First up, for the benefit of those of our readers who may not be familiar with your work, tell us a little bit about yourself?</b></span></p>\n<p>Lucas: Lucas Beaufort, 34 year old French dreamer from Cannes, crazy about painting skate magazine covers and hanging with my little pug.</p>\n<p><span style=\"color: #ff0000;\"><b>This Krak Mag cover you worked on features your signature monsters chilling on the stairs by the hubba where Tom Asta backside noseblunts. Can you tell us a little bit about the process you go through when you work on each cover? Do you spend time sketching out possibilities for the photo or just go for it?</b></span></p>\n<p>When I paint on a photo, it’s either I feel it or not. It means that I can’t force myself to paint on anything. When I feel the pic, as was the case with Tom Asta, I don’t even need to sketch anything. I know in a second where to go, it’s like obvious to me. My little creatures are chilling on the stairs, it’s like you and me watching the homie kill it.</p>\n<p><span style=\"color: #ff0000;\"><b>How long did this piece take you? What medium did you use to paint in your monsters?</b></span></p>\n<p>It supposed to be a secret but I can tell you what medium I used for sure. So I use acrylic paint and a black marker.</p>\n<p><span style=\"color: #ff0000;\"><b>Turning now to the monsters themselves, I understand that the monsters are actually from your nightmares. Do you mind telling us a little more about these monsters? Do you have specific characters?</b></span></p>\n<p>Yeah man, my monsters are living in my head. They have a big apartment with a beautiful lake view. Sometimes I feel I am their puppet, their thing. I would like to control them but they can do anything with me.</p>\n<h3><span style=\"color: #999999;\"><strong><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2129 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dave-Bachinsky-shot-by-Liam-Annis.png\" alt=\"Dave Bachinsky shot by Liam Annis\" width=\"300\" height=\"209\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Dave-Bachinsky-shot-by-Liam-Annis.png 300w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Dave-Bachinsky-shot-by-Liam-Annis.png 891w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></strong></span></h3>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Dave Bachinsky hardflip shot by Liam Annis.</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>When was the first time you got the idea to modify photographs from skateboarding with your art and specifically your monster characters? </b></span></p>\n<p>They actually had the idea, not me. They wanted to exist in our world so they asked me if I could paint them on a cover. Did I have a choice? No! As I remember, it was 5 years ago.</p>\n<p><span style=\"color: #ff0000;\"><b>I think it&#8217;s an amazing idea, your art completely changes the feel of each photo as well, giving each piece a fresh new twist. What prompted you to experiment with such an approach to start with?</b></span></p>\n<p>Now I feel totally different. When I started to do it I felt controlled by them. Now, I feel it’s pretty awesome and I love doing it.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-2124\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/shot-by-Denis-Martin.jpg\" alt=\"shot by Denis Martin\" width=\"300\" height=\"212\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/shot-by-Denis-Martin.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/shot-by-Denis-Martin.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/shot-by-Denis-Martin.jpg 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/shot-by-Denis-Martin.jpg 1750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a> <em>Dee Ostrander frontside 5-0 shot by Dennis Martin.</em></p>\n<p><span style=\"color: #ff0000;\"><b>Let&#8217;s turn to your skateboarding background. I understand you actually refer to yourself as a skate rat. I back that! When did you start skateboarding? And what got you into skateboarding in the first place?</b></span></p>\n<p>It’s big indeed. I think I was 7 or 8. My mum bought me this plastic skateboard with a strange shape hahah. I was sitting on my knee and I was stoked on it. Even if I was small it was already big on my head.</p>\n<p>It’s strange to say but I knew that skateboarding would be something special in my life. I had a real skateboard at 13 and I’m still doing it even if I’m 34. Big ups Mariano, Daewon, Koston, Reynolds!</p>\n<p><span style=\"color: #ff0000;\"><b>What was your first setup?</b></span></p>\n<p>It was a New Deal Matt Milligan I think.</p>\n<p><span style=\"color: #ff0000;\"><b>New Deal? Damn, haven’t heard that name in a long while. I had a 9-ply New Deal Kenny Reed back in the day! Who were your favorite pros growing up?</b></span></p>\n<p>I think my favorite pro back in the day was Donny Barley or Ricky Oyola.</p>\n<p><span style=\"color: #ff0000;\"><b>That’s some East Coast influences for sure! What do you normally skate? Street or tranny? What&#8217;s your favorite skate spot?</b></span></p>\n<p>Street man! I’ve never really enjoyed transitions. I went to San Francisco a couple of years ago so you can imagine how stoked I was to see Pier 7.</p>\n<p><span style=\"color: #ff0000;\"><b>Pier 7 during the late 90s early 2000s was an amazing era in skateboarding. I know you&#8217;re a big fan of 90s skate videos, what are your favorite skate videos from the 90s?</b></span></p>\n<p>I am a big fan of 90s skate videos ! I remember I was 15 in 1996 and at that time a skate video was a real event. My friend and I were so excited to see new stuff from the US. Eastern Exposure Zero was probably my biggest memory.</p>\n<p><span style=\"color: #ff0000;\"><b>Eastern Exposure is definitely among my favorites. I still love Jahmal’s part in Underachievers with his kickflip back tail stall on that volcano at Mass General Hospital. How about today, what&#8217;s your favorite video in the last 5 years? Favorite video part?</b></span></p>\n<p>Dude, there are so many! I really loved the Cinematographer project (TWS video) / Alien part. To me it’s probably the sickest video part ever.</p>\n<p><span style=\"color: #ff0000;\"><b>That section was epic! Did you skate during the small wheels, big pants era?</b></span></p>\n<p>Yeah I used to skate baggy pants and not so tiny 51 mm wheels, but the boards were really narrow, 7.5” or something.</p>\n<p><span style=\"color: #ff0000;\"><b>Haha, yeah I remember those days, those tiny boards, 7.625” was all I rode back then. Who’s skateboarding hypes you up right now?</b></span></p>\n<p>Tyler Bledsoe without the sunglasses and Jordan Trahan.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah, they’re both super underrated. Jordan’s got one of the most amazing kickflips on flat. Turning to skateboard graphics, it&#8217;s almost like there&#8217;s a new resurgence in deck graphic art again now with more companies focusing on stronger art direction as opposed to purely logo driven graphics. What are some of your favorite skateboard graphics from the 90s?</b></span></p>\n<p>In the 90s I remember this deck from 101, it was a pro model Clyde Singleton, I was so stoked to have it.</p>\n<p><span style=\"color: #ff0000;\"><b>What about today?</b></span></p>\n<p>Today I have to say that Jacob Ovgren is doing good shit with <a href=\"http://www.polarskateco.com\" target=\"_blank\">Polar</a>.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah, Polar is killing it in the graphics department,  definitely pushing the boundaries with their graphic direction. In your opinion, which company had the best graphics, during the 90s?</b></span></p>\n<p>101.</p>\n<p><span style=\"color: #ff0000;\"><b>Yeah, that’s a good answer. Natas was killing it with those graphics! So who are your favorite artists in skateboarding?</b></span></p>\n<p>Michael Sieben, Jacob Ovgren, Todd Bratrud.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-2122\" src=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/Kingpin.jpg\" alt=\"Kingpin\" width=\"225\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_225/mag/uploads/Kingpin.jpg 225w, https://res.cloudinary.com/krak/image/upload/w_769/mag/uploads/Kingpin.jpg 769w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/Kingpin.jpg 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Kingpin.jpg 1804w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a> <em>João Allen gap to frontboard shot by João Mascherenas.</em></p>\n<p><em><span style=\"color: #ff0000;\"><b>What made you decide to get more into art?</b></span></em></p>\n<p>I think that it was in me for ages but unfortunately I only realized it when I was 25. Please, give me a magic wand to change that.</p>\n<p><span style=\"color: #ff0000;\"><b>Haha, we all wish we had a magic wand or a time machine sometimes. Outside of skateboarding, who influences your art?</b></span></p>\n<p>Nature, trees, and horror movies. The first Freddy Krueger &#8220;A nightmare on Elm Street&#8221; is still in my head!</p>\n<p><span style=\"color: #ff0000;\"><b>I guess that explains the monsters in your nightmares. How did you get involved in working on covers for skate magazines?</b></span></p>\n<p>I’m a big collector of skateboard mags. I have the first TWS, Thrasher and Slap at home. My collection 5 years ago was insane, with more than 300 mags. When I started to paint on skate mags I used to send it to each publication. Now I feel lucky because I have a subscription to all the skate mags you can imagine.</p>\n<p>Europe, Asia, US even South Africa. Big up Brendan Body over at Session Skateboarding Magazine!</p>\n<p><span style=\"color: #ff0000;\"><b>What’s the favorite cover you&#8217;ve worked on? And aside from covers, where can we view your other work?</b></span></p>\n<p>I don’t have a favorite one, they are all different and represent a different part of myself. You can see my stuff on my Instagram (<a href=\"https://instagram.com/lucas_beaufort/\" target=\"_blank\">@lucas_beaufort</a>).</p>\n<p><span style=\"color: #ff0000;\"><b>What would you say influences your art?</b></span></p>\n<p>My mum but especially my wife. She always pushes me to keep it up!</p>\n<p><span style=\"color: #ff0000;\"><b>How did your art gain a following in skateboarding? Was there a particular piece that really got things going for you?</b></span></p>\n<p>I’m just a normal dude passionate about it. I guess people realized it.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2130 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_243/mag/uploads/Jon-Consentino-shot-by-Micael-Kazimierczuk.png\" alt=\"Jon Consentino shot by Micael Kazimierczuk\" width=\"243\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_243/mag/uploads/Jon-Consentino-shot-by-Micael-Kazimierczuk.png 243w, https://res.cloudinary.com/krak/image/upload/mag/uploads/Jon-Consentino-shot-by-Micael-Kazimierczuk.png 501w\" sizes=\"(max-width: 243px) 100vw, 243px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Jon Cosentino kickflip shifty shot by Micael Kazimierczuk</em></p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Can you tell us a bit more about the LB project you&#8217;re doing in the US?</b></span></p>\n<p>I launched The LB Project in Europe first. The idea was to bring artists together to support Skateistan.</p>\n<p>The US edition is gonna start on September 25 at Escapist and will end in June 2016 at <a href=\"http://theberrics.com\" target=\"_blank\">The Berrics</a>.</p>\n<p>This new edition will support the Harold Hunter Foundation. Check out <a href=\"http://www.the-lbproject.com\" target=\"_blank\">www.the-lbproject.com</a> for more details.</p>\n<p><span style=\"color: #ff0000;\"><b>What about your role as an art ambassador for Filament? How’d that come about?</b></span></p>\n<p>A year ago, Tim Gavin (Filament’s co-founder) contacted me about becoming an art ambassador.</p>\n<p>I felt honored so of course I accepted. The shoes are good and the future promises to be even better.</p>\n<p><span style=\"color: #ff0000;\"><b>What exactly do you do in that role?</b></span></p>\n<p>We are talking about a special line with a shoe, tee, and a hat.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-2123\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Lucas_Beaufort_Profile.jpg\" alt=\"Lucas_Beaufort_Profile\" width=\"300\" height=\"200\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/Lucas_Beaufort_Profile.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/Lucas_Beaufort_Profile.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/Lucas_Beaufort_Profile.jpg 1080w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><b>What advice do you have for budding artists in skateboarding?</b></span></p>\n<p>Stay true to yourself and work hard.</p>\n<p><span style=\"color: #ff0000;\"><b>Thanks for doing this interview, Lucas! Looking forward to seeing more of your amazing work in the future.</b></span></p>\n<p><span style=\"color: #999999;\"><em>Liked this interview? Check out the print <span style=\"color: #ff0000;\">Krak Mag</span> in each <span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a></span>  for more great content!</em></span></p>\n","author":"kev","categories":["interviews"],"tags":["101","artist","filament","krak-mag","lucas-beaufort","new-deal","the-lb-project-krakbox","tim-gavin"],"featuredImages":[{"file":"KrakMag3_cover.png","width":566,"height":700,"mime_type":"image/png","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/KrakMag3_cover.png"}],"video":""}