{"id":1078,"date":"2015-03-03T20:20:52","date_gmt":"2015-03-03T20:20:52","slug":"new-product-introducing-the-krakbox","title":"New Product: Introducing the KrakBox","content":"<p><em>Today is a big day at <a href=\"http://www.skatekrak.com/\" target=\"_blank\">Krak</a>. Our entire team has been working super hard to bring you our newest product, the <a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a>!! Here&#8217;s a brief introduction to what our KrakBox is, and what it can do for you!</em></p>\n<p><a href=\"http://box.skatekrak.com\" target=\"_blank\"><img class=\" size-medium wp-image-1084 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/KrakBox-Mag-Article-2.png\" alt=\"KrakBox Mag Article 2\" width=\"300\" height=\"142\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/KrakBox-Mag-Article-2.png 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/KrakBox-Mag-Article-2.png 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/KrakBox-Mag-Article-2.png 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/KrakBox-Mag-Article-2.png 1340w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<h3>What&#8217;s a KrakBox and how does it work?</h3>\n<p>KrakBox is a monthly subscription box designed by skateboarders, curated by skateboarders, for skateboarders. It’s a discovery box, bringing you the best of skateboarding culture, gear and apparel, right to your doorstep, every month. Once you&#8217;ve signed up, each month we cook up your surprise and you get your KrakBox delivered right to your doorstep at the end of the month. You unwrap your box, get stoked, and go skate! It&#8217;s really that simple. The KrakBox is also great as a gift that just keeps giving for that someone you know who loves skateboarding!</p>\n<p>We are currently offering 1 month, 3 month, 6 month and 1 year <a href=\"https://krakbox.cratejoy.com/subscribe/20427321_KrakBox\" target=\"_blank\">subscriptions</a> starting with delivery at the end of March 2015. The longer your subscription plan, the more you save! For now, we are only offering this to U.S. subscribers, but stay tuned as we work to expand the KrakBox globally.</p>\n<h3>What&#8217;s in the KrakBox?</h3>\n<p>Hand-picked, awesome skateboarding products. From gear(mounting hardware, bearings, griptape, wheels and more) to apparel and accessories(t-shirts, hats, beanies, wallets), from collector&#8217;s item magazines to limited edition gadgets, every month you&#8217;ll discover a bunch of surprises curated with passion by our team of skateboarders around the world. You may even get to try new products before they are officially launched!</p>\n<h3>Why the KrakBox?</h3>\n<p>We all eat, sleep and breathe skateboarding. And we here at Krak believe that skateboarders and skateboarding brands, from local heroes to your favorite companies, have so much to offer. They are why our culture thrives. We don’t want to replace your favorite skateshop, we are not here to promote and sell our own brands and we won’t fill our box with free samples we obtained from a contest. No bullshit. Ever. We want to create an opportunity for brands to promote, distribute and test their products differently. We back the brands and the shops that support skateboarding!</p>\n<p>With the KrakBox, you&#8217;ll get to discover and try something new from skateboarding every month. Who doesn&#8217;t love a surprise? Get ready to be hyped!</p>\n<h3>Where do I learn more?</h3>\n<p>You can learn more from the <a href=\"http://box.skatekrak.com/\" target=\"_blank\">KrakBox site</a>, and we&#8217;ve put together a FAQ <a href=\"https://krakbox.cratejoy.com/faq\" target=\"_blank\">here</a>. And please don&#8217;t hesitate to get in touch with us at <a href=\"mailto:box@skatekrak.com\" target=\"_blank\">box@skatekrak.com</a> if you have any other questions or feedback. We always love hearing from you!</p>\n<h3>I&#8217;m ready to subscribe, where do I go? Give as a gift?</h3>\n<p>We wanted to keep it simple so we made it accessible with an easy three-click process. If you think this is for you, or if you know someone who would love this, you can subscribe or give this as a gift <a href=\"https://krakbox.cratejoy.com/subscribe/20427321_KrakBox\" target=\"_blank\">here</a>.</p>\n<h3>Tell all your friends, now go skate!!</h3>\n<h3>The Krak Team.</h3>\n","author":"kev","categories":["box"],"tags":["krakbox","new-product","skateboarding"],"featuredImages":[{"file":"KrakBox-Mag-thumbnail-2.png","width":903,"height":601,"mime_type":"image/png","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/KrakBox-Mag-thumbnail-2.png"}],"video":""}