{"id":2875,"date":"2017-10-09T19:01:23","date_gmt":"2017-10-10T02:01:23","slug":"push-periodical-bright-moments-richard-hart","title":"Push Periodical x Bright Moments: Interview with Richard Hart &#038; Zach Chamberlain","content":"<p><em>We were psyched to talk to two very creative minds for issue 10 of KrakMag. Richard Hart is the great SF based photographer who put together the insane work behind Push Periodical. He teamed up with VX master Zach Chamberlain to produce the Bright Moments video which we included in the SF-Tokyo KrakBox. Discover a bit more about Richard and Zach below. k.</em></p>\n<p><span style=\"color: #ff0000;\"><strong>Where are you from initially?<br />\n</strong></span><strong>RH:</strong> I’m from a little village in England. It’s quiet, there are horses hanging about.<br />\n<strong>ZC: </strong>I&#8217;m an Oregonian.</p>\n<p><span style=\"color: #ff0000;\"><strong>When did you move in SF?<br />\n</strong></span><strong>RH: </strong>About a century ago.<br />\n<strong>ZC:</strong> August 22, 2006</p>\n<p><span style=\"color: #ff0000;\"><strong>Why?<br />\n</strong></span><strong>RH: </strong>Because of skateboarding. SF was definitely the place to be, if you skated in the mid-90’s.<br />\n<strong>ZC:</strong> SF beckoned me with its golden hills and better weather.</p>\n<p><span style=\"color: #ff0000;\"><strong>Are you happy in this city now? Do you plan to stay there?</strong></span><br />\n<strong>RH: </strong>I’ve never intended to stay here, to be honest, but somehow it happened; and there are much worse places to accidentally end up.<br />\n<strong>ZC:</strong> I&#8217;m happier than ever in SF despite many drawbacks of the city being a technology hub. I only bring it up because that might eventually be what makes me have to move.</p>\n<p><span style=\"color: #ff0000;\"><strong>We could totally feel from the outside that SF really inspires you and your work. Could you tell us what&#8217;s so special about this city?</strong></span><br />\n<strong>RH: </strong>There is a creative energy here, if you can tap into it. Historically, SF has always been full of artists and writers and weirdos and hippies and punks and skaters and so on. Nowadays it’s a bit different, but the energy is still there somewhere. And visually SF has a lot of character too.<br />\n<strong>ZC:</strong> From anyone&#8217;s front door in SF there&#8217;s countless things to skate in just a few blocks or on the way to any daily means of living.  If you have an eye for little trinkets to cruise or fast hill bombs it&#8217;s all in easy reach.</p>\n<p><iframe src=\"//video.grindnetworks.com/embed/j-y3oKeQw\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><strong>I also feel that there is an old SF and a new one. I mean this city was probably the epicenter of the whole community back in the 90&#8217;s but that changed, right? Like in the early 2000 probably? Can you feel the difference yourself? What happened in fact?<br />\n</strong></span><strong>RH: </strong>Yes, I lived through all of that I suppose. The 90’s were a vibrant time with lots of people moving here. This had a lot to do with ‘<a href=\"https://www.youtube.com/watch?v=tTjhnlIRdKY\" target=\"_blank\" rel=\"noopener\">A Visual Sound</a>’ and the first FTC video and EMB (then Pier 7). Then in the 00’s, it became such a bust and a lot of the spots got knobbed, so it all died down and people moved away. Then there seemed to be a bit of a lull (or maybe it was just that I wasn’t too involved in skating for a bit). But now there’s a whole new generation of skaters here, and a lot going on again.<br />\n<strong>ZC:</strong> I&#8217;m not that old to have lived it here.  The 90s internet Silicon Valley boom stirred things up and then in the 2000&#8217;s it started booming again but this time the young people all figured out living in Silicon Valley (south of SF) basically sucks compared to SF. So now rent is pretty wild.</p>\n<p><span style=\"color: #ff0000;\"><strong>When I think about the SF city center now, I also have in mind all the insane skate-stoppers for instance (like the ones we see on the banks in front of the US District Court Clerk on Golden Gate Av.) but that being said, the skate community there seems to be more active than ever, what&#8217;s happening? Are those policies boosting your creativity and motivation?<br />\n</strong></span><strong>RH: </strong>The scene is thriving again; I think it has to do with being forced to skate more creatively. Not skating the ‘spots’ (mostly gone), but finding the cutty stuff. It’s harder work but more rewarding, and that stuff looks better anyway.<br />\n<strong>ZC:</strong> Yeah there are a lot of nobs in downtown. It&#8217;s a mess of &#8217;em. Sometimes the nob is a spot. Then they nob the nob and it makes something else to skate. On the other side its a paradise here for weather and people are still cool all over compared to a ton of places. Cops can&#8217;t be super bothered by skaters most of the time.</p>\n<p><span style=\"color: #ff0000;\"><strong>After all, would you still encourage skaters to come to SF? Despite the rise of the costs of living, the policies, the tech companies HQs and so on?</strong></span><br />\n<strong>RH: </strong>Skaters should always try and visit SF. The character of the place may be changing, and the rent prices getting crazy, but SF will always have the hills.<br />\n<strong>ZC:</strong> Anywhere you wanna go, check it out. SF is worth checking out in the least. Living anywhere in a new place can be hard. But yeah check it out here and then move here for a bit if ya dig it.</p>\n<p><span style=\"color: #ff0000;\"><strong>What should be the first few stops/things to do for a skater who lands there? Any must-skate spot in the city where everyone starts the day?</strong></span><br />\n<strong>RH: </strong>To warm up/meet up, go to the Island (by Embarcadero) or the Waller ledges (by the park) or the newish Duboce skatepark. Then it’s all about cruising around. Maybe head to the Avenues in the daytime and Downtown at night. Also, everyone should go to Fort Miley once.<br />\n<strong>ZC:</strong> Emb, the island, pier 7 then head over to northbeach grab some pizza at golden boy and a beverage in Washington park a block away. Then skate to the mission through the Stockton tunnel. Find little stuff to hit on the way. Get a burrito.</p>\n<div id=\"attachment_2878\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-2878\" class=\"size-full wp-image-2878\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/push-richard-hart-2.jpg\" alt=\"Fox, Nawrocki &amp; Jones in Budapest. Photo: Richard Hart\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/push-richard-hart-2.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/push-richard-hart-2.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-2878\" class=\"wp-caption-text\">Fox, Nawrocki &amp; Jones in Budapest. Photo: Richard Hart</p></div>\n<p><span style=\"color: #ff0000;\"><strong>You’ve been working together on something special lately, right? Could you tell us more about it?<br />\n</strong></span><strong>RH:</strong> Zach and I just did a cool project together – the Push Partial World Tour, which took us to Paris, Bristol and Budapest. We had Chris Jones, Taylor Nawrocki, Connor Kammerer and Glen Fox with us. So the next mag (<a href=\"http://www.pushperiodical.com/shoppe/i1ipdmd07o8la1w1700g9u733hucag\" target=\"_blank\" rel=\"noopener\">PP6</a>) will be devoted to that trip, and we’ve just finished an edit of the footage which will be online when the mag comes out. I’m stoked on both.<br />\n<strong>ZC:</strong> Richard and I are always cooking something up!</p>\n<p><span style=\"color: #ff0000;\"><strong>Any more plans for the end of the year?<br />\n</strong></span><strong>RH: </strong>I’m about to go and meet the Traffic team in Chicago.<br />\n<strong>ZC:</strong> I&#8217;m headed to Japan on a Northern Co. Trip. And then Richard and I are putting together a partial world tour 2 soon.</p>\n<p><span style=\"color: #ff0000;\"><strong>What could we wish you?<br />\n</strong></span><strong>RH: </strong>A Merry Christmas and a Happy New Year. Same to you.<br />\n<strong>ZC:</strong> Wish that I come up with something brilliant that stops world suffering.</p>\n<p><span style=\"color: #ff0000;\"><strong>Thanks guys!</strong></span></p>\n<p><iframe src=\"https://player.vimeo.com/video/189488912\" width=\"640\" height=\"469\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">Cover image: Matt Field, kickflip. Photo: Richard Hart</span></p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 10 that shipped with the <a href=\"https://krakbox.com/shop/product/538789581\" target=\"_blank\" rel=\"noopener\">SF-Tokyo KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"http://box.skatekrak.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["bright-moments","interviews","krakmag","push-periodical","richard-hart","san-francisco"],"featuredImages":[{"file":"push-richard-hart-1.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/push-richard-hart-1.jpg"}],"video":""}