{"id":3173,"date":"2018-04-09T16:50:59","date_gmt":"2018-04-09T23:50:59","slug":"stinky-socks","title":"Founders Interview: Risto Petkov of Stinky Socks","content":"<p><span style=\"color: #ff0000;\"><strong>What‘s the story behind the company? When did you start?<br />\n</strong></span>Everything started from our Ninja Squad crew, a bunch of us that would hang and ride together. That started around 2002. Then around 2008, we started NS Distribution, just because we couldn’t find brands that related to us on the market here in Bulgaria. We had a bunch of sponsors, but they were just making us rep stuff that we didn’t like. So we started to distribute a couple brands like Ashbury Eyewear and Airblaster outerwear from US to Bulgaria and it was fun. So in 2011, we thought that we might as well just start something that is ours and that represents how we see snowboarding and skateboarding, and that’s how <a href=\"http://www.stinkyfamily.com/tag/skate/\" target=\"_blank\" rel=\"noopener\">Stinky Socks</a> was born.</p>\n<p><span style=\"color: #ff0000;\"><strong>Why did you focus on snowboarding/skateboarding?<br />\n</strong></span>I would say because it’s what we know, and it’s what makes us feel alive. I don’t know anything about golf or basketball, and really don’t want to mess with fields that don’t relate to us. When we work on Stinky we get inspired by what we do in our actual life. It represents us and what we are.</p>\n<p style=\"text-align: left;\"><span style=\"color: #ff0000;\"><strong>Why socks?<br />\n</strong></span>Well we were poor kids and we wanted to have a brand that’s related to snowboarding and skateboarding. So pressing boards or making trucks wouldn’t work for us, ‘cause we didn’t have the funds. Making t-shirts and hats also wasn’t an option, because everyone does that and we weren&#8217;t as good as the rest of the competition. So that is how we ended up with socks. Also, we wanted to be a global brand, and shipping around the world can be quite expensive, so we needed something really small and cool.</p>\n<p><span style=\"color: #ff0000;\"><strong>What inspired the name?<br />\n</strong></span>We wanted to have a name that is both related to the product and has meaning in Bulgarian and English. It does sound pretty impossible. We all know what Stinky means in English which relates to the product, but in Bulgarian, “stinky” is a slang word for change (quarters and dimes), so we thought that’d be cool.</p>\n<p><span style=\"color: #ff0000;\"><b>Socks are so important for skateboarders/snowboarders. What makes Stinky Socks good for riders?<br />\n</b></span>Stinky is good for everyone! We do have a unique treatment of the yarn that makes the sock softer and at the same time keeps your feet fresh for longer. We also have a special anti-moisture treatment that removes the moisture from your feet if you are an active person.</p>\n<p><iframe src=\"https://player.vimeo.com/video/160677316\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start\">﻿</span></iframe></p>\n<p><span style=\"color: #ff0000;\"><b>What&#8217;s more important, function or fashion?<br />\n</b></span>I’m not much of a fashion person, I prefer the word ‘style’. It’s perfect when there is a good mix; good function and still stylish.</p>\n<p><span style=\"color: #ff0000;\"><b>Do you have plans to expand to underwear or are you only focused on socks for now?<br />\n</b></span>We will stay a sock only brand, we don’t want to lose focus on our one product. We are always down to run collabs with other brands, so that will give us some experience with other products. But that’s it for now.</p>\n<p><span style=\"color: #ff0000;\"><b>As a brand, what does Stinky Socks value?<br />\n</b></span>We value the people that support us, and the people that are part of our family. We would do everything for them. It doesn’t matter if the brand gains any profit as long as we are able to help a friend.</p>\n<p><span style=\"color: #ff0000;\"><b>You use the term &#8216;family&#8217; often. What does it mean to you?<br />\n</b></span>It means a lot, as cheesy as it may sound, but we are family with the people that are part of Stinky. I care about everyone that’s involved in Stinky and I really want them to know that. And I for sure hate the word “team” and I really wanted to use something else. Teams are in basketball, soccer, or at the Olympics.</p>\n<p><span style=\"color: #ff0000;\"><b>Speaking of the Olympics, do you think that skateboarding is ready for the world stage?<br />\n</b></span>The Olympics was a good idea initially when it was created, but that was centuries ago. Now it&#8217;s just a bunch of corruption and trying to make money. I don&#8217;t back the Olympics at all, never been a competition guy and I don&#8217;t think skateboarding has a spot at this event. I’d rather watch a game of S.K.A.T.E at the plaza, that&#8217;s for sure a better show for me.</p>\n<p><span style=\"color: #ff0000;\"><b>I hear you and <a href=\"https://www.instagram.com/lucas_beaufort/?hl=en\" target=\"_blank\" rel=\"noopener\">Lucas Beaufort</a> are friends.. how did you meet?<br />\n</b></span>I actually met him at a trade show in Berlin, 5 or 6 years ago. But I think we were emailing a couple of years before that. One of my friends introduced me to his art and then I think I bought one of Lucas’ first books. He personally sent me a “thank you” email and I got stoked, and that’s how it started I guess.</p>\n<p><span style=\"color: #ff0000;\"><b>How do you relate to the <a href=\"https://skateboarding.transworld.net/videos/devoted-documentary-skateboard-media/\" target=\"_blank\" rel=\"noopener\">DEVOTED documentary</a>?<br />\n</b></span>I was contributing with a few of my friends here in Bulgaria a while ago, helping them with some stuff while they were producing a snowboarding print magazine. So I know what it takes to make a good magazine and how much effort it takes. On the other side, I still remember the mid 90s when the only information that we were able to get from the snowboarding/skateboarding industry was through the magazines. And believe me, those days there would only be one copy of a magazine in my town, and if you are the last one to get it, it was likely that all the pages would be ripped off already and hung on someone’s wall. So definitely the magazines and the VHS tapes were our source of inspiration and that was what formed us. Not only as snowboarders, but as people.</p>\n<div id=\"attachment_3177\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/DevotedxStinky_Front_Small.jpg\"><img aria-describedby=\"caption-attachment-3177\" class=\"wp-image-3177\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/DevotedxStinky_Front_Small.jpg\" alt=\"Devoted x Stinky Socks \" width=\"680\" height=\"877\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/DevotedxStinky_Front_Small.jpg 428w, https://res.cloudinary.com/krak/image/upload/w_233/mag/uploads/DevotedxStinky_Front_Small.jpg 233w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></a><p id=\"caption-attachment-3177\" class=\"wp-caption-text\">Devoted x Stinky Socks<b style=\"color: #ff0000; font-size: 16px;\"></b></p></div>\n<p><b style=\"color: #ff0000; font-size: 16px;\">What are your thoughts on printed media in skateboarding?<br />\n</b><span style=\"font-weight: 400;\">Honestly, it was hard in 90s to get a magazine out here in Bulgaria. Right now, it’s still not so easy to get a copy of a magazine here. We are just nowhere for the skateboarding scene, and that sucks. That’s what we are trying to change with Stinky; trying to put Bulgaria on the map, at least for snowboarding.  </span></p>\n<p><span style=\"color: #ff0000;\"><b>Is it any different in snowboarding? Is snowboarding media in the same position?<br />\n</b></span>Unfortunately, it is in the same position. Since last Summer, NS distribution is the company that distributes the oldest snowboarding magazine (<a href=\"https://www.methodmag.com/\" target=\"_blank\" rel=\"noopener\">Method Mag</a>) in Europe to Europe, Asia and North America. I really hope we can help out that industry and make sure the mag gets in the hands of more kids. It’s free at local shops; you just need to go and grab it, and that’s really good.</p>\n<p><span style=\"color: #ff0000;\"><b>As a brand founder, what do you think about printed media? Would you be ready to pay for a full ad tomorrow? Why?<br />\n</b></span>It means a lot to me, ‘cause I grew up with magazines and that’s part of me. Nowadays, everything has changed. I would pay for sure if my brand can afford it, I won’t hesitate at all. But I would love to see the magazines push themselves a step further to create unique, meaningful content with value in it, for sure. We all need to adapt to the current way of consuming and I don’t think that’s a bad thing, as long as we can create stuff and stay true to what we believe in.</p>\n<p><span style=\"color: #ff0000;\"><b><a href=\"https://snowboarding.transworld.net/tag/strange-brew/\" target=\"_blank\" rel=\"noopener\">Strange Brew</a>, <a href=\"http://www.yawgoons.com/\" target=\"_blank\" rel=\"noopener\">Yawgoons</a>, <a href=\"https://snowboarding.transworld.net/tag/trash-league/\" target=\"_blank\" rel=\"noopener\">Trash League</a>, <a href=\"https://snowboarding.transworld.net/tag/gremlinz/\" target=\"_blank\" rel=\"noopener\">Gremlinz</a>, <a href=\"https://vimeo.com/ninjasquad\" target=\"_blank\" rel=\"noopener\">Ninja Squad</a>, <a href=\"http://toohard.bigcartel.com/\" target=\"_blank\" rel=\"noopener\">Too Hard</a>.. I’m going to put you on the spot here: Which crew has the best style? Last to leave the party?<br />\n</b></span>That’s a tough one! We had most of those dudes here in Bulgaria this winter. We invited a lot of them to join us here and film for our first Stinky snowboarding movie, so we spent two weeks traveling and partying around the country. It was a blast, because pretty much none of them had ever been in Bulgaria before. So they all party way too hard, and snowboard way too good.</p>\n<p><iframe src=\"https://player.vimeo.com/video/244640527\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><b>What would be your biggest advice for the readers who’d want to start a brand/company?<br />\n</b></span>Be yourself, don’t feel bad to be different and be constant in that.</p>\n<p><span style=\"color: #ff0000;\"><b>We are posted up in Boulder, Colorado for the next few months. What is your relationship with this town?<br />\n</b></span><span style=\"font-weight: 400;\">I used to live close to Boulder when I spent a season in Breckenridge ten years ago, and it was fun for sure. I think it&#8217;s a good spot; really good nature, I think 99% of the population there is into outdoor sports so that&#8217;s really good. They also have cool bars, the <a href=\"http://www.satelliteboardshop.com/\" target=\"_blank\" rel=\"noopener\">Satellite Skate Shop</a> looks good too. I hope we can sell Stinky there one day.</span></p>\n<p><span style=\"color: #ff0000;\"><b>Who would you be more stoked to see wearing your socks, Shaun White or Danny Way?<br />\n</b></span><b></b><span style=\"font-weight: 400;\">I’ll get stoked on both as long as they go to a local skate shop and buy them. Justin Mayer, who’s the greatest producer/filmer in snowboarding in my opinion, said once “I like poor snowboarders”. This is what I think as well. I don’t necessarily dislike them but I don’t really care about “athletes” and don’t really know much about those kinds of  “extreme sports famous people”. Does that make any sense?</span></p>\n<p><span style=\"color: #ff0000;\"><b>It sure does.</b></span></p>\n<p>&nbsp;</p>\n<h3><span style=\"color: #808080;\"><strong>Are you a subscriber of KrakBox? Sign up your friends and they will receive a free <a href=\"https://krakbox.com/shop/product/1093009947\">DEVOTED KrakBox Capsule</a> with a special pair of <a href=\"https://www.stinkyfamily.com/\">Stinky Socks</a> (SS &#8217;18 Line out now!). Sign up 3 friends and get a free Krak deck! Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"simon","categories":["interviews"],"tags":["devoted","interviews","krak-mag","risto-petkov","stinky-socks"],"featuredImages":[{"file":"risto-1-1.jpg","width":960,"height":641,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/risto-1-1.jpg"}],"video":""}