{"id":3127,"date":"2018-03-23T18:08:08","date_gmt":"2018-03-24T01:08:08","slug":"talking-music-and-skateboarding-with-doomtree-records","title":"Talking music and skateboarding with Doomtree Records","content":"<p><em>Music goes with skateboarding like beer goes with an awkward first date. It helps to set the mood and relax the vibe; creating a space for free flowing expression. While we don’t necessarily want to encourage your drinking habits, we’re all for turning up the volume when stepping on a board. We’ve got <a href=\"http://www.doomtree.net/\" target=\"_blank\" rel=\"noopener\">Doomtree Records</a> to thank for some new tunes to skate to and we’ve got skateboarding to thank for Doomtree Records&#8230;</em></p>\n<p><span style=\"color: #ff0000;\"><strong>Did skateboarding play a big role in bringing together Doomtree Records?<br />\n</strong></span><strong>Sims:</strong> I actually met P.O.S and Paper Tiger, as well as my Doomtree cohort Cecil Otter, through skateboarding. I was a few years younger than those guys but that’s something that the skate community gives people, a chance to meet like-minded people whom they might not otherwise get a chance to meet.</p>\n<p><span style=\"color: #ff0000;\"><strong>Between spending time in the studio and going on tour do you still find time to skate?<br />\n</strong></span><strong>Sims:</strong> We used to skate a lot before we got old, sore and too into rap music. We all still push around and maybe hit a mini ramp here and there, but we are not really active skaters at present. But as kids, skating was pretty much all we did.<br />\n<strong>Paper Tiger:</strong> The closest I get these days is pushing around the neighborhood, just running to a store or something. If I get a few ollies in on the way I feel like I’m ripping.</p>\n<p><iframe src=\"https://www.youtube.com/embed/FN9QEorY_8g?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"color: #ff0000;\"><strong>What were your favourite spots or parks to skate?<br />\n</strong></span><strong>Sims:</strong> Stairs and ledges. RIP my ankles.<br />\n<strong>Paper Tiger:</strong> When I was growing up my favorite spots were in Downtown Minneapolis and St. Paul. The federal building was kinda the main spot. This was ‘94/’95 when I was skating there a lot. Sometimes I would roll up and there would be 60 kids there. 5th street towers, the government center, and the marble ledges on Nicollet Mall were great.</p>\n<p><span style=\"color: #ff0000;\"><strong>What similarities do you see, if any, between skateboarding and making music? Does one inspire the other?<br />\n</strong></span><strong>Sims:</strong> I discovered a ton of music through skate videos. There was something that felt unified between the music and skate culture&#8230; independence maybe. It felt like you could just pick up a skateboard or pick up an instrument and just go rip, without restriction or permission.<br />\n<strong>Paper Tiger:</strong> Skateboarding informed my cultural interests early on, and was my gateway to counter culture. Literally everything I do can be traced back to my skateboarding roots: music, fashion, graphic design, photography&#8230; I learned it all through the culture.</p>\n<p><span style=\"color: #ff0000;\"><strong>In 3 words, how would you each describe your music?<br />\n</strong></span><strong>Sims:</strong> Heady. Fun. Challenging.<br />\n<strong>Paper Tiger:</strong> Fast. Hard. Soft.<br />\n<strong>Lazerbreak:</strong> Extreme. Lava. Bangers.</p>\n<div id=\"attachment_3134\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3134\" class=\"wp-image-3134 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/doomtree2.jpg\" alt=\"Doomtree Records\" width=\"680\" height=\"453\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/doomtree2.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/doomtree2.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3134\" class=\"wp-caption-text\">Photo: Zoe Prinds</p></div>\n<p><span style=\"color: #ff0000;\"><strong>If, in some alternate universe, you had become a professional skateboarder and were filming a video part, which song would you choose for it?<br />\n</strong></span><strong>Sims:</strong> Search and Destroy by The Stooges—no wait, Woo Hah by Busta Rhymes—NO! Vital Nerve by Company Flow.<br />\n<strong>Paper Tiger:</strong> Super Sharp Shooter by DJ Zinc<br />\n<strong>Lazerbreak:</strong> How Does It Feel by Kamaiyah</p>\n<p><span style=\"color: #ff0000;\"><strong>Which skate video do you think has the best soundtrack?<br />\n</strong></span><strong>Sims:</strong> <a href=\"https://www.youtube.com/watch?v=GfSZXQ3YeRk\" target=\"_blank\" rel=\"noopener\">Eastern Exposure 3</a><br />\n<strong>Paper Tiger:</strong> <a href=\"https://vimeo.com/161329337\" target=\"_blank\" rel=\"noopener\">Girl: Goldfish</a>. I also learned a ton about music from the 411 series.</p>\n<p><span style=\"color: #ff0000;\"><strong>Tell us about the Dangerous Jumps album…<br />\n</strong></span><strong>Paper Tiger:</strong> This project includes 4 members from Doomtree. We had been talking for a while about doing a project together that was a slight departure from what we had been doing. After making <a href=\"https://doomtree.bandcamp.com/album/all-hands\" target=\"_blank\" rel=\"noopener\">All Hands</a>, we wanted to make a collaborative project that focused on fast, short, and fun songs that spoke to where we are at in our lives currently.</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed KrakMag issue 16 that shipped with the Halloween <a href=\"https://krakbox.com\" target=\"_blank\" rel=\"noopener\">KrakBox</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["doomtree-records","interviews","krakmag","music"],"featuredImages":[{"file":"doomtree1.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/doomtree1.jpg"}],"video":""}