{"id":1941,"date":"2015-09-01T11:53:57","date_gmt":"2015-09-01T18:53:57","slug":"vivien-feil","title":"Founders Interview &#8211; Vivien Feil for Magenta Skateboards","content":"<p><span style=\"color: #ff0000;\"><strong>Founders Interview – Vivien Feil for Magenta Skateboards</strong></span></p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1946\" src=\"https://res.cloudinary.com/krak/image/upload/w_290/mag/uploads/vivien.png\" alt=\"vivien\" width=\"290\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_290/mag/uploads/vivien.png 290w, https://res.cloudinary.com/krak/image/upload/mag/uploads/vivien.png 587w\" sizes=\"(max-width: 290px) 100vw, 290px\" /></a></p>\n<p>&nbsp;</p>\n<p><em>Vivien Feil, co-founded Magenta with his brother Jean and their good friend Soy Panday in 2010. Now going strong into their 5<sup>th</sup> year, we’re super excited to talk with Vivien about Magenta for the print Krak Mag and asked him a whole bunch of questions ranging from the genesis of the brand, to discussing the brand’s graphics as well as asking him how the concept of #WorldwideConnections became so fundamental to Magenta’s ethos. With a diverse roster of riders from around the world, Magenta has definitely defied any attempts to label or pigeon hole the company. Magenta Skateboards is just all about skateboarding and seeing the world with your friends. But don’t take it from us, hear it from the man himself, Mr Vivien Feil in his Founders Interview. This interview originally ran in our print Krak Mag issue #2 that came with the May 2015 KrakBox. &#8211; HK</em></p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>HK: Hi Vivien, thanks for doing this, we&#8217;re really hyped to have Magenta in the KrakBox! Can you tell us a little about yourself?</strong></span></p>\n<p><strong>Vivien:</strong> I’m Vivien Feil, I&#8217;m from Strasbourg, France. In my twenties I moved to Paris and stayed there for 6 years or so until I moved to Bordeaux 3 years ago. My main job is to run Magenta Skateboards.</p>\n<p><span style=\"color: #ff0000;\"><strong>Can you tell us how the idea of starting Magenta in 2010 with your brother Jean, and your good friend Soy Panday came about? What did you guys feel was missing in skateboarding at the time and what is your vision for the brand? </strong></span></p>\n<p>The idea came about because we love skateboarding but frankly the thing was starting to get really sucky back then in our view. Corporations have always controlled people&#8217;s perception of skating, and back then they were all big and annoying. You&#8217;d watch a skate video and feel like you&#8217;re watching the most annoying corporate TV ad. Either we were going to find another interest or start something to get us psyched on skating again. We chose to do just that and started Magenta.</p>\n<p>&nbsp;</p>\n<p><strong><span style=\"color: #ff0000;\">What was the hardest thing about starting a brand?</span> </strong></p>\n<p>The hardest part was going from the life or a sponsored skater: free travel and products and paid to basically do very little for years and have loads of free time, to running a small DIY business where you need to figure out half a million things every day. I&#8217;m still adjusting.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>While Magenta was started in France, it&#8217;s now viewed as a global company. Was this a deliberate direction that you guys decided to take?</strong></span></p>\n<p>Regarding our distribution, we started in France but there&#8217;s no way you can sustain a business selling products only to skate shops in France. If we hadn&#8217;t been open to sell abroad, it would have been very difficult to stay alive.<br />\n<span style=\"color: #ff0000;\"><strong>How do you all divide the roles within Magenta? What is your main role?</strong></span></p>\n<p>Soy does the art direction, my brother Jean shoots photos and handles the warehouse. I take care of production, contacting shops, organizing trips with the crew, and a bunch of video editing.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>How did the name Magenta come about?</strong></span><br />\nMagenta is the boulevard in Paris where Soy and I were roommates for years. That&#8217;s where we met most of our friends through skating, it was the place you&#8217;d crash if you were coming to town. We chose to name the company after the area.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>So why did you choose to be based in Bordeaux then?</strong></span><br />\nI had my first kid 3 years ago. At the time we were living in a ghetto part of Paris and raising a kid was gonna suck. So we chose to move to Bordeaux.</p>\n<p><span style=\"color: #ff0000;\"><strong>The first rider on Magenta was Leo Valls, how do you know him? You also have three US based riders, Ben Gore, Jimmy Lannon and Zach Lyons, and the Japanese rider Koichiro Uehara, who I might add are all extremely stylish skaters. How did they get on Magenta?</strong></span><br />\nWe met Leo on our first trip to Bordeaux over 10 years ago and stayed in touch. We met Jimmy in New York through our friend Ryan Garshell who does GX1000. Soy first met Ben in Florida on a Static 3 trip years back. We&#8217;d skate with him every time we&#8217;d go to SF and he eventually joined the crew. We met and befriended Zach Lyons in SF also. Koichiro came to Paris on a TBPR (Tight Booth Productions) trip and we met again in Osaka.</p>\n<p><span style=\"color: #ff0000;\"><strong>Magenta&#8217;s leaf logo is very characteristic. What is the meaning and story behind your logo? Who came up with the logo?</strong></span><br />\nSoy drew the logo, it&#8217;s a plant with one leaf standing out. The idea was that anything you do is still connected to the rest, no matter how original or different you want it to be.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-1943 aligncenter\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/INFINITY-SERIES-Magenta.jpg\" alt=\"INFINITY SERIES Magenta\" width=\"300\" height=\"226\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/INFINITY-SERIES-Magenta.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/INFINITY-SERIES-Magenta.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/INFINITY-SERIES-Magenta.jpg 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/INFINITY-SERIES-Magenta.jpg 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><strong><span style=\"color: #ff0000;\">Magenta&#8217;s graphics have always been very unique and really stand out against skateboarding’s current offerings. I particularly liked the Infinity series, where each rider&#8217;s board had a very interesting accompanying paragraph of text on the graphic. What was the inspiration for this series?</span> </strong><br />\nThanks. The inspiration came from scientific representations of the very small and very big, and how similar it all looks. It&#8217;s either a tribute to the limitation of the human mind or its greatness, depending on which perspective you are looking at it from.</p>\n<p><span style=\"color: #ff0000;\"><strong>What is your favorite series of board graphics Magenta has released?</strong></span><br />\nThe first one, the Headless series I&#8217;d say.</p>\n<p><strong><span style=\"color: #ff0000;\">How long have you been skateboarding? Do you remember your first setup?</span> </strong><br />\nI&#8217;ve been skating 18 years or so. My first setup was a supermarket piece of crap.</p>\n<p><span style=\"color: #ff0000;\"><strong>What&#8217;s your current setup?</strong></span></p>\n<p>My current setup is a Matias Elichabehere guest artist board 8.125”, Indy highs, 53mm Prize Fighter wheels.</p>\n<p><strong><span style=\"color: #ff0000;\">Who do you mainly skate with nowadays?</span> </strong><br />\nI skate a lot with Soy, as always. Masaki, Leo and the Bordeaux MINUIT heads too.</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you spend your time mainly in Bordeaux or are you on the road a lot?</strong></span><br />\nI travel a bunch usually, but I&#8217;ve been mostly staying in Bordeaux lately since I had my second child 6 months ago.</p>\n<p><strong><span style=\"color: #ff0000;\">What&#8217;s your favorite skate spot in Bordeaux?</span> </strong><br />\nAny marble flat ground in Bordeaux is fantastic for me.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>Bordeaux seems to have plenty of that. Which is your favorite city in France to skate in?</strong></span></p>\n<p>Paris is probably my favorite.</p>\n<p><span style=\"color: #ff0000;\"><strong>Magenta has a very strong connection with Japan. I know you also liked Far East Skate Network&#8217;s 2007 &#8220;Overground Broadcasting&#8221; video which had a huge influence on me as well. How did this strong connection with Japan come about? And how did you become friends with Takahiro Morita (FESN)?</strong></span><br />\nJapan is amazing. We&#8217;ve been going there for almost 10 years. Leo met Morita through Hagiwara from the FATBROS shop. He was at to the Tokyo premiere of &#8220;Overground Broadcasting&#8221; and met Morita there. Morita is the man, creative genius!</p>\n<p><strong><span style=\"color: #ff0000;\">He’s definitely super sick! He does his own thing. How many times have you been to Japan?</span> </strong><br />\nI&#8217;ve been there maybe 4-5 times? I try to go as often as I can. Last time we went we visited Fukushima&#8217;s irradiated area, that was pretty intense.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>That’s pretty heavy. What’s your favorite memory of your time there?</strong></span><br />\nMy favorite memory of Japan is probably meeting and skating with my friend John Lindsay the first time I visited.</p>\n<p><span style=\"color: #ff0000;\"><strong>Magenta has a small but growing US presence mainly through Josh Stewart&#8217;s Theories of Atlantis. Are there any plans to expand Magenta&#8217;s presence in the US?</strong></span><br />\nYes, we will build our flying Headquarters over in America in the next year and rule the country from this dominating position. Nah, we&#8217;re gonna keep it small as it should be.</p>\n<p><span style=\"color: #ff0000;\"><strong>Magenta has a very unique visual aesthetic, from the way the VX videos you guys put out are filmed and edited to the choice of music. How did this aesthetic come about?</strong></span></p>\n<p>I&#8217;d say French skate vids, Japan, East Coast skateboarding were the main influences.</p>\n<p><strong><span style=\"color: #ff0000;\">I didn’t think of the Japanese skateboarding influence but it makes sense now. Magenta&#8217;s Soleil Levant DVD will actually be in this KrakBox. What was the inspiration for that video and how long did the video take to complete?</span> </strong><br />\nSoleil Levant took about a year to make. We filmed in France and Japan. The inspiration was meeting and getting closer to Takahiro Morita and Japanese culture. We thought we&#8217;d give them a little tribute cause no one else did.</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you guys have another video in the works?</strong></span></p>\n<p>We&#8217;re gonna release a new vid later this year most probably.</p>\n<p><span style=\"color: #ff0000;\"><strong>That’s something to look forward to for sure. What other projects are currently in the pipeline for Magenta?</strong> <strong>I know you guys are doing a premium clothing line with Caste.</strong></span><br />\nLoads of cool stuff, but I&#8217;d rather keep it quiet so you get excited when it comes out.</p>\n<p><span style=\"color: #ff0000;\"><strong>Cool, I can’t wait! Which cities that you&#8217;ve traveled to have inspired you the most, from a skateboarding perspective, and from a non-skateboarding perspective?</strong></span></p>\n<p>NY is pretty tight both for skateboarding and everything else. I have great memories of Prague also. I was going there a lot at some point.</p>\n<p><span style=\"color: #ff0000;\"><strong>Any places you would really like to visit but haven&#8217;t been to yet?</strong></span><br />\nI haven&#8217;t been to Central or South America yet. That&#8217;s somewhere I’d love to go.</p>\n<p><span style=\"color: #ff0000;\"><strong>Magenta came up with the idea of #worldwideconnections. What does that mean to you? What&#8217;s the most unusual place you&#8217;ve heard from that is hyped on what Magenta is doing?</strong></span><br />\nWe didn&#8217;t come up with the idea that skateboarding is a fantastic reason to travel and meet dudes worldwide, we just pushed it. We have a lot of supporters in South America, even though we&#8217;ve never been there, which is surprising.</p>\n<p><span style=\"color: #ff0000;\"><strong>That’s really interesting. Any message you&#8217;d like to share with our readers?</strong></span><br />\nSkateboard a lot, relax and don&#8217;t take yourself too serious.</p>\n<p><span style=\"color: #ff0000;\"><strong>Thanks Vivien! Okay to wrap this up, who would you like to thank?</strong></span><br />\nThanks to every one at Magenta, shops, friends and supporters. Shout out to every skateboarder who keeps the spirit alive.</p>\n<p><strong> </strong></p>\n","author":"kev","categories":["interviews"],"tags":["ben-gore","bordeaux","jean-feil","jimmy-lannon","krak-mag","krakbox","leo-valls","magenta-skateboards","paris","soy-panday"],"featuredImages":[{"file":"vivien.png","width":587,"height":607,"mime_type":"image/png","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/vivien.png"}],"video":""}