{"id":2242,"date":"2015-10-21T10:25:25","date_gmt":"2015-10-21T17:25:25","slug":"youngblood-zander-gabriel","title":"Youngblood: Zander Gabriel","content":"<h3><span style=\"color: #999999;\"><strong>The following interview was originally featured in the print Krak Mag issue 3 that shipped with </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>#3 in August 2015. Don&#8217;t want to miss the next issue of the print Krak Mag? Want to receive epic skateboarding product every two months? Check out the </strong></span><span style=\"color: #999999;\"><strong><a href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a> </strong></span><span style=\"color: #999999;\"><strong>now!<em><br />\n</em></strong></span></h3>\n<p><a href=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/FullSizeRender3.jpg\"><img class=\"alignnone size-medium wp-image-2245\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/FullSizeRender3.jpg\" alt=\"FullSizeRender(3)\" width=\"300\" height=\"271\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/FullSizeRender3.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_1024/mag/uploads/FullSizeRender3.jpg 1024w, https://res.cloudinary.com/krak/image/upload/w_1080/mag/uploads/FullSizeRender3.jpg 1080w, https://res.cloudinary.com/krak/image/upload/mag/uploads/FullSizeRender3.jpg 1641w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><span style=\"color: #ff0000;\"><b>Krak Mag August Youngblood Interview &#8211; Zander Gabriel</b></span></p>\n<p><i>One of the best things about skateboarding is meeting the coolest, chillest people who share your love for riding this little four-wheeled plank of wood. You might speak different languages, and/or come from totally different places but as long as you skate, you can always relate. Zander has been quietly killing it on the board for a while; with the cleanest style and a consistency we all wish we had. Equally at ease skating tall-ass ledges, gaps, stair sets and rails, Zander almost makes skateboarding look too easy. Rolling with the #Switchmade crew, Zander is among the next crop of shredders to walk softly and carry a big stick, letting their tricks speak for themselves. Throw in the occasional NBD down the MACBA Big Four and a to die for hardflip, and you know he’s definitely one to keep an eye out for in the future. The future is now.  &#8211; HK</i></p>\n<p><span style=\"color: #ff0000;\"><b>HK: Hey Zander, hyped to get this interview going. To start, you want to tell our readers who you are?</b></span></p>\n<p>Hey HK! Stoked to do this interview! Let&#8217;s get started. My full name is Alexander Michael Gabriel. I&#8217;m 24 and I was born in Newport Beach. I lived in King Beach until I was 10, then moved to a small town called Ojai. So I would say I&#8217;m from Ojai.</p>\n<p><span style=\"color: #ff0000;\"><b>So you partly grew up in Ojai? What&#8217;s it like there? I&#8217;ve never been there but I know that it&#8217;s pretty well known for organic agriculture and some really great tasting oranges, and being pretty welcoming of hippies and the New Age movement.</b></span></p>\n<p>I lived in Ojai from age 10 to 18. So I went to high school there as well. It&#8217;s funny that you mention the great tasting oranges because I lived on a Sunkist orange grove for most of my high school years! And yes they are great.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2246 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_frontblunt_photoby_JoeBeckert.jpeg\" alt=\"ZanderGabriel_frontblunt_photoby_JoeBeckert\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_frontblunt_photoby_JoeBeckert.jpeg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/ZanderGabriel_frontblunt_photoby_JoeBeckert.jpeg 150w, https://res.cloudinary.com/krak/image/upload/mag/uploads/ZanderGabriel_frontblunt_photoby_JoeBeckert.jpeg 640w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Frontside bluntslide. Photo: Joe Beckert</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Tell us something a little unique about the place?</b></span></p>\n<p>A fun little fact. Rodney Mullen lives in Ojai. I would always see him in parking lots late at night skating with his dog. It was cool to see as a kid.</p>\n<p><span style=\"color: #ff0000;\"><b>Haha no way! How and when did you get into skateboarding?</b></span></p>\n<p>I started skating when I was about nine when I lived in Costa Mesa, rolling down hills on my butt. It really started when I moved to Ojai when I was ten. That’s when I learned how to ollie and drop in.</p>\n<p><span style=\"color: #ff0000;\"><b>Do you remember your first setup?</b></span></p>\n<p>My first setup was a sick dragon board from Target or something. I still remember the graphics ha.</p>\n<p>But my first real setup was the OG Baker board, Venture trucks and Bones wheels.</p>\n<p><span style=\"color: #ff0000;\"><b>What’s your current setup?</b> <b>Break it down for us.</b></span></p>\n<p>8.25” Sensitive Skateboards deck, Mob Grip, 8.38” Mini Logo trucks, 52mm Mini Logo wheels and bearings.</p>\n<p><span style=\"color: #ff0000;\"><b>What&#8217;s the skate scene like out there in Ojai? Do you have a bunch of parks and any famous or amazing spots? </b></span></p>\n<p>The skate scene when I was growing up was really cool. We had a wood skatepark in the middle of town that I would go to every day after school. The park had the best wood mini ramp so I learned to skate tranny too.  Being from a small town gave me more drive to skate harder and go bigger. There are definitely some fun spots in Ojai, the cops are bored with nothing to do so they would always give us tickets and make skating a big deal. There were a bunch of famous pools out at Lake Casitas that were in a lot of videos like Zero’s Dying to Live.  It has been a long journey of fundraisers and skate contests to raise the money but we now have a concrete park that&#8217;s really fun. You should definitely go check it out if you haven&#8217;t before.</p>\n<p><b><span style=\"color: #ff0000;\">Any other skateboarders we might have heard of that have come from Ojai?</span> </b></p>\n<p>No big pros from Ojai but Mike Anderson and Moose are from the Ventura Oxnard area so you see them rolling around every once in a while. Oh, and Dave England from Jackass grew up around Ojai.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2248 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_frontnoseblunt_photoby_SeanMichon.jpg\" alt=\"ZanderGabriel_frontnoseblunt_photoby_SeanMichon\" width=\"300\" height=\"200\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_frontnoseblunt_photoby_SeanMichon.jpg 300w, https://res.cloudinary.com/krak/image/upload/mag/uploads/ZanderGabriel_frontnoseblunt_photoby_SeanMichon.jpg 640w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>&nbsp;</p>\n<p><em>Frontside nosebluntslide. Photo: Sean Michon</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Who was your crew out there?</b></span></p>\n<p>We had a crew called ESC, which was my brother and some close friends. My Mom and Dad were very supportive and would drive us all to contests and street spots. And my Dad would take pics and make posters haha.</p>\n<p><span style=\"color: #ff0000;\"><b>That must have been pretty sick to have your folks backing skateboarding! What does ESC stand for?</b></span></p>\n<p>Emergency Skate Crew.</p>\n<p><span style=\"color: #ff0000;\"><b>Haha that’s awesome! When did you move to LA? And why?</b></span></p>\n<p>After high school I moved to Santa Barbara and went to SBCC for a few years. The Santa Barbara skate scene is awesome with the skate park on the beach and all the skateboard history with Shorty’s, and a bunch of good spots.  But after a few years of that I needed a change and LA was the place. I moved to LA because that&#8217;s where the skate industry is. And I&#8217;m glad I did. I’ve met so many cool people and skated the best spots.</p>\n<p><span style=\"color: #ff0000;\"><b>Where in LA do you live now?</b></span></p>\n<p>I currently live in Santa Monica by the beach. It&#8217;s the best. And I have the Courthouse and Stoner 5 mins away.</p>\n<p><span style=\"color: #ff0000;\"><b>You skate with Micky Papa a lot, and you both are super consistent. How did you meet Micky? What&#8217;s the secret to getting that consistent? You have your shit seriously dialed!</b></span></p>\n<p>Yeah, me and Micky are real good homies. I met Micky through filming with Tomo the Homeless (Tomohiko Sumi). Micky&#8217;s a skateboarding machine. Talk about consistent ha! I would say the key is to just spend time on the board and have fun. The rest will come on its own.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2247 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_frontfeeble_photby_SeanMichon.jpg\" alt=\"ZanderGabriel_frontfeeble_photby_SeanMichon\" width=\"300\" height=\"199\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_frontfeeble_photby_SeanMichon.jpg 300w, https://res.cloudinary.com/krak/image/upload/mag/uploads/ZanderGabriel_frontfeeble_photby_SeanMichon.jpg 640w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>&nbsp;</p>\n<p><em>Front feebs. Photo: Sean Michon.</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>I saw footage of your hardflip backside 5-0 at the lockwood bank to bench. That shit is seriously crazy. How many tries did that take?</b></span></p>\n<p>That was a fun day. I was out skating the Sammy Baptista and the Skate Sauce guys and thought that would be a cool one to do. It took me an hour or so. It felt good to be rolling away. And I&#8217;m stoked they used it in the Primitive video.</p>\n<p><span style=\"color: #ff0000;\"><b>Your MACBA big four 360 hardflip footage with a broken board was crazy! And it was crazy to see Jesse Silvey give you props after you landed it. How did that trick go down, was it just something you tried spontaneously at the session or had you already thought about trying that trick at that spot for a while?</b></span></p>\n<p>That trip was a blast. I went to Barcelona for a week with Jesse Silvey and Rick from Skate All Cities. I definitely had the trick in mind for that spot. That day when we went to MACBA was actually the last day of the trip. I was really tired from the week of skating but I wanted to do it so bad. I started throwing the 360 hardflips out there and it looked like it was gonna work. I started sticking them and then on one of them I snapped my nose. I was so pissed and bummed. But it didn&#8217;t fall all the way off so I decided to power through it and try a few more. 5 minutes later I landed it! And it was the best feeling to get it and to have Jesse and all the MACBA locs there giving me love. It felt good to get on the plane back to LA knowing I did a NBD at MACBA.</p>\n<p><a href=\"https://itunes.apple.com/us/app/krak/id916474561\" target=\"_blank\"><img class=\" size-medium wp-image-2249 alignleft\" src=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_treflip_photoby_BenjiBearman.jpg\" alt=\"ZanderGabriel_treflip_photoby_BenjiBearman\" width=\"300\" height=\"300\" srcset=\"https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/ZanderGabriel_treflip_photoby_BenjiBearman.jpg 300w, https://res.cloudinary.com/krak/image/upload/w_150/mag/uploads/ZanderGabriel_treflip_photoby_BenjiBearman.jpg 150w, https://res.cloudinary.com/krak/image/upload/mag/uploads/ZanderGabriel_treflip_photoby_BenjiBearman.jpg 640w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Treflip. Photo: Benji Bearman</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><span style=\"color: #ff0000;\"><b>Who do you roll with out here in LA?</b></span></p>\n<p>Normally the crew is Micky, my brother Jameson, John (Oskvarek), sometimes Elliot (Murphy). Switchmade all day!</p>\n<p><span style=\"color: #ff0000;\"><b>Favorite skate spot in LA?</b></span></p>\n<p>My favorite street spot would have to be the Belmont nine rail when it was skateable. So many fun sessions there back in the day. My favorite park would have to be Sheldon park at the moment, so many different fun things to skate.</p>\n<p><span style=\"color: #ff0000;\"><b>What&#8217;s your favorite trick? And what&#8217;s the secret to getting your hardflips rotated like yours? Haha</b></span></p>\n<p>Favorite trick would probably be treflips. It just feels so good! Haha thanks HK! Yeah, hardflips are definitely second.</p>\n<p><span style=\"color: #ff0000;\"><b>Mandatory question, favorite video, and favorite video part?</b></span></p>\n<p>I would have to say it&#8217;s a tie between Yeah Right and Menikmati. We Are Blood was sick too.</p>\n<p><span style=\"color: #ff0000;\"><b>Favorite skateboarder? Most underrated?</b></span></p>\n<p>I enjoy Sean Malto’s back over crooks. Most underrated? Micky Papa. He should be pro. Hashtag #switchmade!</p>\n<p><span style=\"color: #ff0000;\"><b>Micky is way underrated!! Favorite up and coming skateboarder?</b></span></p>\n<p>The little Brazilian kid Wacson Mass that just won Damn Am Costa Mesa.</p>\n<p><span style=\"color: #ff0000;\"><b>That kid’s good.</b> <b>Are you working on any projects right now? Where can we see more of your footage?</b></span></p>\n<p>I am. I have two parts that I’ve been filming for. One is a HD part that&#8217;s going to come out on the Ride Channel or the Transworld site and the other is a VX part that should be coming out soon as well.</p>\n<p><span style=\"color: #ff0000;\"><b>Random question, what&#8217;s your favorite spot to eat out in LA?</b></span></p>\n<p>I do valet parking in Beverly Hills at Ruth’s Chris Steak House so I get 50 percent off food and drinks. The steak and mashed potatoes are so bomb!</p>\n<p><span style=\"color: #ff0000;\"><b>That sounds good, I’ve gotta keep that spot in mind. Where do you hope to take it with skateboarding?</b></span></p>\n<p>Well, like everyone&#8217;s dream I would like to go pro and be the best of the best. But if that doesn’t work out I hope to find a job in the skateboard industry! Still being about to work and love your job!</p>\n<p><span style=\"color: #ff0000;\"><b>I think this about covers everything, whom do you want to thank?</b></span></p>\n<p>I would like to thank my parents for all the support and driving us to all the spots and contests. Thank you also to my brother Jameson, Nik Shaw and Ray for filming. I would also  like to thank <a href=\"http://focusapparel.com/skate/\" target=\"_blank\">Focus Apparel</a> for all the support and helping with entry fees and skate trips! Thanks Kevin! And all my other sponsors for keeping me fresh and ready to shred! Sensitive skateboards, <a href=\"https://instagram.com/3043boardshop/\" target=\"_blank\">3043 Boardshop</a>, <a href=\"http://minilogoskateboards.com/\" target=\"_blank\">Mini logo</a>, <a href=\"http://www.skatesauce.com\" target=\"_blank\">Skate Sauce Wax</a> and <a href=\"http://www.monsterenergy.com/\" target=\"_blank\">Monster Energy</a>!</p>\n<p><span style=\"color: #ff0000;\"><b>Alright, we’re done. Thanks for doing this Zander!</b> </span></p>\n<p><span style=\"color: #999999;\"><em>Liked this interview? Check out the print <span style=\"color: #ff0000;\">Krak Mag</span> in each <span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"http://box.skatekrak.com\" target=\"_blank\">KrakBox</a></span>  for more great content!</em></span></p>\n","author":"kev","categories":["interviews"],"tags":["3043-boardshop","los-angeles","mini-logo","monster-energy","ojai","sensitive-skateboards","skate-sauce","zander-gabriel"],"featuredImages":[{"file":"ZanderGabriel_frontfeeble_photby_SeanMichon.jpg","width":640,"height":424,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/ZanderGabriel_frontfeeble_photby_SeanMichon.jpg"}],"video":""}