{"id":3286,"date":"2018-05-14T11:53:44","date_gmt":"2018-05-14T18:53:44","slug":"yuri-murai-joy-and-sorrow-3","title":"Meet Yuri Murai the filmmaker behind Joy and Sorrow 3","content":"<p><em>There’s a lot more to skateboarding in Japan than the 2020 Tokyo Olympics. Though it only dates back a little over 30 years, skateboarding has deep roots there and a particularly strong girls scene. Filmmaker <a href=\"https://www.instagram.com/yuriyuri_desu/?hl=en\" target=\"_blank\" rel=\"noopener\">Yuri Murai</a>, has been documenting Japan’s female skaters since 2013 and last year released the third video in the series, Joy and Sorrow 3. </em></p>\n<p><span style=\"color: #ff0000;\"><strong>This is the third Joy and Sorrow DVD you have made. Why did you decide to start filming them and what inspired you to keep making more?<br />\n</strong></span>I had always wondered why there were no girl skate videos, although there are many boy skate videos. I met many girl skaters who were really good but there were no girl skate videos. I thought, if only there was a video that I could use to shout out to the world that there are many good and cool girl skaters in Japan. So I decided to make it.</p>\n<p>I made more because thoughts like “I wanna try this idea”, “I should’ve filmed it from this angle”, and such go through my head and it’s so fun to actually make the improvements in the sequels. To me it’s an endless fun cycle of creating and improving.</p>\n<div id=\"attachment_3290\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3290\" class=\"wp-image-3290 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-1.jpg\" alt=\"Mirei Tsuchida\" width=\"680\" height=\"971\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-1.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_210/mag/uploads/joy-and-sorrow-1.jpg 210w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3290\" class=\"wp-caption-text\">Mirei Tsuchida</p></div>\n<p><span style=\"color: #ff0000;\"><strong>What camera do you usually film with?<br />\n</strong></span>I use a Sony VX2000 camera. I always film skating (no photography) as I want to show the audience the speed and aggressiveness of the movement.</p>\n<p><span style=\"color: #ff0000;\"><strong>Do you film, edit and produce everything yourself? Do you have any support from skate brands?<br />\n</strong></span>Yes, I film, edit and produce everything on my own. None of the videos were sponsored or supported by skate brands. I personally think skateboarding is nothing but playing around, so when it comes to making videos, I just try to play around as seriously as I can.</p>\n<p><span style=\"color: #ff0000;\"><strong>Which skate video gets you most hyped to skate?<br />\n</strong></span>Ummm, there’s no video in particular. I just watch whatever video that matches my mood at the moment.</p>\n<p>Although I do love watching the billiard part from “Overground Broadcasting”, a Japanese skate video created by Morita Takahiro. I recommend anyone reading this to <a href=\"https://youtu.be/GlDo2i_tXIg\" target=\"_blank\" rel=\"noopener\">check it</a>!</p>\n<p><span style=\"color: #ff0000;\"><strong>How long have you been skating and what’s your favorite thing to skate?<br />\n</strong></span>I skate about 3–4 times a week. I don’t have any particular obstacles that I like skating. To me, it’s more about who you’re skating with. Any obstacle is fun as long as I’m skating it with people who I click with. I’d say quarter pipes are my forté though.</p>\n<div id=\"attachment_3291\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3291\" class=\"wp-image-3291 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-2.jpg\" alt=\"Yuri Murai on the VX\" width=\"680\" height=\"476\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-2.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_300/mag/uploads/joy-and-sorrow-2.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3291\" class=\"wp-caption-text\">Yuri Murai on the VX</p></div>\n<p><span style=\"color: #ff0000;\"><strong>There are more and more female skaters from Japan, like <a style=\"color: #ff0000;\" href=\"https://www.instagram.com/aori_nishimura/?hl=en\" target=\"_blank\" rel=\"noopener\">Aori Nishimura</a> and <a style=\"color: #ff0000;\" href=\"https://www.instagram.com/kisanakamuraa/?hl=en\" target=\"_blank\" rel=\"noopener\">Kisa Nakamura</a>, making names for themselves around the world. Has the number of Japanese female skaters increased recently or are they just now starting to travel and compete globally? What do you think has changed?<br />\n</strong></span>The number of female skaters in Japan has definitely been increasing over the past few years. It’s true that there have been some female skaters that went and skated abroad but most of them went for vacation and not for contests like Aori and Kisa. I think it’s only recently that skateboarding started becoming popular in Japan. To be honest, I’m not sure why this is happening. Maybe it’s because there are more skateparks in Japan than before.</p>\n<p><span style=\"color: #ff0000;\"><strong>What do you think about skateboarding being in the 2020 Tokyo Olympics?<br />\n</strong></span>Now, skaters are being picked up on general TV shows. It was impossible until now for something like this. It’s really changing. Even the number of skate parks is increasing. The number of people who started getting interested in skateboarding is up. I hope many people who are interested in Japanese skaters, parks, and films want to come skating in Japan from all over the world.</p>\n<p><span style=\"color: #ff0000;\"><strong>Can we expect to see Joy and Sorrow 4 in the future? What’s next for you, Yuri?<br />\n</strong></span>Joy And Sorrow 3 is going to be the last one for the series. My next goal is to create a video that would inspire other girls to be filmers.</p>\n<div id=\"attachment_3293\" style=\"width: 690px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-3293\" class=\"wp-image-3293 size-full\" src=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-4.jpg\" alt=\"Nanaka Fujisawa, noseslide\" width=\"680\" height=\"971\" srcset=\"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-4.jpg 680w, https://res.cloudinary.com/krak/image/upload/w_210/mag/uploads/joy-and-sorrow-4.jpg 210w\" sizes=\"(max-width: 680px) 100vw, 680px\" /><p id=\"caption-attachment-3293\" class=\"wp-caption-text\">Nanaka Fujisawa, noseslide</p></div>\n<p>Cover image: Yuri Murai filming Sayaka Jino Giannini. All photos courtesy of Yuri Murai.</p>\n<h3><span style=\"color: #808080;\"><strong>This interview was originally featured in the printed special edition Yeah Girl KrakMag that shipped with the <a href=\"https://krakbox.com/shop/product/1153774550\" target=\"_blank\" rel=\"noopener\">Yeah Girl capsule box</a>. Want to get your hands on a copy of the next printed KrakMag? Want to receive epic skateboarding product every two months? Check out the <a style=\"color: #808080;\" href=\"https://krakbox.com/\" target=\"_blank\" rel=\"noopener\">KrakBox</a> now!</strong></span></h3>\n","author":"kev","categories":["interviews"],"tags":["interviews","joy-and-sorrow-3","krakbox","krakmag","womens-skateboarding","yeah-girl","yuri-murai"],"featuredImages":[{"file":"joy-and-sorrow-3.jpg","width":680,"height":453,"mime_type":"image/jpeg","source_url":"https://res.cloudinary.com/krak/image/upload/mag/uploads/joy-and-sorrow-3.jpg"}],"video":""}